[NoCoverage] BlockStatement
src/app/cli.ts:109:23
   emitPromptfoo: Option.Option<string>,
 ): ReadonlyArray<ObservabilityEmitter> {
   const emitters: ObservabilityEmitter[] = [];
-  if (emitBraintrust) {
-    // CLI boundary: env is converted into typed emitter config here.
-    // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
-    const apiKey = process.env["BRAINTRUST_API_KEY"];
-    // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
-    const project = process.env["BRAINTRUST_PROJECT"] ?? "cc-judge";
-    if (apiKey !== undefined && apiKey.length > 0) {
-      emitters.push(new BraintrustEmitter({ apiKey, project }));
-    }
-  }
+  if (emitBraintrust) {}
   if (Option.isSome(emitPromptfoo)) {
     emitters.push(new PromptfooEmitter({ outputPath: emitPromptfoo.value }));

[Survived] StringLiteral
src/app/cli.ts:114:33
     // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
     const apiKey = process.env["BRAINTRUST_API_KEY"];
     // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
-    const project = process.env["BRAINTRUST_PROJECT"] ?? "cc-judge";
+    const project = process.env[""] ?? "cc-judge";
     if (apiKey !== undefined && apiKey.length > 0) {
       emitters.push(new BraintrustEmitter({ apiKey, project }));

[NoCoverage] EqualityOperator
src/app/cli.ts:115:33
     const apiKey = process.env["BRAINTRUST_API_KEY"];
     // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
     const project = process.env["BRAINTRUST_PROJECT"] ?? "cc-judge";
-    if (apiKey !== undefined && apiKey.length > 0) {
+    if (apiKey !== undefined && apiKey.length >= 0) {
       emitters.push(new BraintrustEmitter({ apiKey, project }));
     }

[NoCoverage] BlockStatement
src/app/cli.ts:119:37
       emitters.push(new BraintrustEmitter({ apiKey, project }));
     }
   }
-  if (Option.isSome(emitPromptfoo)) {
-    emitters.push(new PromptfooEmitter({ outputPath: emitPromptfoo.value }));
-  }
+  if (Option.isSome(emitPromptfoo)) {}
   return emitters;
 }

[Survived] LogicalOperator
src/app/cli.ts:129:7
   runtime: Option.Option<"subprocess">,
   bin: Option.Option<string>,
 ): AgentRuntime | undefined | "missing-bin" {
-  if (Option.isNone(runtime) && Option.isNone(bin)) return undefined;
+  if (Option.isNone(runtime) || Option.isNone(bin)) return undefined;
   if (Option.isNone(bin)) return "missing-bin";
   return new SubprocessRuntime({ bin: bin.value });

[Survived] ConditionalExpression
src/app/cli.ts:129:7
   runtime: Option.Option<"subprocess">,
   bin: Option.Option<string>,
 ): AgentRuntime | undefined | "missing-bin" {
-  if (Option.isNone(runtime) && Option.isNone(bin)) return undefined;
+  if (false) return undefined;
   if (Option.isNone(bin)) return "missing-bin";
   return new SubprocessRuntime({ bin: bin.value });

[Killed] BlockStatement
src/app/cli.ts:141:47
 // synchronously before resetting it.
 let lastExitCode: CliExitCode = 0;
 
-function setExitCode(code: CliExitCode): void {
-  lastExitCode = code;
-}
+function setExitCode(code: CliExitCode): void {}
 
 function consumeExitCode(): CliExitCode {
killedBy: main anthropic auth preflight fails early with exit 2 when claude auth preflight fails
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/cli.ts:179:36
     }
 
     const preflightMessage = formatJudgePreflightMessage(ensureJudgeReady(args.judgeBackend));
-    if (preflightMessage !== null) {
-      process.stderr.write(`cc-judge: ${preflightMessage}\n`);
-      setExitCode(2);
-      return;
-    }
+    if (preflightMessage !== null) {}
 
     const judge = new AnthropicJudgeBackend({ model: args.judge });
killedBy: main anthropic auth preflight fails early with exit 2 when claude auth preflight fails
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:179:9
     }
 
     const preflightMessage = formatJudgePreflightMessage(ensureJudgeReady(args.judgeBackend));
-    if (preflightMessage !== null) {
+    if (false) {
       process.stderr.write(`cc-judge: ${preflightMessage}\n`);
       setExitCode(2);
killedBy: main anthropic auth preflight fails early with exit 2 when claude auth preflight fails
statusReason: StrykerJS: Unknown test failure

[Survived] ObjectLiteral
src/app/cli.ts:185:45
       return;
     }
 
-    const judge = new AnthropicJudgeBackend({ model: args.judge });
+    const judge = new AnthropicJudgeBackend({});
     const emitters = buildObservability(args.emitBraintrust, args.emitPromptfoo);
 

[Killed] ObjectLiteral
src/app/cli.ts:194:43
       concurrency: args.concurrency,
       emitters,
       logLevel: args.logLevel,
-      ...(runtimeOverride !== undefined ? { runtime: runtimeOverride } : {}),
+      ...(runtimeOverride !== undefined ? {} : {}),
       ...(Option.isSome(args.githubComment) ? { githubComment: args.githubComment.value } : {}),
       ...(Option.isSome(args.githubCommentArtifactUrl)
killedBy: planned harness compiler + cli ingress dispatches `run` through the CLI with explicit harness YAML
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/cli.ts:215:17
     }
 
     process.stdout.write(`cc-judge: ${String(report.summary.passed)}/${String(report.summary.total)} passed\n`);
-    setExitCode(report.summary.failed === 0 ? 0 : 1);
+    setExitCode(report.summary.failed !== 0 ? 0 : 1);
   });
 }
killedBy: planned harness compiler + cli ingress dispatches `run` through the CLI with explicit harness YAML
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:215:17
     }
 
     process.stdout.write(`cc-judge: ${String(report.summary.passed)}/${String(report.summary.total)} passed\n`);
-    setExitCode(report.summary.failed === 0 ? 0 : 1);
+    setExitCode(false ? 0 : 1);
   });
 }
killedBy: planned harness compiler + cli ingress dispatches `run` through the CLI with explicit harness YAML
statusReason: StrykerJS: Unknown test failure

[NoCoverage] ArrowFunction
src/app/cli.ts:248:34
 
 function inspectHandler(args: InspectArgs): Effect.Effect<void, never, never> {
   return inspectRunAndPrint(args.runId, args.results).pipe(
-    Effect.tap(() => Effect.sync(() => setExitCode(0))),
+    Effect.tap(() => Effect.sync(() => undefined)),
     Effect.catchTag("InspectError", (error) =>
       Effect.sync(() => {

[NoCoverage] ArrowFunction
src/app/cli.ts:248:16
 
 function inspectHandler(args: InspectArgs): Effect.Effect<void, never, never> {
   return inspectRunAndPrint(args.runId, args.results).pipe(
-    Effect.tap(() => Effect.sync(() => setExitCode(0))),
+    Effect.tap(() => undefined),
     Effect.catchTag("InspectError", (error) =>
       Effect.sync(() => {

[NoCoverage] BlockStatement
src/app/cli.ts:250:25
   return inspectRunAndPrint(args.runId, args.results).pipe(
     Effect.tap(() => Effect.sync(() => setExitCode(0))),
     Effect.catchTag("InspectError", (error) =>
-      Effect.sync(() => {
-        const cause: InspectErrorCause = error.cause;
-        switch (cause._tag) {
-          case "RunNotFound":
-            process.stderr.write(`cc-judge: inspect: run not found: ${cause.runId}\n`);
-            setExitCode(2);
-            return;
-          case "DuplicateSeq":
-            process.stderr.write(
-              `cc-judge: inspect: duplicate seq ${String(cause.seq)} in run ${cause.runId}\n`,
-            );
-            setExitCode(2);
-            return;
-          default:
-            absurd(cause);
-        }
-      }),
+      Effect.sync(() => {}),
     ),
   );

[NoCoverage] StringLiteral
src/app/cli.ts:259:15
             return;
           case "DuplicateSeq":
             process.stderr.write(
-              `cc-judge: inspect: duplicate seq ${String(cause.seq)} in run ${cause.runId}\n`,
+              ``,
             );
             setExitCode(2);

[NoCoverage] ConditionalExpression
src/app/cli.ts:263:11
             );
             setExitCode(2);
             return;
-          default:
-            absurd(cause);
+          default:
         }
       }),

[NoCoverage] BlockStatement
src/app/cli.ts:317:39
  * which installs SIGINT/SIGTERM handlers, prints uncaught defects, and
  * exits with the chosen code.
  */
-export function cliEntrypoint(): void {
-  const program = main(process.argv.slice(2)).pipe(
-    Effect.tap((code) => Effect.sync(() => process.exit(code))),
-  );
-  NodeRuntime.runMain(program);
-}
+export function cliEntrypoint(): void {}
 

[NoCoverage] MethodExpression
src/app/cli.ts:318:24
  * exits with the chosen code.
  */
 export function cliEntrypoint(): void {
-  const program = main(process.argv.slice(2)).pipe(
+  const program = main(process.argv).pipe(
     Effect.tap((code) => Effect.sync(() => process.exit(code))),
   );

[NoCoverage] ArrowFunction
src/app/cli.ts:319:38
  */
 export function cliEntrypoint(): void {
   const program = main(process.argv.slice(2)).pipe(
-    Effect.tap((code) => Effect.sync(() => process.exit(code))),
+    Effect.tap((code) => Effect.sync(() => undefined)),
   );
   NodeRuntime.runMain(program);

[NoCoverage] ArrowFunction
src/app/cli.ts:319:16
  */
 export function cliEntrypoint(): void {
   const program = main(process.argv.slice(2)).pipe(
-    Effect.tap((code) => Effect.sync(() => process.exit(code))),
+    Effect.tap(() => undefined),
   );
   NodeRuntime.runMain(program);
