[NoCoverage] BlockStatement
src/runner/runtime.ts:143:33
         (workspace, exit) =>
           Exit.isSuccess(exit)
             ? Effect.void
-            : Effect.sync(() => {
-                try {
-                  rmSync(workspace.dir, { recursive: true, force: true });
-                } catch (error) {
-                  void error;
-                }
-              }),
+            : Effect.sync(() => {}),
       );
     });

[NoCoverage] BlockStatement
src/runner/runtime.ts:144:21
           Exit.isSuccess(exit)
             ? Effect.void
             : Effect.sync(() => {
-                try {
-                  rmSync(workspace.dir, { recursive: true, force: true });
-                } catch (error) {
+                try {} catch (error) {
                   void error;
                 }

[Survived] BooleanLiteral
src/runner/runtime.ts:145:67
             ? Effect.void
             : Effect.sync(() => {
                 try {
-                  rmSync(workspace.dir, { recursive: true, force: true });
+                  rmSync(workspace.dir, { recursive: true, force: false });
                 } catch (error) {
                   void error;

[NoCoverage] BooleanLiteral
src/runner/runtime.ts:145:54
             ? Effect.void
             : Effect.sync(() => {
                 try {
-                  rmSync(workspace.dir, { recursive: true, force: true });
+                  rmSync(workspace.dir, { recursive: false, force: true });
                 } catch (error) {
                   void error;

[NoCoverage] BlockStatement
src/runner/runtime.ts:146:33
             : Effect.sync(() => {
                 try {
                   rmSync(workspace.dir, { recursive: true, force: true });
-                } catch (error) {
-                  void error;
-                }
+                } catch (error) {}
               }),
       );

[Killed] BlockStatement
src/runner/runtime.ts:159:36
       readonly containerId?: string;
       readonly preparedImage?: PreparedImage;
     };
-    return Effect.gen(function* () {
-      if (dockerHandle.containerId !== undefined && dockerHandle.containerId.length > 0) {
-        const container = docker.getContainer(dockerHandle.containerId);
-        // Best-effort: an already-stopped container or one that AutoRemove
-        // already reaped both throw — those are expected on the cleanup
-        // path and not worth surfacing.
-        yield* Effect.tryPromise(() => container.kill()).pipe(Effect.catchAll(() => Effect.void));
-        yield* Effect.tryPromise(() => container.remove({ force: true })).pipe(
-          Effect.catchAll(() => Effect.void),
-        );
-      }
-      yield* Effect.sync(() => {
-        try {
-          rmSync(handle.workspaceDir, { recursive: true, force: true });
-        } catch (error) {
-          void error;
-        }
-      });
-      if (dockerHandle.preparedImage?.removeOnStop === true) {
-        const imageName = dockerHandle.preparedImage.image;
-        yield* Effect.tryPromise(() => docker.getImage(imageName).remove({ force: true })).pipe(
-          Effect.catchAll(() => Effect.void),
-        );
-      }
-    });
+    return Effect.gen(function* () {});
   }
 }
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/runtime.ts:160:90
       readonly preparedImage?: PreparedImage;
     };
     return Effect.gen(function* () {
-      if (dockerHandle.containerId !== undefined && dockerHandle.containerId.length > 0) {
-        const container = docker.getContainer(dockerHandle.containerId);
-        // Best-effort: an already-stopped container or one that AutoRemove
-        // already reaped both throw — those are expected on the cleanup
-        // path and not worth surfacing.
-        yield* Effect.tryPromise(() => container.kill()).pipe(Effect.catchAll(() => Effect.void));
-        yield* Effect.tryPromise(() => container.remove({ force: true })).pipe(
-          Effect.catchAll(() => Effect.void),
-        );
-      }
+      if (dockerHandle.containerId !== undefined && dockerHandle.containerId.length > 0) {}
       yield* Effect.sync(() => {
         try {
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/runtime.ts:160:53
       readonly preparedImage?: PreparedImage;
     };
     return Effect.gen(function* () {
-      if (dockerHandle.containerId !== undefined && dockerHandle.containerId.length > 0) {
+      if (dockerHandle.containerId !== undefined && dockerHandle.containerId.length <= 0) {
         const container = docker.getContainer(dockerHandle.containerId);
         // Best-effort: an already-stopped container or one that AutoRemove
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/runner/runtime.ts:166:66
         // already reaped both throw — those are expected on the cleanup
         // path and not worth surfacing.
         yield* Effect.tryPromise(() => container.kill()).pipe(Effect.catchAll(() => Effect.void));
-        yield* Effect.tryPromise(() => container.remove({ force: true })).pipe(
+        yield* Effect.tryPromise(() => container.remove({ force: false })).pipe(
           Effect.catchAll(() => Effect.void),
         );

[Survived] ObjectLiteral
src/runner/runtime.ts:166:57
         // already reaped both throw — those are expected on the cleanup
         // path and not worth surfacing.
         yield* Effect.tryPromise(() => container.kill()).pipe(Effect.catchAll(() => Effect.void));
-        yield* Effect.tryPromise(() => container.remove({ force: true })).pipe(
+        yield* Effect.tryPromise(() => container.remove({})).pipe(
           Effect.catchAll(() => Effect.void),
         );

[Killed] BlockStatement
src/runner/runtime.ts:170:32
           Effect.catchAll(() => Effect.void),
         );
       }
-      yield* Effect.sync(() => {
-        try {
-          rmSync(handle.workspaceDir, { recursive: true, force: true });
-        } catch (error) {
-          void error;
-        }
-      });
+      yield* Effect.sync(() => {});
       if (dockerHandle.preparedImage?.removeOnStop === true) {
         const imageName = dockerHandle.preparedImage.image;
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/runtime.ts:171:13
         );
       }
       yield* Effect.sync(() => {
-        try {
-          rmSync(handle.workspaceDir, { recursive: true, force: true });
-        } catch (error) {
+        try {} catch (error) {
           void error;
         }
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/runner/runtime.ts:173:25
       yield* Effect.sync(() => {
         try {
           rmSync(handle.workspaceDir, { recursive: true, force: true });
-        } catch (error) {
-          void error;
-        }
+        } catch (error) {}
       });
       if (dockerHandle.preparedImage?.removeOnStop === true) {

[Killed] BlockStatement
src/runner/runtime.ts:177:62
           void error;
         }
       });
-      if (dockerHandle.preparedImage?.removeOnStop === true) {
-        const imageName = dockerHandle.preparedImage.image;
-        yield* Effect.tryPromise(() => docker.getImage(imageName).remove({ force: true })).pipe(
-          Effect.catchAll(() => Effect.void),
-        );
-      }
+      if (dockerHandle.preparedImage?.removeOnStop === true) {}
     });
   }
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact end-to-end builds and runs the auto-tagged image
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/runner/runtime.ts:177:56
           void error;
         }
       });
-      if (dockerHandle.preparedImage?.removeOnStop === true) {
+      if (dockerHandle.preparedImage?.removeOnStop === false) {
         const imageName = dockerHandle.preparedImage.image;
         yield* Effect.tryPromise(() => docker.getImage(imageName).remove({ force: true })).pipe(
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact end-to-end builds and runs the auto-tagged image
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/runner/runtime.ts:179:83
       });
       if (dockerHandle.preparedImage?.removeOnStop === true) {
         const imageName = dockerHandle.preparedImage.image;
-        yield* Effect.tryPromise(() => docker.getImage(imageName).remove({ force: true })).pipe(
+        yield* Effect.tryPromise(() => docker.getImage(imageName).remove({ force: false })).pipe(
           Effect.catchAll(() => Effect.void),
         );
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact end-to-end builds and runs the auto-tagged image
statusReason: StrykerJS: Unknown test failure

[Survived] ObjectLiteral
src/runner/runtime.ts:179:74
       });
       if (dockerHandle.preparedImage?.removeOnStop === true) {
         const imageName = dockerHandle.preparedImage.image;
-        yield* Effect.tryPromise(() => docker.getImage(imageName).remove({ force: true })).pipe(
+        yield* Effect.tryPromise(() => docker.getImage(imageName).remove({})).pipe(
           Effect.catchAll(() => Effect.void),
         );

[Killed] BooleanLiteral
src/runner/runtime.ts:198:11
   prepare(agent: AgentDeclaration, plan: RunPlan): Effect.Effect<RuntimeHandle, AgentStartError, never> {
     const opts = this.#opts;
     return Effect.suspend(() => {
-      if (!existsSync(opts.bin)) {
+      if (existsSync(opts.bin)) {
         return Effect.fail(
           new AgentStartError({
killedBy: SubprocessRuntime rejects with BinaryNotFound when bin path does not exist
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/runtime.ts:198:34
   prepare(agent: AgentDeclaration, plan: RunPlan): Effect.Effect<RuntimeHandle, AgentStartError, never> {
     const opts = this.#opts;
     return Effect.suspend(() => {
-      if (!existsSync(opts.bin)) {
-        return Effect.fail(
-          new AgentStartError({
-            scenarioId: plan.scenarioId,
-            agentId: agent.id,
-            cause: AgentStartErrorCause.BinaryNotFound({
-              path: opts.bin,
-            }),
-          }),
-        );
-      }
+      if (!existsSync(opts.bin)) {}
       // createSubprocessHandle is sync today; the acquireUseRelease shape
       // guards against future failure paths and fiber interruption between
killedBy: SubprocessRuntime rejects with BinaryNotFound when bin path does not exist
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/runner/runtime.ts:227:33
         ({ dir }, exit) =>
           Exit.isSuccess(exit)
             ? Effect.void
-            : Effect.sync(() => {
-                try {
-                  rmSync(dir, { recursive: true, force: true });
-                } catch (error) {
-                  void error;
-                }
-              }),
+            : Effect.sync(() => {}),
       );
     });

[NoCoverage] BlockStatement
src/runner/runtime.ts:228:21
           Exit.isSuccess(exit)
             ? Effect.void
             : Effect.sync(() => {
-                try {
-                  rmSync(dir, { recursive: true, force: true });
-                } catch (error) {
+                try {} catch (error) {
                   void error;
                 }

[NoCoverage] BooleanLiteral
src/runner/runtime.ts:229:44
             ? Effect.void
             : Effect.sync(() => {
                 try {
-                  rmSync(dir, { recursive: true, force: true });
+                  rmSync(dir, { recursive: false, force: true });
                 } catch (error) {
                   void error;

[NoCoverage] BooleanLiteral
src/runner/runtime.ts:229:57
             ? Effect.void
             : Effect.sync(() => {
                 try {
-                  rmSync(dir, { recursive: true, force: true });
+                  rmSync(dir, { recursive: true, force: false });
                 } catch (error) {
                   void error;

[NoCoverage] BlockStatement
src/runner/runtime.ts:230:33
             : Effect.sync(() => {
                 try {
                   rmSync(dir, { recursive: true, force: true });
-                } catch (error) {
-                  void error;
-                }
+                } catch (error) {}
               }),
       );

[Killed] BlockStatement
src/runner/runtime.ts:239:30
   }
 
   stop(handle: RuntimeHandle): Effect.Effect<void, never, never> {
-    return Effect.sync(() => {
-      try {
-        rmSync(handle.workspaceDir, { recursive: true, force: true });
-      } catch (error) {
-        void error;
-      }
-    });
+    return Effect.sync(() => {});
   }
 }
killedBy: SubprocessRuntime creates and reaps the workspace tmpdir on a successful prepare/stop cycle
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/runtime.ts:240:11
 
   stop(handle: RuntimeHandle): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
-      try {
-        rmSync(handle.workspaceDir, { recursive: true, force: true });
-      } catch (error) {
+      try {} catch (error) {
         void error;
       }
killedBy: SubprocessRuntime creates and reaps the workspace tmpdir on a successful prepare/stop cycle
statusReason: StrykerJS: Unknown test failure

[Survived] StringLiteral
src/runner/runtime.ts:254:54
 ): Effect.Effect<{ readonly dir: string; readonly state: MutableWorkspaceState }, AgentStartError, never> {
   return Effect.try({
     try: () => {
-      const dir = mkdtempSync(path.join(os.tmpdir(), `cc-judge-${scenarioId}-`));
+      const dir = mkdtempSync(path.join(os.tmpdir(), ``));
       return {
         dir,

[NoCoverage] BlockStatement
src/runner/runtime.ts:349:16
   agent: AgentDeclaration,
 ): Effect.Effect<void, HarnessExecutionError, never> {
   return Effect.try({
-    try: () => {
-      const rootResolved = path.resolve(workspaceDir);
-      for (const file of files) {
-        const abs = path.resolve(rootResolved, file.path);
-        const rel = path.relative(rootResolved, abs);
-        if (rel.startsWith("..") || path.isAbsolute(rel)) {
-          throw new PathEscapeSignal(file.path);
-        }
-        mkdirSync(path.dirname(abs), { recursive: true });
-        writeFileSync(abs, file.content, "utf8");
-        state.baselineFiles.set(file.path, file.content);
-      }
-    },
+    try: () => {},
     catch: (error) =>
       new HarnessExecutionError({

[NoCoverage] BlockStatement
src/runner/runtime.ts:351:33
   return Effect.try({
     try: () => {
       const rootResolved = path.resolve(workspaceDir);
-      for (const file of files) {
-        const abs = path.resolve(rootResolved, file.path);
-        const rel = path.relative(rootResolved, abs);
-        if (rel.startsWith("..") || path.isAbsolute(rel)) {
-          throw new PathEscapeSignal(file.path);
-        }
-        mkdirSync(path.dirname(abs), { recursive: true });
-        writeFileSync(abs, file.content, "utf8");
-        state.baselineFiles.set(file.path, file.content);
-      }
+      for (const file of files) {}
     },
     catch: (error) =>

[NoCoverage] ConditionalExpression
src/runner/runtime.ts:354:13
       for (const file of files) {
         const abs = path.resolve(rootResolved, file.path);
         const rel = path.relative(rootResolved, abs);
-        if (rel.startsWith("..") || path.isAbsolute(rel)) {
+        if (true) {
           throw new PathEscapeSignal(file.path);
         }

[NoCoverage] MethodExpression
src/runner/runtime.ts:354:13
       for (const file of files) {
         const abs = path.resolve(rootResolved, file.path);
         const rel = path.relative(rootResolved, abs);
-        if (rel.startsWith("..") || path.isAbsolute(rel)) {
+        if (rel.endsWith("..") || path.isAbsolute(rel)) {
           throw new PathEscapeSignal(file.path);
         }

[NoCoverage] StringLiteral
src/runner/runtime.ts:367:15
         cause: HarnessExecutionCause.ExecutionFailed({
           message: error instanceof PathEscapeSignal
             ? `workspace path escapes root for agent ${agent.id}: ${error.wfPath}`
-            : `${plan.scenarioId} workspace write failed: ${error instanceof Error ? error.message : String(error)}`,
+            : ``,
         }),
       }),

[NoCoverage] StringLiteral
src/runner/runtime.ts:393:12
   abortSignal?: AbortSignal,
 ): Effect.Effect<Turn, AgentRunTimeoutError | HarnessExecutionError, never> {
     return runPromptProcess({
-      cmd: "docker",
+      cmd: "",
       args: ["exec", containerId, "claude", ...claudeArgs, prompt],
       plan,

[NoCoverage] StringLiteral
src/runner/runtime.ts:394:35
 ): Effect.Effect<Turn, AgentRunTimeoutError | HarnessExecutionError, never> {
     return runPromptProcess({
       cmd: "docker",
-      args: ["exec", containerId, "claude", ...claudeArgs, prompt],
+      args: ["exec", containerId, "", ...claudeArgs, prompt],
       plan,
       agent,

[Killed] BlockStatement
src/runner/runtime.ts:410:54
 // preserving Invariant I4 against double-injection.
 function buildSubprocessArgs(opts: SubprocessRuntimeOpts, prompt: string): ReadonlyArray<string> {
   const baseArgs = opts.extraArgs ?? DEFAULT_CLAUDE_ARGS;
-  if (baseArgs.includes(SUBPROCESS_PERMISSION_FLAG)) {
-    return [...baseArgs, prompt];
-  }
+  if (baseArgs.includes(SUBPROCESS_PERMISSION_FLAG)) {}
   const mode = opts.permissionMode ?? DEFAULT_SUBPROCESS_PERMISSION_MODE;
   return [...baseArgs, SUBPROCESS_PERMISSION_FLAG, mode, prompt];
killedBy: SubprocessRuntime permission-mode threading extraArgs --permission-mode wins; opt is suppressed and not duplicated
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/runtime.ts:410:7
 // preserving Invariant I4 against double-injection.
 function buildSubprocessArgs(opts: SubprocessRuntimeOpts, prompt: string): ReadonlyArray<string> {
   const baseArgs = opts.extraArgs ?? DEFAULT_CLAUDE_ARGS;
-  if (baseArgs.includes(SUBPROCESS_PERMISSION_FLAG)) {
+  if (false) {
     return [...baseArgs, prompt];
   }
killedBy: SubprocessRuntime permission-mode threading extraArgs --permission-mode wins; opt is suppressed and not duplicated
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/runtime.ts:430:15
   const args = buildSubprocessArgs(opts, prompt);
   // Runtime boundary: inherit the host environment unless the caller supplied one.
   // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
-  const env = opts.env !== undefined ? { ...process.env, ...opts.env } : process.env;
+  const env = false ? { ...process.env, ...opts.env } : process.env;
   return runPromptProcess({
     cmd: opts.bin,
killedBy: SubprocessRuntime permission-mode threading default opts inject acceptEdits exactly once
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/runner/runtime.ts:430:15
   const args = buildSubprocessArgs(opts, prompt);
   // Runtime boundary: inherit the host environment unless the caller supplied one.
   // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
-  const env = opts.env !== undefined ? { ...process.env, ...opts.env } : process.env;
+  const env = true ? { ...process.env, ...opts.env } : process.env;
   return runPromptProcess({
     cmd: opts.bin,

[Killed] BooleanLiteral
src/runner/runtime.ts:458:20
   readonly abortSignal?: AbortSignal;
 }): Effect.Effect<Turn, AgentRunTimeoutError | HarnessExecutionError, never> {
   return Effect.async((resume, signal) => {
-    let finished = false;
+    let finished = true;
     const turnIndex = params.state.turnsExecuted;
     const startedAt = new Date().toISOString();
killedBy: SubprocessRuntime permission-mode threading default opts inject acceptEdits exactly once
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/runner/runtime.ts:463:69
     const startedAt = new Date().toISOString();
     const startMs = Date.now();
     let timer: ReturnType<typeof setTimeout> | undefined;
-    const child: ChildProcess = spawn(params.cmd, [...params.args], {
-      cwd: params.cwd,
-      env: params.env,
-      stdio: ["ignore", "pipe", "pipe"],
-    });
+    const child: ChildProcess = spawn(params.cmd, [...params.args], {});
     let stdout = "";
     let stderr = "";
killedBy: SubprocessRuntime permission-mode threading default opts inject acceptEdits exactly once
statusReason: StrykerJS: Unknown test failure

[Survived] ArrayDeclaration
src/runner/runtime.ts:466:14
     const child: ChildProcess = spawn(params.cmd, [...params.args], {
       cwd: params.cwd,
       env: params.env,
-      stdio: ["ignore", "pipe", "pipe"],
+      stdio: [],
     });
     let stdout = "";

[Survived] BlockStatement
src/runner/runtime.ts:476:27
           message: `${params.agent.id} prompt execution aborted`,
         }),
       });
-    const cleanup = () => {
-      if (timer !== undefined) {
-        clearTimeout(timer);
-        timer = undefined;
-      }
-      params.abortSignal?.removeEventListener("abort", onAbort);
-      signal.removeEventListener("abort", onAbort);
-      try {
-        child.kill("SIGKILL");
-      } catch (error) {
-        void error;
-      }
-    };
+    const cleanup = () => {};
     const onAbort = () => {
       if (finished) {

[Survived] BlockStatement
src/runner/runtime.ts:477:32
         }),
       });
     const cleanup = () => {
-      if (timer !== undefined) {
-        clearTimeout(timer);
-        timer = undefined;
-      }
+      if (timer !== undefined) {}
       params.abortSignal?.removeEventListener("abort", onAbort);
       signal.removeEventListener("abort", onAbort);

[Survived] ConditionalExpression
src/runner/runtime.ts:477:11
         }),
       });
     const cleanup = () => {
-      if (timer !== undefined) {
+      if (true) {
         clearTimeout(timer);
         timer = undefined;

[NoCoverage] StringLiteral
src/runner/runtime.ts:481:47
         clearTimeout(timer);
         timer = undefined;
       }
-      params.abortSignal?.removeEventListener("abort", onAbort);
+      params.abortSignal?.removeEventListener("", onAbort);
       signal.removeEventListener("abort", onAbort);
       try {

[Survived] BlockStatement
src/runner/runtime.ts:483:11
       }
       params.abortSignal?.removeEventListener("abort", onAbort);
       signal.removeEventListener("abort", onAbort);
-      try {
-        child.kill("SIGKILL");
-      } catch (error) {
+      try {} catch (error) {
         void error;
       }

[NoCoverage] BlockStatement
src/runner/runtime.ts:485:23
       signal.removeEventListener("abort", onAbort);
       try {
         child.kill("SIGKILL");
-      } catch (error) {
-        void error;
-      }
+      } catch (error) {}
     };
     const onAbort = () => {

[NoCoverage] BlockStatement
src/runner/runtime.ts:489:27
         void error;
       }
     };
-    const onAbort = () => {
-      if (finished) {
-        return;
-      }
-      finished = true;
-      cleanup();
-      resume(Effect.fail(abortError()));
-    };
+    const onAbort = () => {};
     child.stdout?.on("data", (chunk: Buffer) => {
       stdout += chunk.toString("utf8");

[NoCoverage] ConditionalExpression
src/runner/runtime.ts:490:11
       }
     };
     const onAbort = () => {
-      if (finished) {
+      if (true) {
         return;
       }

[NoCoverage] ConditionalExpression
src/runner/runtime.ts:490:11
       }
     };
     const onAbort = () => {
-      if (finished) {
+      if (false) {
         return;
       }

[NoCoverage] BooleanLiteral
src/runner/runtime.ts:493:18
       if (finished) {
         return;
       }
-      finished = true;
+      finished = false;
       cleanup();
       resume(Effect.fail(abortError()));

[NoCoverage] BlockStatement
src/runner/runtime.ts:497:49
       cleanup();
       resume(Effect.fail(abortError()));
     };
-    child.stdout?.on("data", (chunk: Buffer) => {
-      stdout += chunk.toString("utf8");
-    });
+    child.stdout?.on("data", (chunk: Buffer) => {});
     child.stderr?.on("data", (chunk: Buffer) => {
       stderr += chunk.toString("utf8");

[Survived] StringLiteral
src/runner/runtime.ts:500:22
     child.stdout?.on("data", (chunk: Buffer) => {
       stdout += chunk.toString("utf8");
     });
-    child.stderr?.on("data", (chunk: Buffer) => {
+    child.stderr?.on("", (chunk: Buffer) => {
       stderr += chunk.toString("utf8");
     });

[Killed] ConditionalExpression
src/runner/runtime.ts:503:9
     child.stderr?.on("data", (chunk: Buffer) => {
       stderr += chunk.toString("utf8");
     });
-    if (params.abortSignal?.aborted === true || signal.aborted === true) {
+    if (true) {
       finished = true;
       cleanup();
killedBy: SubprocessRuntime permission-mode threading default opts inject acceptEdits exactly once
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/runtime.ts:503:9
     child.stderr?.on("data", (chunk: Buffer) => {
       stderr += chunk.toString("utf8");
     });
-    if (params.abortSignal?.aborted === true || signal.aborted === true) {
+    if (params.abortSignal?.aborted !== true || signal.aborted === true) {
       finished = true;
       cleanup();
killedBy: SubprocessRuntime permission-mode threading default opts inject acceptEdits exactly once
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BooleanLiteral
src/runner/runtime.ts:504:18
       stderr += chunk.toString("utf8");
     });
     if (params.abortSignal?.aborted === true || signal.aborted === true) {
-      finished = true;
+      finished = false;
       cleanup();
       resume(Effect.fail(abortError()));

[NoCoverage] BooleanLiteral
src/runner/runtime.ts:509:68
       resume(Effect.fail(abortError()));
       return Effect.void;
     }
-    params.abortSignal?.addEventListener("abort", onAbort, { once: true });
+    params.abortSignal?.addEventListener("abort", onAbort, { once: false });
     signal.addEventListener("abort", onAbort, { once: true });
     timer = setTimeout(() => {

[Survived] BooleanLiteral
src/runner/runtime.ts:510:55
       return Effect.void;
     }
     params.abortSignal?.addEventListener("abort", onAbort, { once: true });
-    signal.addEventListener("abort", onAbort, { once: true });
+    signal.addEventListener("abort", onAbort, { once: false });
     timer = setTimeout(() => {
       if (finished) {

[Survived] ObjectLiteral
src/runner/runtime.ts:510:47
       return Effect.void;
     }
     params.abortSignal?.addEventListener("abort", onAbort, { once: true });
-    signal.addEventListener("abort", onAbort, { once: true });
+    signal.addEventListener("abort", onAbort, {});
     timer = setTimeout(() => {
       if (finished) {

[NoCoverage] BlockStatement
src/runner/runtime.ts:511:30
     }
     params.abortSignal?.addEventListener("abort", onAbort, { once: true });
     signal.addEventListener("abort", onAbort, { once: true });
-    timer = setTimeout(() => {
-      if (finished) {
-        return;
-      }
-      finished = true;
-      cleanup();
-      resume(
-        Effect.fail(
-          new AgentRunTimeoutError({
-            scenarioId: params.plan.scenarioId,
-            turnIndex,
-            timeoutMs: params.timeoutMs,
-          }),
-        ),
-      );
-    }, params.timeoutMs);
+    timer = setTimeout(() => {}, params.timeoutMs);
     child.on("close", () => {
       if (finished) {

[NoCoverage] ConditionalExpression
src/runner/runtime.ts:512:11
     params.abortSignal?.addEventListener("abort", onAbort, { once: true });
     signal.addEventListener("abort", onAbort, { once: true });
     timer = setTimeout(() => {
-      if (finished) {
+      if (false) {
         return;
       }

[NoCoverage] ConditionalExpression
src/runner/runtime.ts:512:11
     params.abortSignal?.addEventListener("abort", onAbort, { once: true });
     signal.addEventListener("abort", onAbort, { once: true });
     timer = setTimeout(() => {
-      if (finished) {
+      if (true) {
         return;
       }

[Killed] BlockStatement
src/runner/runtime.ts:527:29
         ),
       );
     }, params.timeoutMs);
-    child.on("close", () => {
-      if (finished) {
-        return;
-      }
-      finished = true;
-      cleanup();
-      params.state.turnsExecuted += 1;
-      const parsed = parseStreamJson(stdout);
-      const responseText = parsed.response.length > 0 ? parsed.response : stderr;
-      resume(
-        Effect.succeed({
-          index: turnIndex,
-          prompt: params.prompt,
-          response: responseText,
-          startedAt,
-          latencyMs: Date.now() - startMs,
-          toolCallCount: parsed.toolCallCount,
-          inputTokens: parsed.inputTokens,
-          outputTokens: parsed.outputTokens,
-          cacheReadTokens: parsed.cacheReadTokens,
-          cacheWriteTokens: parsed.cacheWriteTokens,
-        }),
-      );
-    });
+    child.on("close", () => {});
     child.on("error", (error) => {
       if (finished) {
killedBy: SubprocessRuntime permission-mode threading default opts inject acceptEdits exactly once
statusReason: StrykerJS: Unknown test failure
