[Killed] ConditionalExpression
src/runner/runtime.ts:528:11
       );
     }, params.timeoutMs);
     child.on("close", () => {
-      if (finished) {
+      if (true) {
         return;
       }
killedBy: SubprocessRuntime permission-mode threading default opts inject acceptEdits exactly once
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/runner/runtime.ts:528:21
       );
     }, params.timeoutMs);
     child.on("close", () => {
-      if (finished) {
-        return;
-      }
+      if (finished) {}
       finished = true;
       cleanup();

[Survived] AssignmentOperator
src/runner/runtime.ts:533:7
       }
       finished = true;
       cleanup();
-      params.state.turnsExecuted += 1;
+      params.state.turnsExecuted -= 1;
       const parsed = parseStreamJson(stdout);
       const responseText = parsed.response.length > 0 ? parsed.response : stderr;

[Survived] ConditionalExpression
src/runner/runtime.ts:535:28
       cleanup();
       params.state.turnsExecuted += 1;
       const parsed = parseStreamJson(stdout);
-      const responseText = parsed.response.length > 0 ? parsed.response : stderr;
+      const responseText = false ? parsed.response : stderr;
       resume(
         Effect.succeed({

[NoCoverage] BlockStatement
src/runner/runtime.ts:551:34
         }),
       );
     });
-    child.on("error", (error) => {
-      if (finished) {
-        return;
-      }
-      finished = true;
-      cleanup();
-      resume(
-        Effect.fail(
-          new HarnessExecutionError({
-            cause: HarnessExecutionCause.ExecutionFailed({
-              message: `${params.agent.id} prompt execution failed: ${error.message}`,
-            }),
-          }),
-        ),
-      );
-    });
+    child.on("error", (error) => {});
     return Effect.sync(cleanup);
   });

[NoCoverage] BlockStatement
src/runner/runtime.ts:552:21
       );
     });
     child.on("error", (error) => {
-      if (finished) {
-        return;
-      }
+      if (finished) {}
       finished = true;
       cleanup();

[NoCoverage] ConditionalExpression
src/runner/runtime.ts:552:11
       );
     });
     child.on("error", (error) => {
-      if (finished) {
+      if (false) {
         return;
       }

[NoCoverage] StringLiteral
src/runner/runtime.ts:561:24
         Effect.fail(
           new HarnessExecutionError({
             cause: HarnessExecutionCause.ExecutionFailed({
-              message: `${params.agent.id} prompt execution failed: ${error.message}`,
+              message: ``,
             }),
           }),

[Killed] ConditionalExpression
src/runner/runtime.ts:576:5
   plan: RunPlan,
 ): Effect.Effect<PreparedImage, AgentStartError, never> {
   switch (agent.artifact._tag) {
-    case "DockerBuildArtifact":
-      return buildDockerImage(agent, plan);
+    case "DockerBuildArtifact":
     case "DockerImageArtifact":
       return ensureDockerImage(agent, plan);
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact end-to-end builds and runs the auto-tagged image
statusReason: StrykerJS: Unknown test failure

[NoCoverage] StringLiteral
src/runner/runtime.ts:594:20
         scenarioId: plan.scenarioId,
         agentId: agent.id,
         cause: AgentStartErrorCause.DockerBuildFailed({
-          message: `expected DockerBuildArtifact, received ${artifact._tag}`,
+          message: ``,
         }),
       }),

[Killed] BooleanLiteral
src/runner/runtime.ts:601:9
   }
   return Effect.suspend(() => {
     const contextPath = path.resolve(artifact.contextPath);
-    if (!existsSync(contextPath)) {
+    if (existsSync(contextPath)) {
       return Effect.fail(
         new AgentStartError({
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact end-to-end builds and runs the auto-tagged image
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/runner/runtime.ts:601:35
   }
   return Effect.suspend(() => {
     const contextPath = path.resolve(artifact.contextPath);
-    if (!existsSync(contextPath)) {
-      return Effect.fail(
-        new AgentStartError({
-          scenarioId: plan.scenarioId,
-          agentId: agent.id,
-          cause: AgentStartErrorCause.BuildContextMissing({
-            path: contextPath,
-          }),
-        }),
-      );
-    }
+    if (!existsSync(contextPath)) {}
     const autoTag = `cc-judge-${sanitizeId(plan.scenarioId)}-${sanitizeId(agent.id)}-${Date.now()}`;
     const imageTag = artifact.imageTag ?? autoTag;

[Killed] EqualityOperator
src/runner/runtime.ts:614:21
     }
     const autoTag = `cc-judge-${sanitizeId(plan.scenarioId)}-${sanitizeId(agent.id)}-${Date.now()}`;
     const imageTag = artifact.imageTag ?? autoTag;
-    const ownsTag = artifact.imageTag === undefined;
+    const ownsTag = artifact.imageTag !== undefined;
     // dockerode wants Dockerfile as a path RELATIVE to the build context
     // (it embeds the file inside the streamed tarball); resolve to the
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact end-to-end builds and runs the auto-tagged image
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/runtime.ts:614:21
     }
     const autoTag = `cc-judge-${sanitizeId(plan.scenarioId)}-${sanitizeId(agent.id)}-${Date.now()}`;
     const imageTag = artifact.imageTag ?? autoTag;
-    const ownsTag = artifact.imageTag === undefined;
+    const ownsTag = true;
     // dockerode wants Dockerfile as a path RELATIVE to the build context
     // (it embeds the file inside the streamed tarball); resolve to the
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact failure preserves a user-supplied imageTag
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/runner/runtime.ts:623:11
       : undefined;
     const buildOpts: Docker.ImageBuildOptions = {
       t: imageTag,
-      ...(dockerfileRel !== undefined ? { dockerfile: dockerfileRel } : {}),
+      ...(true ? { dockerfile: dockerfileRel } : {}),
       ...(artifact.target !== undefined ? { target: artifact.target } : {}),
       ...(artifact.buildArgs !== undefined ? { buildargs: { ...artifact.buildArgs } } : {}),

[Survived] EqualityOperator
src/runner/runtime.ts:623:11
       : undefined;
     const buildOpts: Docker.ImageBuildOptions = {
       t: imageTag,
-      ...(dockerfileRel !== undefined ? { dockerfile: dockerfileRel } : {}),
+      ...(dockerfileRel === undefined ? { dockerfile: dockerfileRel } : {}),
       ...(artifact.target !== undefined ? { target: artifact.target } : {}),
       ...(artifact.buildArgs !== undefined ? { buildargs: { ...artifact.buildArgs } } : {}),

[Killed] ConditionalExpression
src/runner/runtime.ts:624:11
     const buildOpts: Docker.ImageBuildOptions = {
       t: imageTag,
       ...(dockerfileRel !== undefined ? { dockerfile: dockerfileRel } : {}),
-      ...(artifact.target !== undefined ? { target: artifact.target } : {}),
+      ...(true ? { target: artifact.target } : {}),
       ...(artifact.buildArgs !== undefined ? { buildargs: { ...artifact.buildArgs } } : {}),
     };
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact failure preserves a user-supplied imageTag
statusReason: StrykerJS: Unknown test failure

[Survived] EqualityOperator
src/runner/runtime.ts:624:11
     const buildOpts: Docker.ImageBuildOptions = {
       t: imageTag,
       ...(dockerfileRel !== undefined ? { dockerfile: dockerfileRel } : {}),
-      ...(artifact.target !== undefined ? { target: artifact.target } : {}),
+      ...(artifact.target === undefined ? { target: artifact.target } : {}),
       ...(artifact.buildArgs !== undefined ? { buildargs: { ...artifact.buildArgs } } : {}),
     };

[Killed] ConditionalExpression
src/runner/runtime.ts:625:11
       t: imageTag,
       ...(dockerfileRel !== undefined ? { dockerfile: dockerfileRel } : {}),
       ...(artifact.target !== undefined ? { target: artifact.target } : {}),
-      ...(artifact.buildArgs !== undefined ? { buildargs: { ...artifact.buildArgs } } : {}),
+      ...(true ? { buildargs: { ...artifact.buildArgs } } : {}),
     };
     return runDockerBuild(contextPath, buildOpts).pipe(
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact failure preserves a user-supplied imageTag
statusReason: StrykerJS: Unknown test failure

[NoCoverage] ObjectLiteral
src/runner/runtime.ts:625:46
       t: imageTag,
       ...(dockerfileRel !== undefined ? { dockerfile: dockerfileRel } : {}),
       ...(artifact.target !== undefined ? { target: artifact.target } : {}),
-      ...(artifact.buildArgs !== undefined ? { buildargs: { ...artifact.buildArgs } } : {}),
+      ...(artifact.buildArgs !== undefined ? {} : {}),
     };
     return runDockerBuild(contextPath, buildOpts).pipe(

[Timeout] BlockStatement
src/runner/runtime.ts:679:49
 // messages from any errorDetail/error frames, or the followProgress
 // callback's err arg.
 function drainBuildStream(stream: NodeJS.ReadableStream): Effect.Effect<void, string, never> {
-  return Effect.async<void, string>((resume) => {
-    docker.modem.followProgress(stream, (err, output) => {
-      if (err !== null) {
-        resume(Effect.fail(err instanceof Error ? err.message : String(err)));
-        return;
-      }
-      const frames = (output ?? []) as ReadonlyArray<DockerStreamFrame>;
-      const errors = frames
-        .map((frame) => frame.errorDetail?.message ?? frame.error)
-        .filter((message): message is string => typeof message === "string" && message.length > 0);
-      if (errors.length > 0) {
-        resume(Effect.fail(errors.join("; ")));
-        return;
-      }
-      resume(Effect.void);
-    });
-  });
+  return Effect.async<void, string>((resume) => {});
 }
 

[Timeout] BlockStatement
src/runner/runtime.ts:680:58
 // callback's err arg.
 function drainBuildStream(stream: NodeJS.ReadableStream): Effect.Effect<void, string, never> {
   return Effect.async<void, string>((resume) => {
-    docker.modem.followProgress(stream, (err, output) => {
-      if (err !== null) {
-        resume(Effect.fail(err instanceof Error ? err.message : String(err)));
-        return;
-      }
-      const frames = (output ?? []) as ReadonlyArray<DockerStreamFrame>;
-      const errors = frames
-        .map((frame) => frame.errorDetail?.message ?? frame.error)
-        .filter((message): message is string => typeof message === "string" && message.length > 0);
-      if (errors.length > 0) {
-        resume(Effect.fail(errors.join("; ")));
-        return;
-      }
-      resume(Effect.void);
-    });
+    docker.modem.followProgress(stream, (err, output) => {});
   });
 }

[Killed] ConditionalExpression
src/runner/runtime.ts:681:11
 function drainBuildStream(stream: NodeJS.ReadableStream): Effect.Effect<void, string, never> {
   return Effect.async<void, string>((resume) => {
     docker.modem.followProgress(stream, (err, output) => {
-      if (err !== null) {
+      if (true) {
         resume(Effect.fail(err instanceof Error ? err.message : String(err)));
         return;
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact end-to-end builds and runs the auto-tagged image
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/runner/runtime.ts:681:25
 function drainBuildStream(stream: NodeJS.ReadableStream): Effect.Effect<void, string, never> {
   return Effect.async<void, string>((resume) => {
     docker.modem.followProgress(stream, (err, output) => {
-      if (err !== null) {
-        resume(Effect.fail(err instanceof Error ? err.message : String(err)));
-        return;
-      }
+      if (err !== null) {}
       const frames = (output ?? []) as ReadonlyArray<DockerStreamFrame>;
       const errors = frames

[Killed] MethodExpression
src/runner/runtime.ts:686:22
         return;
       }
       const frames = (output ?? []) as ReadonlyArray<DockerStreamFrame>;
-      const errors = frames
-        .map((frame) => frame.errorDetail?.message ?? frame.error)
-        .filter((message): message is string => typeof message === "string" && message.length > 0);
+      const errors = frames.map(frame => frame.errorDetail?.message ?? frame.error);
       if (errors.length > 0) {
         resume(Effect.fail(errors.join("; ")));
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact end-to-end builds and runs the auto-tagged image
statusReason: StrykerJS: Unknown test failure

[Survived] LogicalOperator
src/runner/runtime.ts:687:25
       }
       const frames = (output ?? []) as ReadonlyArray<DockerStreamFrame>;
       const errors = frames
-        .map((frame) => frame.errorDetail?.message ?? frame.error)
+        .map((frame) => frame.errorDetail?.message && frame.error)
         .filter((message): message is string => typeof message === "string" && message.length > 0);
       if (errors.length > 0) {

[Killed] EqualityOperator
src/runner/runtime.ts:688:80
       const frames = (output ?? []) as ReadonlyArray<DockerStreamFrame>;
       const errors = frames
         .map((frame) => frame.errorDetail?.message ?? frame.error)
-        .filter((message): message is string => typeof message === "string" && message.length > 0);
+        .filter((message): message is string => typeof message === "string" && message.length >= 0);
       if (errors.length > 0) {
         resume(Effect.fail(errors.join("; ")));
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact failure preserves a user-supplied imageTag
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/runtime.ts:688:80
       const frames = (output ?? []) as ReadonlyArray<DockerStreamFrame>;
       const errors = frames
         .map((frame) => frame.errorDetail?.message ?? frame.error)
-        .filter((message): message is string => typeof message === "string" && message.length > 0);
+        .filter((message): message is string => typeof message === "string" && message.length <= 0);
       if (errors.length > 0) {
         resume(Effect.fail(errors.join("; ")));
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact failure removes the auto-tagged partial image
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/runtime.ts:689:30
       const errors = frames
         .map((frame) => frame.errorDetail?.message ?? frame.error)
         .filter((message): message is string => typeof message === "string" && message.length > 0);
-      if (errors.length > 0) {
-        resume(Effect.fail(errors.join("; ")));
-        return;
-      }
+      if (errors.length > 0) {}
       resume(Effect.void);
     });
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact failure removes the auto-tagged partial image
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/runtime.ts:689:11
       const errors = frames
         .map((frame) => frame.errorDetail?.message ?? frame.error)
         .filter((message): message is string => typeof message === "string" && message.length > 0);
-      if (errors.length > 0) {
+      if (true) {
         resume(Effect.fail(errors.join("; ")));
         return;
killedBy: DockerRuntime (integration, real Docker) DockerBuildArtifact end-to-end builds and runs the auto-tagged image
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/runner/runtime.ts:702:73
 // failure/teardown path where surfacing a secondary error would mask
 // the primary one.
 function bestEffortRemoveImage(image: string): Effect.Effect<void, never, never> {
-  return Effect.tryPromise(() => docker.getImage(image).remove({ force: true })).pipe(
+  return Effect.tryPromise(() => docker.getImage(image).remove({ force: false })).pipe(
     Effect.catchAll(() => Effect.void),
   );

[Survived] ObjectLiteral
src/runner/runtime.ts:702:64
 // failure/teardown path where surfacing a secondary error would mask
 // the primary one.
 function bestEffortRemoveImage(image: string): Effect.Effect<void, never, never> {
-  return Effect.tryPromise(() => docker.getImage(image).remove({ force: true })).pipe(
+  return Effect.tryPromise(() => docker.getImage(image).remove({})).pipe(
     Effect.catchAll(() => Effect.void),
   );

[NoCoverage] StringLiteral
src/runner/runtime.ts:718:18
         scenarioId: plan.scenarioId,
         agentId: agent.id,
         cause: AgentStartErrorCause.ImageMissing({
-          image: `invalid-artifact:${artifact._tag}`,
+          image: ``,
         }),
       }),

[Killed] EqualityOperator
src/runner/runtime.ts:727:37
   const pullPolicy = artifact.pullPolicy ?? "if-missing";
   return Effect.gen(function* () {
     const initiallyExists = yield* dockerImageExists(image);
-    if (pullPolicy === "always" || (pullPolicy === "if-missing" && !initiallyExists)) {
+    if (pullPolicy === "always" || (pullPolicy !== "if-missing" && !initiallyExists)) {
       yield* runDockerPull(image).pipe(
         Effect.mapError(
killedBy: DockerRuntime (integration, real Docker) pullPolicy 'never' fails when the image is not present locally
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/runtime.ts:727:9
   const pullPolicy = artifact.pullPolicy ?? "if-missing";
   return Effect.gen(function* () {
     const initiallyExists = yield* dockerImageExists(image);
-    if (pullPolicy === "always" || (pullPolicy === "if-missing" && !initiallyExists)) {
+    if (true) {
       yield* runDockerPull(image).pipe(
         Effect.mapError(
killedBy: DockerRuntime (integration, real Docker) pullPolicy 'never' fails when the image is not present locally
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/runtime.ts:739:9
         ),
       );
     }
-    if (pullPolicy === "never" && !initiallyExists) {
+    if (true) {
       return yield* Effect.fail(
         new AgentStartError({
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Survived] EqualityOperator
src/runner/runtime.ts:739:9
         ),
       );
     }
-    if (pullPolicy === "never" && !initiallyExists) {
+    if (pullPolicy !== "never" && !initiallyExists) {
       return yield* Effect.fail(
         new AgentStartError({

[Killed] ConditionalExpression
src/runner/runtime.ts:752:9
     // doesn't guarantee the image is locally available (rare, but a
     // partial pull aborted by the daemon would land us here).
     const finalExists = yield* dockerImageExists(image);
-    if (!finalExists) {
+    if (true) {
       return yield* Effect.fail(
         new AgentStartError({
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/runner/runtime.ts:752:9
     // doesn't guarantee the image is locally available (rare, but a
     // partial pull aborted by the daemon would land us here).
     const finalExists = yield* dockerImageExists(image);
-    if (!finalExists) {
+    if (finalExists) {
       return yield* Effect.fail(
         new AgentStartError({
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/runner/runtime.ts:761:35
         }),
       );
     }
-    return { image, removeOnStop: false };
+    return { image, removeOnStop: true };
   });
 }

[Killed] StringLiteral
src/runner/runtime.ts:783:25
     Image: image,
     // tail -f keeps the container alive while we issue `docker exec`
     // calls for each prompt turn.
-    Cmd: ["tail", "-f", "/dev/null"],
+    Cmd: ["tail", "-f", ""],
     WorkingDir: "/workspace",
     HostConfig: {
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/runner/runtime.ts:783:10
     Image: image,
     // tail -f keeps the container alive while we issue `docker exec`
     // calls for each prompt turn.
-    Cmd: ["tail", "-f", "/dev/null"],
+    Cmd: [],
     WorkingDir: "/workspace",
     HostConfig: {
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/runner/runtime.ts:786:15
     Cmd: ["tail", "-f", "/dev/null"],
     WorkingDir: "/workspace",
     HostConfig: {
-      Binds: [`${workspaceDir}:/workspace`],
+      Binds: [``],
       NetworkMode: opts.network ?? "none",
       // No AutoRemove: stop() handles removal explicitly via dockerode's
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Survived] ArrayDeclaration
src/runner/runtime.ts:786:14
     Cmd: ["tail", "-f", "/dev/null"],
     WorkingDir: "/workspace",
     HostConfig: {
-      Binds: [`${workspaceDir}:/workspace`],
+      Binds: [],
       NetworkMode: opts.network ?? "none",
       // No AutoRemove: stop() handles removal explicitly via dockerode's

[Survived] LogicalOperator
src/runner/runtime.ts:787:20
     WorkingDir: "/workspace",
     HostConfig: {
       Binds: [`${workspaceDir}:/workspace`],
-      NetworkMode: opts.network ?? "none",
+      NetworkMode: opts.network && "none",
       // No AutoRemove: stop() handles removal explicitly via dockerode's
       // synchronous remove(). AutoRemove triggers daemon-side async cleanup

[NoCoverage] ArithmeticOperator
src/runner/runtime.ts:792:51
       // synchronous remove(). AutoRemove triggers daemon-side async cleanup
       // that races with our remove() call, leaving stop() callers unable
       // to assume the container is gone when stop() resolves.
-      ...(opts.memoryMb !== undefined ? { Memory: opts.memoryMb * 1024 * 1024 } : {}),
+      ...(opts.memoryMb !== undefined ? { Memory: opts.memoryMb / 1024 * 1024 } : {}),
       ...(opts.cpus !== undefined ? { NanoCpus: Math.round(opts.cpus * 1_000_000_000) } : {}),
     },

[NoCoverage] ArithmeticOperator
src/runner/runtime.ts:792:51
       // synchronous remove(). AutoRemove triggers daemon-side async cleanup
       // that races with our remove() call, leaving stop() callers unable
       // to assume the container is gone when stop() resolves.
-      ...(opts.memoryMb !== undefined ? { Memory: opts.memoryMb * 1024 * 1024 } : {}),
+      ...(opts.memoryMb !== undefined ? { Memory: opts.memoryMb * 1024 / 1024 } : {}),
       ...(opts.cpus !== undefined ? { NanoCpus: Math.round(opts.cpus * 1_000_000_000) } : {}),
     },

[NoCoverage] ArithmeticOperator
src/runner/runtime.ts:793:60
       // that races with our remove() call, leaving stop() callers unable
       // to assume the container is gone when stop() resolves.
       ...(opts.memoryMb !== undefined ? { Memory: opts.memoryMb * 1024 * 1024 } : {}),
-      ...(opts.cpus !== undefined ? { NanoCpus: Math.round(opts.cpus * 1_000_000_000) } : {}),
+      ...(opts.cpus !== undefined ? { NanoCpus: Math.round(opts.cpus / 1_000_000_000) } : {}),
     },
   };

[Killed] BooleanLiteral
src/runner/runtime.ts:820:24
 function dockerImageExists(image: string): Effect.Effect<boolean, never, never> {
   return Effect.tryPromise(() => docker.getImage(image).inspect()).pipe(
     Effect.match({
-      onSuccess: () => true,
+      onSuccess: () => false,
       onFailure: () => false,
     }),
killedBy: DockerRuntime (integration, real Docker) prepare → stop cycle creates and reaps a real container
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/runner/runtime.ts:821:24
   return Effect.tryPromise(() => docker.getImage(image).inspect()).pipe(
     Effect.match({
       onSuccess: () => true,
-      onFailure: () => false,
+      onFailure: () => true,
     }),
   );
killedBy: DockerRuntime (integration, real Docker) pullPolicy 'never' fails when the image is not present locally
statusReason: StrykerJS: Unknown test failure
