[Killed] ConditionalExpression
src/app/inspect.ts:54:7
   walPaths: WalPaths,
 ): { readonly file: string; readonly source: "inflight" | "completed" } | null {
   const inflightFile = path.join(walPaths.inflightDir, `${runId}.jsonl`);
-  if (fs.existsSync(inflightFile)) return { file: inflightFile, source: "inflight" };
+  if (false) return { file: inflightFile, source: "inflight" };
   const runsFile = path.join(walPaths.runsDir, `${runId}.jsonl`);
   if (fs.existsSync(runsFile)) return { file: runsFile, source: "completed" };
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:54:7
   walPaths: WalPaths,
 ): { readonly file: string; readonly source: "inflight" | "completed" } | null {
   const inflightFile = path.join(walPaths.inflightDir, `${runId}.jsonl`);
-  if (fs.existsSync(inflightFile)) return { file: inflightFile, source: "inflight" };
+  if (true) return { file: inflightFile, source: "inflight" };
   const runsFile = path.join(walPaths.runsDir, `${runId}.jsonl`);
   if (fs.existsSync(runsFile)) return { file: runsFile, source: "completed" };
killedBy: inspect file resolution labels source as 'completed' when file is in runs/
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:56:7
   const inflightFile = path.join(walPaths.inflightDir, `${runId}.jsonl`);
   if (fs.existsSync(inflightFile)) return { file: inflightFile, source: "inflight" };
   const runsFile = path.join(walPaths.runsDir, `${runId}.jsonl`);
-  if (fs.existsSync(runsFile)) return { file: runsFile, source: "completed" };
+  if (true) return { file: runsFile, source: "completed" };
   return null;
 }
killedBy: inspect file resolution fails with RunNotFound when run does not exist anywhere
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:56:7
   const inflightFile = path.join(walPaths.inflightDir, `${runId}.jsonl`);
   if (fs.existsSync(inflightFile)) return { file: inflightFile, source: "inflight" };
   const runsFile = path.join(walPaths.runsDir, `${runId}.jsonl`);
-  if (fs.existsSync(runsFile)) return { file: runsFile, source: "completed" };
+  if (false) return { file: runsFile, source: "completed" };
   return null;
 }
killedBy: inspect file resolution labels source as 'completed' when file is in runs/
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:79:7
     void err;
     return { lines: [] };
   }
-  if (rawContent.length === 0) return { lines: [] };
+  if (true) return { lines: [] };
 
   const lines: WalLine[] = [];
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/inspect.ts:79:7
     void err;
     return { lines: [] };
   }
-  if (rawContent.length === 0) return { lines: [] };
+  if (rawContent.length !== 0) return { lines: [] };
 
   const lines: WalLine[] = [];
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Survived] MethodExpression
src/app/inspect.ts:83:21
 
   const lines: WalLine[] = [];
   for (const rawLine of rawContent.split("\n")) {
-    const trimmed = rawLine.trim();
+    const trimmed = rawLine;
     if (trimmed.length === 0) continue;
 

[Killed] EqualityOperator
src/app/inspect.ts:84:9
   const lines: WalLine[] = [];
   for (const rawLine of rawContent.split("\n")) {
     const trimmed = rawLine.trim();
-    if (trimmed.length === 0) continue;
+    if (trimmed.length !== 0) continue;
 
     let parsed: unknown;
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:84:9
   const lines: WalLine[] = [];
   for (const rawLine of rawContent.split("\n")) {
     const trimmed = rawLine.trim();
-    if (trimmed.length === 0) continue;
+    if (true) continue;
 
     let parsed: unknown;
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Survived] BlockStatement
src/app/inspect.ts:89:19
     let parsed: unknown;
     try {
       parsed = JSON.parse(trimmed);
-    } catch (err) {
-      void err;
-      continue;
-    }
+    } catch (err) {}
 
     if (typeof parsed !== "object" || parsed === null) continue;

[Killed] ConditionalExpression
src/app/inspect.ts:94:9
       continue;
     }
 
-    if (typeof parsed !== "object" || parsed === null) continue;
+    if (true) continue;
 
     const v = (parsed as { v?: unknown })["v"];
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/inspect.ts:94:9
       continue;
     }
 
-    if (typeof parsed !== "object" || parsed === null) continue;
+    if (typeof parsed === "object" || parsed === null) continue;
 
     const v = (parsed as { v?: unknown })["v"];
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:98:9
 
     const v = (parsed as { v?: unknown })["v"];
 
-    if (typeof v !== "number") continue;
+    if (true) continue;
 
     if (v !== WAL_LINE_VERSION) {
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/inspect.ts:98:9
 
     const v = (parsed as { v?: unknown })["v"];
 
-    if (typeof v !== "number") continue;
+    if (typeof v === "number") continue;
 
     if (v !== WAL_LINE_VERSION) {
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/inspect.ts:100:33
 
     if (typeof v !== "number") continue;
 
-    if (v !== WAL_LINE_VERSION) {
-      process.stderr.write(
-        `cc-judge inspect: newer cc-judge wrote this (v=${String(v)}); line skipped\n`,
-      );
-      continue;
-    }
+    if (v !== WAL_LINE_VERSION) {}
 
     lines.push(parsed as WalLine);
killedBy: inspect unknown-v handling skips v≠1 lines while keeping known-v lines
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:100:9
 
     if (typeof v !== "number") continue;
 
-    if (v !== WAL_LINE_VERSION) {
+    if (false) {
       process.stderr.write(
         `cc-judge inspect: newer cc-judge wrote this (v=${String(v)}); line skipped\n`,
killedBy: inspect unknown-v handling skips v≠1 lines while keeping known-v lines
statusReason: StrykerJS: Unknown test failure

[Killed] ArrowFunction
src/app/inspect.ts:125:29
 
 function checkSeqs(lines: ReadonlyArray<WalLine>): SeqCheck {
   // Orphaned marker uses seq=-1 by WAL spec; excluded from seq counting.
-  const real = lines.filter((l) => l.kind !== WAL_LINE_KIND.Orphaned);
+  const real = lines.filter(() => undefined);
   if (real.length === 0) return { gaps: [], duplicates: [] };
 
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:125:36
 
 function checkSeqs(lines: ReadonlyArray<WalLine>): SeqCheck {
   // Orphaned marker uses seq=-1 by WAL spec; excluded from seq counting.
-  const real = lines.filter((l) => l.kind !== WAL_LINE_KIND.Orphaned);
+  const real = lines.filter((l) => false);
   if (real.length === 0) return { gaps: [], duplicates: [] };
 
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/inspect.ts:126:7
 function checkSeqs(lines: ReadonlyArray<WalLine>): SeqCheck {
   // Orphaned marker uses seq=-1 by WAL spec; excluded from seq counting.
   const real = lines.filter((l) => l.kind !== WAL_LINE_KIND.Orphaned);
-  if (real.length === 0) return { gaps: [], duplicates: [] };
+  if (real.length !== 0) return { gaps: [], duplicates: [] };
 
   const seen = new Map<number, number>();
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:126:7
 function checkSeqs(lines: ReadonlyArray<WalLine>): SeqCheck {
   // Orphaned marker uses seq=-1 by WAL spec; excluded from seq counting.
   const real = lines.filter((l) => l.kind !== WAL_LINE_KIND.Orphaned);
-  if (real.length === 0) return { gaps: [], duplicates: [] };
+  if (true) return { gaps: [], duplicates: [] };
 
   const seen = new Map<number, number>();
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/inspect.ts:129:25
   if (real.length === 0) return { gaps: [], duplicates: [] };
 
   const seen = new Map<number, number>();
-  for (const l of real) {
-    seen.set(l.seq, (seen.get(l.seq) ?? 0) + 1);
-  }
+  for (const l of real) {}
 
   const duplicates: number[] = [];
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] ArithmeticOperator
src/app/inspect.ts:130:21
 
   const seen = new Map<number, number>();
   for (const l of real) {
-    seen.set(l.seq, (seen.get(l.seq) ?? 0) + 1);
+    seen.set(l.seq, (seen.get(l.seq) ?? 0) - 1);
   }
 
killedBy: inspect duplicate-seq detection fails with DuplicateSeq when seq is repeated
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/inspect.ts:134:34
   }
 
   const duplicates: number[] = [];
-  for (const [s, count] of seen) {
-    if (count > 1) duplicates.push(s);
-  }
+  for (const [s, count] of seen) {}
   duplicates.sort((a, b) => a - b);
 
killedBy: inspect duplicate-seq detection fails with DuplicateSeq when seq is repeated
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:135:9
 
   const duplicates: number[] = [];
   for (const [s, count] of seen) {
-    if (count > 1) duplicates.push(s);
+    if (false) duplicates.push(s);
   }
   duplicates.sort((a, b) => a - b);
killedBy: inspect duplicate-seq detection fails with DuplicateSeq when seq is repeated
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/inspect.ts:135:9
 
   const duplicates: number[] = [];
   for (const [s, count] of seen) {
-    if (count > 1) duplicates.push(s);
+    if (count >= 1) duplicates.push(s);
   }
   duplicates.sort((a, b) => a - b);
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Survived] MethodExpression
src/app/inspect.ts:137:3
   for (const [s, count] of seen) {
     if (count > 1) duplicates.push(s);
   }
-  duplicates.sort((a, b) => a - b);
+  duplicates;
 
   const seqList = [...seen.keys()].sort((a, b) => a - b);

[Survived] ArithmeticOperator
src/app/inspect.ts:137:29
   for (const [s, count] of seen) {
     if (count > 1) duplicates.push(s);
   }
-  duplicates.sort((a, b) => a - b);
+  duplicates.sort((a, b) => a + b);
 
   const seqList = [...seen.keys()].sort((a, b) => a - b);

[Survived] MethodExpression
src/app/inspect.ts:139:19
   }
   duplicates.sort((a, b) => a - b);
 
-  const seqList = [...seen.keys()].sort((a, b) => a - b);
+  const seqList = [...seen.keys()];
   if (seqList.length <= 1) return { gaps: [], duplicates };
 

[Survived] ArithmeticOperator
src/app/inspect.ts:139:51
   }
   duplicates.sort((a, b) => a - b);
 
-  const seqList = [...seen.keys()].sort((a, b) => a - b);
+  const seqList = [...seen.keys()].sort((a, b) => a + b);
   if (seqList.length <= 1) return { gaps: [], duplicates };
 

[Killed] EqualityOperator
src/app/inspect.ts:140:7
   duplicates.sort((a, b) => a - b);
 
   const seqList = [...seen.keys()].sort((a, b) => a - b);
-  if (seqList.length <= 1) return { gaps: [], duplicates };
+  if (seqList.length > 1) return { gaps: [], duplicates };
 
   const first = seqList[0] as number;
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:140:7
   duplicates.sort((a, b) => a - b);
 
   const seqList = [...seen.keys()].sort((a, b) => a - b);
-  if (seqList.length <= 1) return { gaps: [], duplicates };
+  if (true) return { gaps: [], duplicates };
 
   const first = seqList[0] as number;
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/inspect.ts:145:27
   const first = seqList[0] as number;
   const last = seqList[seqList.length - 1] as number;
   const gaps: number[] = [];
-  for (let i = first + 1; i < last; i++) {
+  for (let i = first + 1; i >= last; i++) {
     if (!seen.has(i)) gaps.push(i);
   }
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:145:27
   const first = seqList[0] as number;
   const last = seqList[seqList.length - 1] as number;
   const gaps: number[] = [];
-  for (let i = first + 1; i < last; i++) {
+  for (let i = first + 1; false; i++) {
     if (!seen.has(i)) gaps.push(i);
   }
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/app/inspect.ts:146:9
   const last = seqList[seqList.length - 1] as number;
   const gaps: number[] = [];
   for (let i = first + 1; i < last; i++) {
-    if (!seen.has(i)) gaps.push(i);
+    if (seen.has(i)) gaps.push(i);
   }
 
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:146:9
   const last = seqList[seqList.length - 1] as number;
   const gaps: number[] = [];
   for (let i = first + 1; i < last; i++) {
-    if (!seen.has(i)) gaps.push(i);
+    if (true) gaps.push(i);
   }
 
killedBy: inspect seq-gap detection reports a single missing seq when seq jumps from 1 to 3
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:167:5
     reason?: unknown;
   };
   const obj: Obj =
-    typeof payload === "object" && payload !== null ? (payload as Obj) : {};
+    false ? (payload as Obj) : {};
 
   switch (kind) {
killedBy: formatInspectReport: exact strings (mutation pins) event line padding: kind column is 14 chars wide
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'phase           name=kickoff'

[Killed] ConditionalExpression
src/app/inspect.ts:167:36
     reason?: unknown;
   };
   const obj: Obj =
-    typeof payload === "object" && payload !== null ? (payload as Obj) : {};
+    typeof payload === "object" && true ? (payload as Obj) : {};
 
   switch (kind) {
killedBy: formatInspectReport PBT — header stdout always begins with 'cc-judge inspect: run <runId> [<source>]\n\n'
statusReason: Property failed after 2 tests
{ seed: 1774185275, path: "1:0:0:0:0:0:1:0:0:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"runId":"0","source":"inflight","events":[{"v":1,"runId":"fmt-run","seq":0,"ts":1704067200000,"kind":"phase","payload":null}],"outcome":null,"gaps":[]}]
Shrunk 13 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/app/inspect.ts:170:5
     typeof payload === "object" && payload !== null ? (payload as Obj) : {};
 
   switch (kind) {
-    case WAL_LINE_KIND.Phase:
-      return typeof obj.name === "string" ? `name=${obj.name}` : "";
+    case WAL_LINE_KIND.Phase:
     case WAL_LINE_KIND.Turn:
       return typeof obj.index === "number" ? `index=${String(obj.index)}` : "";
killedBy: formatInspectReport: exact strings (mutation pins) event line padding: kind column is 14 chars wide
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'phase           name=kickoff'

[Killed] ConditionalExpression
src/app/inspect.ts:171:14
 
   switch (kind) {
     case WAL_LINE_KIND.Phase:
-      return typeof obj.name === "string" ? `name=${obj.name}` : "";
+      return false ? `name=${obj.name}` : "";
     case WAL_LINE_KIND.Turn:
       return typeof obj.index === "number" ? `index=${String(obj.index)}` : "";
killedBy: formatInspectReport: exact strings (mutation pins) event line padding: kind column is 14 chars wide
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'phase           name=kickoff'

[Killed] ConditionalExpression
src/app/inspect.ts:171:14
 
   switch (kind) {
     case WAL_LINE_KIND.Phase:
-      return typeof obj.name === "string" ? `name=${obj.name}` : "";
+      return true ? `name=${obj.name}` : "";
     case WAL_LINE_KIND.Turn:
       return typeof obj.index === "number" ? `index=${String(obj.index)}` : "";
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) phase: empty summary when name is non-string
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' not to contain 'name='

[Killed] ConditionalExpression
src/app/inspect.ts:172:5
   switch (kind) {
     case WAL_LINE_KIND.Phase:
       return typeof obj.name === "string" ? `name=${obj.name}` : "";
-    case WAL_LINE_KIND.Turn:
-      return typeof obj.index === "number" ? `index=${String(obj.index)}` : "";
+    case WAL_LINE_KIND.Turn:
     case WAL_LINE_KIND.Event:
       return typeof obj.type === "string" ? `type=${obj.type}` : "";
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) turn: 'index=<n>' when payload.index is a number
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'index=7'

[Killed] EqualityOperator
src/app/inspect.ts:173:14
     case WAL_LINE_KIND.Phase:
       return typeof obj.name === "string" ? `name=${obj.name}` : "";
     case WAL_LINE_KIND.Turn:
-      return typeof obj.index === "number" ? `index=${String(obj.index)}` : "";
+      return typeof obj.index !== "number" ? `index=${String(obj.index)}` : "";
     case WAL_LINE_KIND.Event:
       return typeof obj.type === "string" ? `type=${obj.type}` : "";
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) turn: 'index=<n>' when payload.index is a number
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'index=7'

[Killed] ConditionalExpression
src/app/inspect.ts:173:14
     case WAL_LINE_KIND.Phase:
       return typeof obj.name === "string" ? `name=${obj.name}` : "";
     case WAL_LINE_KIND.Turn:
-      return typeof obj.index === "number" ? `index=${String(obj.index)}` : "";
+      return false ? `index=${String(obj.index)}` : "";
     case WAL_LINE_KIND.Event:
       return typeof obj.type === "string" ? `type=${obj.type}` : "";
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) turn: 'index=<n>' when payload.index is a number
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'index=7'

[Killed] ConditionalExpression
src/app/inspect.ts:174:5
       return typeof obj.name === "string" ? `name=${obj.name}` : "";
     case WAL_LINE_KIND.Turn:
       return typeof obj.index === "number" ? `index=${String(obj.index)}` : "";
-    case WAL_LINE_KIND.Event:
-      return typeof obj.type === "string" ? `type=${obj.type}` : "";
+    case WAL_LINE_KIND.Event:
     case WAL_LINE_KIND.Context:
       return "";
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) event: 'type=<type>' when payload.type is a string
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'type=tool_use'

[Killed] ConditionalExpression
src/app/inspect.ts:175:14
     case WAL_LINE_KIND.Turn:
       return typeof obj.index === "number" ? `index=${String(obj.index)}` : "";
     case WAL_LINE_KIND.Event:
-      return typeof obj.type === "string" ? `type=${obj.type}` : "";
+      return false ? `type=${obj.type}` : "";
     case WAL_LINE_KIND.Context:
       return "";
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) event: 'type=<type>' when payload.type is a string
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'type=tool_use'

[Killed] ConditionalExpression
src/app/inspect.ts:175:14
     case WAL_LINE_KIND.Turn:
       return typeof obj.index === "number" ? `index=${String(obj.index)}` : "";
     case WAL_LINE_KIND.Event:
-      return typeof obj.type === "string" ? `type=${obj.type}` : "";
+      return true ? `type=${obj.type}` : "";
     case WAL_LINE_KIND.Context:
       return "";
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) event: empty summary when type is non-string
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' not to contain 'type='

[Survived] ConditionalExpression
src/app/inspect.ts:176:5
       return typeof obj.index === "number" ? `index=${String(obj.index)}` : "";
     case WAL_LINE_KIND.Event:
       return typeof obj.type === "string" ? `type=${obj.type}` : "";
-    case WAL_LINE_KIND.Context:
-      return "";
+    case WAL_LINE_KIND.Context:
     case WAL_LINE_KIND.WorkspaceDiff:
       return "";

[Survived] ConditionalExpression
src/app/inspect.ts:178:5
       return typeof obj.type === "string" ? `type=${obj.type}` : "";
     case WAL_LINE_KIND.Context:
       return "";
-    case WAL_LINE_KIND.WorkspaceDiff:
-      return "";
+    case WAL_LINE_KIND.WorkspaceDiff:
     case WAL_LINE_KIND.Outcome: {
       if (typeof obj.status !== "string") return "";

[Killed] ConditionalExpression
src/app/inspect.ts:180:5
       return "";
     case WAL_LINE_KIND.WorkspaceDiff:
       return "";
-    case WAL_LINE_KIND.Outcome: {
-      if (typeof obj.status !== "string") return "";
-      const reason =
-        typeof obj.reason === "string" ? ` reason=${obj.reason}` : "";
-      return `status=${obj.status}${reason}`;
-    }
+    case WAL_LINE_KIND.Outcome:
     case WAL_LINE_KIND.Orphaned:
       return "(orphaned)";
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) outcome inline: 'status=<s>' alone when reason is missing
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'status=completed'

[Killed] EqualityOperator
src/app/inspect.ts:181:11
     case WAL_LINE_KIND.WorkspaceDiff:
       return "";
     case WAL_LINE_KIND.Outcome: {
-      if (typeof obj.status !== "string") return "";
+      if (typeof obj.status === "string") return "";
       const reason =
         typeof obj.reason === "string" ? ` reason=${obj.reason}` : "";
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) outcome inline: 'status=<s>' alone when reason is missing
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'status=completed'

[Killed] ConditionalExpression
src/app/inspect.ts:181:11
     case WAL_LINE_KIND.WorkspaceDiff:
       return "";
     case WAL_LINE_KIND.Outcome: {
-      if (typeof obj.status !== "string") return "";
+      if (true) return "";
       const reason =
         typeof obj.reason === "string" ? ` reason=${obj.reason}` : "";
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) outcome inline: 'status=<s>' alone when reason is missing
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'status=completed'

[Killed] ConditionalExpression
src/app/inspect.ts:183:9
     case WAL_LINE_KIND.Outcome: {
       if (typeof obj.status !== "string") return "";
       const reason =
-        typeof obj.reason === "string" ? ` reason=${obj.reason}` : "";
+        false ? ` reason=${obj.reason}` : "";
       return `status=${obj.status}${reason}`;
     }
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) outcome inline: 'status=<s> reason=<r>' when both present
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'status=failed reason=boom'

[Killed] EqualityOperator
src/app/inspect.ts:183:9
     case WAL_LINE_KIND.Outcome: {
       if (typeof obj.status !== "string") return "";
       const reason =
-        typeof obj.reason === "string" ? ` reason=${obj.reason}` : "";
+        typeof obj.reason !== "string" ? ` reason=${obj.reason}` : "";
       return `status=${obj.status}${reason}`;
     }
killedBy: formatInspectReport: summaryForPayload per kind (exact pins) outcome inline: 'status=<s> reason=<r>' when both present
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'status=failed reason=boom'

[NoCoverage] StringLiteral
src/app/inspect.ts:193:14
       // WalLineKind is added without a matching case (PRINCIPLES.md §4).
       const exhaustiveCheck: never = kind;
       void exhaustiveCheck;
-      return "";
+      return "Stryker was here!";
     }
   }

[Killed] EqualityOperator
src/app/inspect.ts:229:5
 function readOutcomePayload(line: WalLine): InspectOutcomeView {
   type OutcomePayload = { status?: unknown; reason?: unknown };
   const p: OutcomePayload =
-    typeof line.payload === "object" && line.payload !== null
+    typeof line.payload !== "object" && line.payload !== null
       ? (line.payload as OutcomePayload)
       : {};
killedBy: inspect outcome extraction surfaces the outcome status from a completed run
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:229:5
 function readOutcomePayload(line: WalLine): InspectOutcomeView {
   type OutcomePayload = { status?: unknown; reason?: unknown };
   const p: OutcomePayload =
-    typeof line.payload === "object" && line.payload !== null
+    false
       ? (line.payload as OutcomePayload)
       : {};
killedBy: inspect outcome extraction surfaces the outcome status from a completed run
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/app/inspect.ts:244:18
   lines: ReadonlyArray<WalLine>,
   gaps: ReadonlyArray<number>,
 ): InspectReport {
-  const events = lines
-    .filter((l) => l.kind !== WAL_LINE_KIND.Outcome && l.kind !== WAL_LINE_KIND.Orphaned)
+  const events = lines
     .slice()
     .sort((a, b) => a.seq - b.seq);
killedBy: inspect outcome extraction surfaces the outcome status from a completed run
statusReason: StrykerJS: Unknown test failure

[Survived] MethodExpression
src/app/inspect.ts:244:18
   lines: ReadonlyArray<WalLine>,
   gaps: ReadonlyArray<number>,
 ): InspectReport {
-  const events = lines
-    .filter((l) => l.kind !== WAL_LINE_KIND.Outcome && l.kind !== WAL_LINE_KIND.Orphaned)
-    .slice()
+  const events = lines.filter(l => l.kind !== WAL_LINE_KIND.Outcome && l.kind !== WAL_LINE_KIND.Orphaned)
     .sort((a, b) => a.seq - b.seq);
 

[Killed] ConditionalExpression
src/app/inspect.ts:245:20
   gaps: ReadonlyArray<number>,
 ): InspectReport {
   const events = lines
-    .filter((l) => l.kind !== WAL_LINE_KIND.Outcome && l.kind !== WAL_LINE_KIND.Orphaned)
+    .filter((l) => false)
     .slice()
     .sort((a, b) => a.seq - b.seq);
killedBy: inspect malformed-JSON line handling skips malformed lines and keeps valid ones in the report
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:245:20
   gaps: ReadonlyArray<number>,
 ): InspectReport {
   const events = lines
-    .filter((l) => l.kind !== WAL_LINE_KIND.Outcome && l.kind !== WAL_LINE_KIND.Orphaned)
+    .filter((l) => true)
     .slice()
     .sort((a, b) => a.seq - b.seq);
killedBy: inspect outcome extraction surfaces the outcome status from a completed run
statusReason: StrykerJS: Unknown test failure

[Survived] ArithmeticOperator
src/app/inspect.ts:247:21
   const events = lines
     .filter((l) => l.kind !== WAL_LINE_KIND.Outcome && l.kind !== WAL_LINE_KIND.Orphaned)
     .slice()
-    .sort((a, b) => a.seq - b.seq);
+    .sort((a, b) => a.seq + b.seq);
 
   const outcomeLines = lines.filter((l) => l.kind === WAL_LINE_KIND.Outcome);

[Killed] ArrowFunction
src/app/inspect.ts:249:37
     .slice()
     .sort((a, b) => a.seq - b.seq);
 
-  const outcomeLines = lines.filter((l) => l.kind === WAL_LINE_KIND.Outcome);
+  const outcomeLines = lines.filter(() => undefined);
   const lastOutcome = outcomeLines[outcomeLines.length - 1];
 
killedBy: inspect outcome extraction surfaces the outcome status from a completed run
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/inspect.ts:249:44
     .slice()
     .sort((a, b) => a.seq - b.seq);
 
-  const outcomeLines = lines.filter((l) => l.kind === WAL_LINE_KIND.Outcome);
+  const outcomeLines = lines.filter((l) => false);
   const lastOutcome = outcomeLines[outcomeLines.length - 1];
 
killedBy: inspect outcome extraction surfaces the outcome status from a completed run
statusReason: StrykerJS: Unknown test failure

[Killed] ArithmeticOperator
src/app/inspect.ts:250:36
     .sort((a, b) => a.seq - b.seq);
 
   const outcomeLines = lines.filter((l) => l.kind === WAL_LINE_KIND.Outcome);
-  const lastOutcome = outcomeLines[outcomeLines.length - 1];
+  const lastOutcome = outcomeLines[outcomeLines.length + 1];
 
   return {
killedBy: inspect outcome extraction surfaces the outcome status from a completed run
statusReason: StrykerJS: Unknown test failure
