[Killed] ArrayDeclaration
src/app/inspect.ts:271:33
 }
 
 export function formatInspectReport(report: InspectReport): InspectRenderOutput {
-  const stderrParts: string[] = [];
+  const stderrParts: string[] = ["Stryker was here"];
   for (const missing of report.gaps) {
     stderrParts.push(
killedBy: formatInspectReport PBT — gap warnings stderr line count equals report.gaps.length
statusReason: Property failed after 39 tests
{ seed: 1992188665, path: "38:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"-","source":"inflight","events":[],"outcome":null,"gaps":[]}]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/app/inspect.ts:272:38
 
 export function formatInspectReport(report: InspectReport): InspectRenderOutput {
   const stderrParts: string[] = [];
-  for (const missing of report.gaps) {
-    stderrParts.push(
-      `cc-judge inspect: warning: missing seq ${String(missing)}\n`,
-    );
-  }
+  for (const missing of report.gaps) {}
 
   const stdoutParts: string[] = [];
killedBy: formatInspectReport PBT — gap warnings stderr line count equals report.gaps.length
statusReason: Property failed after 2 tests
{ seed: -1840494316, path: "1:0:0:0:0:0:0:0:1:0:0:1", endOnFailure: true }
Counterexample: [{"runId":"-","source":"inflight","events":[],"outcome":null,"gaps":[0]}]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/app/inspect.ts:281:62
   const stdoutParts: string[] = [];
   stdoutParts.push(`cc-judge inspect: run ${report.runId} [${report.source}]\n\n`);
 
-  if (report.events.length === 0 && report.outcome === null) {
-    stdoutParts.push("  no events, no outcome\n");
-    return { stdout: stdoutParts.join(""), stderr: stderrParts.join("") };
-  }
+  if (report.events.length === 0 && report.outcome === null) {}
 
   const lastEvent = report.events[report.events.length - 1];
killedBy: formatInspectReport PBT — empty timeline no events AND no outcome ⇒ stdout = header + '  no events, no outcome\n'
statusReason: Property failed after 1 tests
{ seed: 393379404, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"-","source":"inflight","events":[],"outcome":null,"gaps":[]}]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/app/inspect.ts:281:7
   const stdoutParts: string[] = [];
   stdoutParts.push(`cc-judge inspect: run ${report.runId} [${report.source}]\n\n`);
 
-  if (report.events.length === 0 && report.outcome === null) {
+  if (report.events.length !== 0 && report.outcome === null) {
     stdoutParts.push("  no events, no outcome\n");
     return { stdout: stdoutParts.join(""), stderr: stderrParts.join("") };
killedBy: formatInspectReport PBT — empty timeline no events AND no outcome ⇒ stdout = header + '  no events, no outcome\n'
statusReason: Property failed after 1 tests
{ seed: 1441999628, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"0","source":"inflight","events":[],"outcome":null,"gaps":[]}]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/app/inspect.ts:283:39
 
   if (report.events.length === 0 && report.outcome === null) {
     stdoutParts.push("  no events, no outcome\n");
-    return { stdout: stdoutParts.join(""), stderr: stderrParts.join("") };
+    return { stdout: stdoutParts.join("Stryker was here!"), stderr: stderrParts.join("") };
   }
 
killedBy: formatInspectReport PBT — empty timeline no events AND no outcome ⇒ stdout = header + '  no events, no outcome\n'
statusReason: Property failed after 1 tests
{ seed: 38353227, path: "0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"-","source":"inflight","events":[],"outcome":null,"gaps":[]}]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] StringLiteral
src/app/inspect.ts:283:69
 
   if (report.events.length === 0 && report.outcome === null) {
     stdoutParts.push("  no events, no outcome\n");
-    return { stdout: stdoutParts.join(""), stderr: stderrParts.join("") };
+    return { stdout: stdoutParts.join(""), stderr: stderrParts.join("Stryker was here!") };
   }
 

[Killed] ArithmeticOperator
src/app/inspect.ts:286:35
     return { stdout: stdoutParts.join(""), stderr: stderrParts.join("") };
   }
 
-  const lastEvent = report.events[report.events.length - 1];
+  const lastEvent = report.events[report.events.length + 1];
   const maxSeq = lastEvent !== undefined ? lastEvent.seq : 0;
   const seqWidth = Math.max(String(maxSeq).length, 1);
killedBy: formatInspectReport: exact strings (mutation pins) seq is right-padded to the largest seq's width
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain '   0  2024-01-01T00:00:00.000Z'

[Killed] MethodExpression
src/app/inspect.ts:288:20
 
   const lastEvent = report.events[report.events.length - 1];
   const maxSeq = lastEvent !== undefined ? lastEvent.seq : 0;
-  const seqWidth = Math.max(String(maxSeq).length, 1);
+  const seqWidth = Math.min(String(maxSeq).length, 1);
 
   for (const l of report.events) {
killedBy: formatInspectReport: exact strings (mutation pins) seq is right-padded to the largest seq's width
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain '   0  2024-01-01T00:00:00.000Z'

[Killed] BlockStatement
src/app/inspect.ts:290:34
   const maxSeq = lastEvent !== undefined ? lastEvent.seq : 0;
   const seqWidth = Math.max(String(maxSeq).length, 1);
 
-  for (const l of report.events) {
-    const seqStr = String(l.seq).padStart(seqWidth, " ");
-    const ts = new Date(l.ts).toISOString();
-    const kind = l.kind.padEnd(14, " ");
-    const summary = summaryForPayload(l.kind, l.payload);
-    const tail = summary.length > 0 ? `  ${summary}` : "";
-    stdoutParts.push(`  ${seqStr}  ${ts}  ${kind}${tail}\n`);
-  }
+  for (const l of report.events) {}
 
   if (report.outcome !== null) {
killedBy: formatInspectReport PBT — event lines event line count equals report.events.length
statusReason: Property failed after 1 tests
{ seed: 1868172965, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"0","source":"inflight","events":[{"v":1,"runId":"fmt-run","seq":0,"ts":1704067200000,"kind":"phase","payload":null}],"outcome":null,"gaps":[]}]
Shrunk 14 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/app/inspect.ts:293:36
   for (const l of report.events) {
     const seqStr = String(l.seq).padStart(seqWidth, " ");
     const ts = new Date(l.ts).toISOString();
-    const kind = l.kind.padEnd(14, " ");
+    const kind = l.kind.padEnd(14, "");
     const summary = summaryForPayload(l.kind, l.payload);
     const tail = summary.length > 0 ? `  ${summary}` : "";
killedBy: formatInspectReport: exact strings (mutation pins) event line padding: kind column is 14 chars wide
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'phase           name=kickoff'

[Killed] ConditionalExpression
src/app/inspect.ts:295:18
     const ts = new Date(l.ts).toISOString();
     const kind = l.kind.padEnd(14, " ");
     const summary = summaryForPayload(l.kind, l.payload);
-    const tail = summary.length > 0 ? `  ${summary}` : "";
+    const tail = false ? `  ${summary}` : "";
     stdoutParts.push(`  ${seqStr}  ${ts}  ${kind}${tail}\n`);
   }
killedBy: formatInspectReport: exact strings (mutation pins) event line padding: kind column is 14 chars wide
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'phase           name=kickoff'

[Killed] EqualityOperator
src/app/inspect.ts:295:18
     const ts = new Date(l.ts).toISOString();
     const kind = l.kind.padEnd(14, " ");
     const summary = summaryForPayload(l.kind, l.payload);
-    const tail = summary.length > 0 ? `  ${summary}` : "";
+    const tail = summary.length <= 0 ? `  ${summary}` : "";
     stdoutParts.push(`  ${seqStr}  ${ts}  ${kind}${tail}\n`);
   }
killedBy: formatInspectReport: exact strings (mutation pins) event line padding: kind column is 14 chars wide
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain 'phase           name=kickoff'

[Killed] BlockStatement
src/app/inspect.ts:299:32
     stdoutParts.push(`  ${seqStr}  ${ts}  ${kind}${tail}\n`);
   }
 
-  if (report.outcome !== null) {
-    const status = report.outcome.status ?? "unknown";
-    const reason = report.outcome.reason !== null ? ` (${report.outcome.reason})` : "";
-    stdoutParts.push(`\n  outcome: ${status}${reason}\n`);
-  } else {
+  if (report.outcome !== null) {} else {
     const msg =
       report.source === "inflight" ? "run still in flight" : "no outcome line found";
killedBy: formatInspectReport PBT — outcome rendering outcome present ⇒ stdout contains exactly one 'outcome:' token
statusReason: Property failed after 1 tests
{ seed: 1554125098, path: "0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"-","source":"inflight","events":[],"outcome":{"status":null,"reason":null},"gaps":[]}]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/app/inspect.ts:300:20
   }
 
   if (report.outcome !== null) {
-    const status = report.outcome.status ?? "unknown";
+    const status = report.outcome.status && "unknown";
     const reason = report.outcome.reason !== null ? ` (${report.outcome.reason})` : "";
     stdoutParts.push(`\n  outcome: ${status}${reason}\n`);
killedBy: formatInspectReport PBT — outcome rendering outcome.status non-null ⇒ status appears verbatim after 'outcome: '
statusReason: Property failed after 1 tests
{ seed: 1828452143, path: "0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"0","source":"inflight","events":[],"outcome":{"status":" ","reason":null},"gaps":[]}]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/app/inspect.ts:300:45
   }
 
   if (report.outcome !== null) {
-    const status = report.outcome.status ?? "unknown";
+    const status = report.outcome.status ?? "";
     const reason = report.outcome.reason !== null ? ` (${report.outcome.reason})` : "";
     stdoutParts.push(`\n  outcome: ${status}${reason}\n`);
killedBy: formatInspectReport PBT — outcome rendering outcome.status null ⇒ falls back to 'outcome: unknown'
statusReason: Property failed after 1 tests
{ seed: -126609075, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"0","source":"inflight","events":[],"outcome":{"status":null,"reason":null},"gaps":[]}]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/app/inspect.ts:301:20
 
   if (report.outcome !== null) {
     const status = report.outcome.status ?? "unknown";
-    const reason = report.outcome.reason !== null ? ` (${report.outcome.reason})` : "";
+    const reason = true ? ` (${report.outcome.reason})` : "";
     stdoutParts.push(`\n  outcome: ${status}${reason}\n`);
   } else {
killedBy: formatInspectReport PBT — outcome rendering outcome.reason null ⇒ no parens in the outcome line
statusReason: Property failed after 1 tests
{ seed: 744149374, path: "0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"-","source":"inflight","events":[],"outcome":{"status":null,"reason":null},"gaps":[]}]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/app/inspect.ts:301:20
 
   if (report.outcome !== null) {
     const status = report.outcome.status ?? "unknown";
-    const reason = report.outcome.reason !== null ? ` (${report.outcome.reason})` : "";
+    const reason = report.outcome.reason === null ? ` (${report.outcome.reason})` : "";
     stdoutParts.push(`\n  outcome: ${status}${reason}\n`);
   } else {
killedBy: formatInspectReport PBT — outcome rendering outcome.reason non-null ⇒ reason wrapped in '(<reason>)'
statusReason: Property failed after 1 tests
{ seed: 1166554452, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"0","source":"inflight","events":[],"outcome":{"status":null,"reason":" "},"gaps":[]}]
Shrunk 13 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/app/inspect.ts:302:22
   if (report.outcome !== null) {
     const status = report.outcome.status ?? "unknown";
     const reason = report.outcome.reason !== null ? ` (${report.outcome.reason})` : "";
-    stdoutParts.push(`\n  outcome: ${status}${reason}\n`);
+    stdoutParts.push(``);
   } else {
     const msg =
killedBy: formatInspectReport PBT — outcome rendering outcome present ⇒ stdout contains exactly one 'outcome:' token
statusReason: Property failed after 1 tests
{ seed: 180905917, path: "0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"0","source":"inflight","events":[],"outcome":{"status":null,"reason":null},"gaps":[]}]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/app/inspect.ts:303:10
     const status = report.outcome.status ?? "unknown";
     const reason = report.outcome.reason !== null ? ` (${report.outcome.reason})` : "";
     stdoutParts.push(`\n  outcome: ${status}${reason}\n`);
-  } else {
-    const msg =
-      report.source === "inflight" ? "run still in flight" : "no outcome line found";
-    stdoutParts.push(`\n  outcome: (none — ${msg})\n`);
-  }
+  } else {}
 
   return { stdout: stdoutParts.join(""), stderr: stderrParts.join("") };
killedBy: formatInspectReport PBT — outcome rendering outcome null + at least one event ⇒ '(none — ...)' trailer
statusReason: Property failed after 1 tests
{ seed: 202428162, path: "0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"-","source":"inflight","events":[{"v":1,"runId":"fmt-run","seq":0,"ts":1704067200000,"kind":"phase","payload":null}],"outcome":null,"gaps":[]}]
Shrunk 12 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/app/inspect.ts:305:7
     stdoutParts.push(`\n  outcome: ${status}${reason}\n`);
   } else {
     const msg =
-      report.source === "inflight" ? "run still in flight" : "no outcome line found";
+      true ? "run still in flight" : "no outcome line found";
     stdoutParts.push(`\n  outcome: (none — ${msg})\n`);
   }
killedBy: formatInspectReport: exact strings (mutation pins) completed + no outcome but events present ⇒ '(none — no outcome line found)'
statusReason: expected 'cc-judge inspect: run fmt-run [comple…' to contain '\n  outcome: (none — no outcome line …'

[Killed] EqualityOperator
src/app/inspect.ts:305:7
     stdoutParts.push(`\n  outcome: ${status}${reason}\n`);
   } else {
     const msg =
-      report.source === "inflight" ? "run still in flight" : "no outcome line found";
+      report.source !== "inflight" ? "run still in flight" : "no outcome line found";
     stdoutParts.push(`\n  outcome: (none — ${msg})\n`);
   }
killedBy: formatInspectReport: exact strings (mutation pins) inflight + no outcome but events present ⇒ '(none — run still in flight)'
statusReason: expected 'cc-judge inspect: run fmt-run [inflig…' to contain '\n  outcome: (none — run still in fli…'

[Killed] StringLiteral
src/app/inspect.ts:306:22
   } else {
     const msg =
       report.source === "inflight" ? "run still in flight" : "no outcome line found";
-    stdoutParts.push(`\n  outcome: (none — ${msg})\n`);
+    stdoutParts.push(``);
   }
 
killedBy: formatInspectReport PBT — outcome rendering outcome null + at least one event ⇒ '(none — ...)' trailer
statusReason: Property failed after 1 tests
{ seed: 1667711729, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"runId":"-","source":"inflight","events":[{"v":1,"runId":"fmt-run","seq":0,"ts":1704067200000,"kind":"phase","payload":null}],"outcome":null,"gaps":[]}]
Shrunk 15 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the r

[Killed] BlockStatement
src/app/inspect.ts:334:33
     const { gaps, duplicates } = checkSeqs(lines);
 
     const firstDup = duplicates[0];
-    if (firstDup !== undefined) {
-      return Effect.fail(
-        new InspectError({ cause: InspectErrorCause.DuplicateSeq({ seq: firstDup, runId }) }),
-      );
-    }
+    if (firstDup !== undefined) {}
 
     return Effect.succeed(buildReport(runId, source, lines, gaps));
killedBy: inspect duplicate-seq detection fails with DuplicateSeq when seq is repeated
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/app/inspect.ts:349:23
   resultsDir: string,
 ): Effect.Effect<void, InspectError, never> {
   return Effect.flatMap(inspectRun(runId, resultsDir), (report) =>
-    Effect.sync(() => {
-      const { stdout, stderr } = formatInspectReport(report);
-      if (stderr.length > 0) process.stderr.write(stderr);
-      if (stdout.length > 0) process.stdout.write(stdout);
-    }),
+    Effect.sync(() => {}),
   );
 }

[NoCoverage] ConditionalExpression
src/app/inspect.ts:351:11
   return Effect.flatMap(inspectRun(runId, resultsDir), (report) =>
     Effect.sync(() => {
       const { stdout, stderr } = formatInspectReport(report);
-      if (stderr.length > 0) process.stderr.write(stderr);
+      if (true) process.stderr.write(stderr);
       if (stdout.length > 0) process.stdout.write(stdout);
     }),

[NoCoverage] EqualityOperator
src/app/inspect.ts:351:11
   return Effect.flatMap(inspectRun(runId, resultsDir), (report) =>
     Effect.sync(() => {
       const { stdout, stderr } = formatInspectReport(report);
-      if (stderr.length > 0) process.stderr.write(stderr);
+      if (stderr.length <= 0) process.stderr.write(stderr);
       if (stdout.length > 0) process.stdout.write(stdout);
     }),

[NoCoverage] EqualityOperator
src/app/inspect.ts:352:11
     Effect.sync(() => {
       const { stdout, stderr } = formatInspectReport(report);
       if (stderr.length > 0) process.stderr.write(stderr);
-      if (stdout.length > 0) process.stdout.write(stdout);
+      if (stdout.length <= 0) process.stdout.write(stdout);
     }),
   );

[NoCoverage] ConditionalExpression
src/app/inspect.ts:352:11
     Effect.sync(() => {
       const { stdout, stderr } = formatInspectReport(report);
       if (stderr.length > 0) process.stderr.write(stderr);
-      if (stdout.length > 0) process.stdout.write(stdout);
+      if (true) process.stdout.write(stdout);
     }),
   );
