[Killed] EqualityOperator
src/app/judge-preflight.ts:23:7
 // the first cc-judge invocation per process.
 
 function shouldPreflightClaudeAuth(judgeBackend: string): boolean {
-  if (judgeBackend !== "anthropic") {
+  if (judgeBackend === "anthropic") {
     return false;
   }
killedBy: main anthropic auth preflight fails early with exit 2 when claude auth preflight fails
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/judge-preflight.ts:23:37
 // the first cc-judge invocation per process.
 
 function shouldPreflightClaudeAuth(judgeBackend: string): boolean {
-  if (judgeBackend !== "anthropic") {
-    return false;
-  }
+  if (judgeBackend !== "anthropic") {}
   // CLI auth boundary: env presence decides whether the external auth probe is needed.
   // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
killedBy: judge preflight cache skips anthropic auth preflight for non-anthropic backends
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] BooleanLiteral
src/app/judge-preflight.ts:24:12
 
 function shouldPreflightClaudeAuth(judgeBackend: string): boolean {
   if (judgeBackend !== "anthropic") {
-    return false;
+    return true;
   }
   // CLI auth boundary: env presence decides whether the external auth probe is needed.
killedBy: judge preflight cache skips anthropic auth preflight for non-anthropic backends
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] ConditionalExpression
src/app/judge-preflight.ts:28:10
   }
   // CLI auth boundary: env presence decides whether the external auth probe is needed.
   // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
-  return (process.env["ANTHROPIC_API_KEY"] ?? "").trim().length === 0;
+  return true;
 }
 
killedBy: judge preflight cache skips preflight entirely when ANTHROPIC_API_KEY is set
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] ConditionalExpression
src/app/judge-preflight.ts:28:10
   }
   // CLI auth boundary: env presence decides whether the external auth probe is needed.
   // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
-  return (process.env["ANTHROPIC_API_KEY"] ?? "").trim().length === 0;
+  return false;
 }
 
killedBy: judge preflight cache reuses the disk cache for back-to-back anthropic preflight calls
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] MethodExpression
src/app/judge-preflight.ts:34:24
 function resolveCacheHome(): string {
   // CLI cache boundary: XDG/OS env is converted to a concrete cache path here.
   // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
-  const xdgCacheHome = (process.env["XDG_CACHE_HOME"] ?? "").trim();
+  const xdgCacheHome = process.env["XDG_CACHE_HOME"] ?? "";
   if (xdgCacheHome.length > 0) {
     return xdgCacheHome;

[Survived] StringLiteral
src/app/judge-preflight.ts:34:58
 function resolveCacheHome(): string {
   // CLI cache boundary: XDG/OS env is converted to a concrete cache path here.
   // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
-  const xdgCacheHome = (process.env["XDG_CACHE_HOME"] ?? "").trim();
+  const xdgCacheHome = (process.env["XDG_CACHE_HOME"] ?? "Stryker was here!").trim();
   if (xdgCacheHome.length > 0) {
     return xdgCacheHome;

[Killed] ConditionalExpression
src/app/judge-preflight.ts:35:7
   // CLI cache boundary: XDG/OS env is converted to a concrete cache path here.
   // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
   const xdgCacheHome = (process.env["XDG_CACHE_HOME"] ?? "").trim();
-  if (xdgCacheHome.length > 0) {
+  if (false) {
     return xdgCacheHome;
   }
killedBy: judge preflight cache re-runs preflight and rewrites cache when on-disk JSON is malformed
statusReason: Unexpected token 'o', "not json {{{" is not valid JSON

[Killed] EqualityOperator
src/app/judge-preflight.ts:35:7
   // CLI cache boundary: XDG/OS env is converted to a concrete cache path here.
   // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
   const xdgCacheHome = (process.env["XDG_CACHE_HOME"] ?? "").trim();
-  if (xdgCacheHome.length > 0) {
+  if (xdgCacheHome.length <= 0) {
     return xdgCacheHome;
   }
killedBy: judge preflight cache reuses the disk cache for back-to-back anthropic preflight calls
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] ConditionalExpression
src/app/judge-preflight.ts:38:7
   if (xdgCacheHome.length > 0) {
     return xdgCacheHome;
   }
-  if (process.platform === "darwin") {
+  if (true) {
     return path.join(os.homedir(), "Library", "Caches");
   }

[Survived] BlockStatement
src/app/judge-preflight.ts:38:38
   if (xdgCacheHome.length > 0) {
     return xdgCacheHome;
   }
-  if (process.platform === "darwin") {
-    return path.join(os.homedir(), "Library", "Caches");
-  }
+  if (process.platform === "darwin") {}
   if (process.platform === "win32") {
     // CLI cache boundary: Windows cache location comes from the host env.

[Survived] StringLiteral
src/app/judge-preflight.ts:39:36
     return xdgCacheHome;
   }
   if (process.platform === "darwin") {
-    return path.join(os.homedir(), "Library", "Caches");
+    return path.join(os.homedir(), "", "Caches");
   }
   if (process.platform === "win32") {

[NoCoverage] EqualityOperator
src/app/judge-preflight.ts:41:7
   if (process.platform === "darwin") {
     return path.join(os.homedir(), "Library", "Caches");
   }
-  if (process.platform === "win32") {
+  if (process.platform !== "win32") {
     // CLI cache boundary: Windows cache location comes from the host env.
     // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime

[NoCoverage] ConditionalExpression
src/app/judge-preflight.ts:41:7
   if (process.platform === "darwin") {
     return path.join(os.homedir(), "Library", "Caches");
   }
-  if (process.platform === "win32") {
+  if (true) {
     // CLI cache boundary: Windows cache location comes from the host env.
     // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime

[NoCoverage] MethodExpression
src/app/judge-preflight.ts:44:26
   if (process.platform === "win32") {
     // CLI cache boundary: Windows cache location comes from the host env.
     // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
-    const localAppData = (process.env["LOCALAPPDATA"] ?? "").trim();
+    const localAppData = process.env["LOCALAPPDATA"] ?? "";
     if (localAppData.length > 0) {
       return localAppData;

[NoCoverage] EqualityOperator
src/app/judge-preflight.ts:45:9
     // CLI cache boundary: Windows cache location comes from the host env.
     // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
     const localAppData = (process.env["LOCALAPPDATA"] ?? "").trim();
-    if (localAppData.length > 0) {
+    if (localAppData.length >= 0) {
       return localAppData;
     }

[NoCoverage] ConditionalExpression
src/app/judge-preflight.ts:45:9
     // CLI cache boundary: Windows cache location comes from the host env.
     // eslint-disable-next-line agent-code-guard/no-process-env-at-runtime
     const localAppData = (process.env["LOCALAPPDATA"] ?? "").trim();
-    if (localAppData.length > 0) {
+    if (false) {
       return localAppData;
     }

[Killed] EqualityOperator
src/app/judge-preflight.ts:61:10
 }
 
 function cacheStillFresh(expiresAtMs: number, nowMs: number): boolean {
-  return expiresAtMs > nowMs;
+  return expiresAtMs <= nowMs;
 }
 
killedBy: main anthropic auth preflight reuses the cached success across repeated CLI invocations
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/judge-preflight.ts:61:10
 }
 
 function cacheStillFresh(expiresAtMs: number, nowMs: number): boolean {
-  return expiresAtMs > nowMs;
+  return false;
 }
 
killedBy: judge preflight cache reuses the disk cache for back-to-back anthropic preflight calls
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/app/judge-preflight.ts:64:56
   return expiresAtMs > nowMs;
 }
 
-function clearInvalidDiskCache(pathname: string): void {
-  try {
-    rmSync(pathname, { force: true });
-  } catch (error) {
-    void error;
-  }
-}
+function clearInvalidDiskCache(pathname: string): void {}
 
 function readAnthropicAuthCache(nowMs: number): boolean {
killedBy: judge preflight cache re-runs preflight after the disk cache is cleared
statusReason: expected "spy" to be called 2 times, but got 1 times

[Killed] BlockStatement
src/app/judge-preflight.ts:65:7
 }
 
 function clearInvalidDiskCache(pathname: string): void {
-  try {
-    rmSync(pathname, { force: true });
-  } catch (error) {
+  try {} catch (error) {
     void error;
   }
killedBy: judge preflight cache re-runs preflight after the disk cache is cleared
statusReason: expected "spy" to be called 2 times, but got 1 times

[Survived] BooleanLiteral
src/app/judge-preflight.ts:66:31
 
 function clearInvalidDiskCache(pathname: string): void {
   try {
-    rmSync(pathname, { force: true });
+    rmSync(pathname, { force: false });
   } catch (error) {
     void error;

[NoCoverage] BlockStatement
src/app/judge-preflight.ts:67:19
 function clearInvalidDiskCache(pathname: string): void {
   try {
     rmSync(pathname, { force: true });
-  } catch (error) {
-    void error;
-  }
+  } catch (error) {}
 }
 

[Killed] BooleanLiteral
src/app/judge-preflight.ts:78:14
     const parsed: unknown = JSON.parse(readFileSync(cachePath, "utf8"));
     if (typeof parsed !== "object" || parsed === null || !("checkedAtMs" in parsed)) {
       clearInvalidDiskCache(cachePath);
-      return false;
+      return true;
     }
     const checkedAtMs = parsed.checkedAtMs;
killedBy: judge preflight cache re-runs preflight when cache JSON is missing the checkedAtMs key entirely
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/app/judge-preflight.ts:81:44
       return false;
     }
     const checkedAtMs = parsed.checkedAtMs;
-    if (typeof checkedAtMs !== "number" || !Number.isFinite(checkedAtMs)) {
+    if (typeof checkedAtMs !== "number" || Number.isFinite(checkedAtMs)) {
       clearInvalidDiskCache(cachePath);
       return false;
killedBy: main anthropic auth preflight reuses the cached success across repeated CLI invocations
statusReason: StrykerJS: Unknown test failure

[Killed] ArithmeticOperator
src/app/judge-preflight.ts:85:25
       clearInvalidDiskCache(cachePath);
       return false;
     }
-    const expiresAtMs = checkedAtMs + ANTHROPIC_AUTH_CACHE_TTL_MS;
+    const expiresAtMs = checkedAtMs - ANTHROPIC_AUTH_CACHE_TTL_MS;
     if (!cacheStillFresh(expiresAtMs, nowMs)) {
       clearInvalidDiskCache(cachePath);
killedBy: judge preflight cache reuses the disk cache for back-to-back anthropic preflight calls
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BooleanLiteral
src/app/judge-preflight.ts:86:9
       return false;
     }
     const expiresAtMs = checkedAtMs + ANTHROPIC_AUTH_CACHE_TTL_MS;
-    if (!cacheStillFresh(expiresAtMs, nowMs)) {
+    if (cacheStillFresh(expiresAtMs, nowMs)) {
       clearInvalidDiskCache(cachePath);
       return false;
killedBy: main anthropic auth preflight reuses the cached success across repeated CLI invocations
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/judge-preflight.ts:86:9
       return false;
     }
     const expiresAtMs = checkedAtMs + ANTHROPIC_AUTH_CACHE_TTL_MS;
-    if (!cacheStillFresh(expiresAtMs, nowMs)) {
+    if (true) {
       clearInvalidDiskCache(cachePath);
       return false;
killedBy: judge preflight cache reuses the disk cache for back-to-back anthropic preflight calls
statusReason: expected "spy" to be called 1 times, but got 2 times

[Survived] ConditionalExpression
src/app/judge-preflight.ts:92:9
     }
     return true;
   } catch (error) {
-    if (error instanceof SyntaxError) {
+    if (false) {
       clearInvalidDiskCache(cachePath);
     }

[Survived] BlockStatement
src/app/judge-preflight.ts:92:39
     }
     return true;
   } catch (error) {
-    if (error instanceof SyntaxError) {
-      clearInvalidDiskCache(cachePath);
-    }
+    if (error instanceof SyntaxError) {}
     return false;
   }

[Killed] BlockStatement
src/app/judge-preflight.ts:99:55
   }
 }
 
-function writeAnthropicAuthCache(nowMs: number): void {
-  const cacheDir = resolveAnthropicAuthCacheDir();
-  const cachePath = resolveAnthropicAuthCachePath();
-  const tempPath = `${cachePath}.${process.pid}.tmp`;
-  const payload: AnthropicAuthSuccessCache = { checkedAtMs: nowMs };
-
-  mkdirSync(cacheDir, { recursive: true, mode: 0o700 });
-  writeFileSync(tempPath, JSON.stringify(payload), "utf8");
-  renameSync(tempPath, cachePath);
-}
+function writeAnthropicAuthCache(nowMs: number): void {}
 
 // Typed preflight outcome. CLI formats it for stderr; tests assert on the tag.
killedBy: main anthropic auth preflight reuses the cached success across repeated CLI invocations
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/app/judge-preflight.ts:105:36
   const tempPath = `${cachePath}.${process.pid}.tmp`;
   const payload: AnthropicAuthSuccessCache = { checkedAtMs: nowMs };
 
-  mkdirSync(cacheDir, { recursive: true, mode: 0o700 });
+  mkdirSync(cacheDir, { recursive: false, mode: 0o700 });
   writeFileSync(tempPath, JSON.stringify(payload), "utf8");
   renameSync(tempPath, cachePath);
killedBy: judge preflight cache re-runs preflight after the disk cache is cleared
statusReason: expected 'InvalidJson' to be 'Ready' // Object.is equality

[Killed] ConditionalExpression
src/app/judge-preflight.ts:128:7
 } as const satisfies { readonly [K in JudgePreflightResult["_tag"]]: K };
 
 export function ensureJudgeReady(judgeBackend: string): JudgePreflightResult {
-  if (!shouldPreflightClaudeAuth(judgeBackend)) {
+  if (false) {
     return JudgePreflightResult.Ready();
   }
killedBy: judge preflight cache skips preflight entirely when ANTHROPIC_API_KEY is set
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] BooleanLiteral
src/app/judge-preflight.ts:128:7
 } as const satisfies { readonly [K in JudgePreflightResult["_tag"]]: K };
 
 export function ensureJudgeReady(judgeBackend: string): JudgePreflightResult {
-  if (!shouldPreflightClaudeAuth(judgeBackend)) {
+  if (shouldPreflightClaudeAuth(judgeBackend)) {
     return JudgePreflightResult.Ready();
   }
killedBy: judge preflight cache skips preflight entirely when ANTHROPIC_API_KEY is set
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] BlockStatement
src/app/judge-preflight.ts:133:38
   }
 
   const nowMs = Date.now();
-  if (readAnthropicAuthCache(nowMs)) {
-    return JudgePreflightResult.Ready();
-  }
+  if (readAnthropicAuthCache(nowMs)) {}
 
   const result = spawnSync("claude", ["auth", "status"], {
killedBy: judge preflight cache reuses the disk cache for back-to-back anthropic preflight calls
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/app/judge-preflight.ts:133:7
   }
 
   const nowMs = Date.now();
-  if (readAnthropicAuthCache(nowMs)) {
+  if (false) {
     return JudgePreflightResult.Ready();
   }
killedBy: judge preflight cache reuses the disk cache for back-to-back anthropic preflight calls
statusReason: expected "spy" to be called 1 times, but got 2 times

[Survived] StringLiteral
src/app/judge-preflight.ts:137:39
     return JudgePreflightResult.Ready();
   }
 
-  const result = spawnSync("claude", ["auth", "status"], {
+  const result = spawnSync("claude", ["", "status"], {
     encoding: "utf8",
     timeout: CLAUDE_PREFLIGHT_TIMEOUT_MS,

[Survived] StringLiteral
src/app/judge-preflight.ts:137:28
     return JudgePreflightResult.Ready();
   }
 
-  const result = spawnSync("claude", ["auth", "status"], {
+  const result = spawnSync("", ["auth", "status"], {
     encoding: "utf8",
     timeout: CLAUDE_PREFLIGHT_TIMEOUT_MS,

[Killed] BlockStatement
src/app/judge-preflight.ts:142:35
     timeout: CLAUDE_PREFLIGHT_TIMEOUT_MS,
   });
 
-  if (result.error !== undefined) {
-    return JudgePreflightResult.PreflightFailed({ detail: result.error.message });
-  }
+  if (result.error !== undefined) {}
   if (result.status !== 0) {
     return JudgePreflightResult.PreflightFailed({ detail: result.stderr.trim() });
killedBy: judge preflight cache surfaces an ENOENT-like result.error from spawnSync as PreflightFailed
statusReason: expected '' to be 'spawn claude ENOENT' // Object.is equality

[Killed] ConditionalExpression
src/app/judge-preflight.ts:145:7
   if (result.error !== undefined) {
     return JudgePreflightResult.PreflightFailed({ detail: result.error.message });
   }
-  if (result.status !== 0) {
+  if (false) {
     return JudgePreflightResult.PreflightFailed({ detail: result.stderr.trim() });
   }
killedBy: judge preflight cache does not cache a failing auth preflight
statusReason: expected 'InvalidJson' to be 'PreflightFailed' // Object.is equality

[Killed] BlockStatement
src/app/judge-preflight.ts:145:28
   if (result.error !== undefined) {
     return JudgePreflightResult.PreflightFailed({ detail: result.error.message });
   }
-  if (result.status !== 0) {
-    return JudgePreflightResult.PreflightFailed({ detail: result.stderr.trim() });
-  }
+  if (result.status !== 0) {}
 
   try {
killedBy: judge preflight cache does not cache a failing auth preflight
statusReason: expected 'InvalidJson' to be 'PreflightFailed' // Object.is equality

[Killed] MethodExpression
src/app/judge-preflight.ts:146:59
     return JudgePreflightResult.PreflightFailed({ detail: result.error.message });
   }
   if (result.status !== 0) {
-    return JudgePreflightResult.PreflightFailed({ detail: result.stderr.trim() });
+    return JudgePreflightResult.PreflightFailed({ detail: result.stderr });
   }
 
killedBy: judge preflight cache returns the trimmed stderr when claude exits non-zero with a message
statusReason: expected '  not logged in  \n' to be 'not logged in' // Object.is equality

[Killed] ConditionalExpression
src/app/judge-preflight.ts:152:7
   try {
     const parsed: unknown = JSON.parse(result.stdout);
     if (
-      typeof parsed !== "object" ||
-      parsed === null ||
-      !("loggedIn" in parsed) ||
-      parsed.loggedIn !== true
+      true
     ) {
       return JudgePreflightResult.AuthMissing();
killedBy: judge preflight cache reuses the disk cache for back-to-back anthropic preflight calls
statusReason: expected 'AuthMissing' to be 'Ready' // Object.is equality

[Killed] ConditionalExpression
src/app/judge-preflight.ts:152:7
   try {
     const parsed: unknown = JSON.parse(result.stdout);
     if (
-      typeof parsed !== "object" ||
-      parsed === null ||
-      !("loggedIn" in parsed) ||
-      parsed.loggedIn !== true
+      false
     ) {
       return JudgePreflightResult.AuthMissing();
killedBy: judge preflight cache treats loggedIn=false as AuthMissing and does not cache
statusReason: expected 'Ready' to be 'AuthMissing' // Object.is equality

[Killed] BooleanLiteral
src/app/judge-preflight.ts:155:27
       typeof parsed !== "object" ||
       parsed === null ||
       !("loggedIn" in parsed) ||
-      parsed.loggedIn !== true
+      parsed.loggedIn !== false
     ) {
       return JudgePreflightResult.AuthMissing();
killedBy: judge preflight cache reuses the disk cache for back-to-back anthropic preflight calls
statusReason: expected 'AuthMissing' to be 'Ready' // Object.is equality

[Killed] ConditionalExpression
src/app/judge-preflight.ts:155:7
       typeof parsed !== "object" ||
       parsed === null ||
       !("loggedIn" in parsed) ||
-      parsed.loggedIn !== true
+      false
     ) {
       return JudgePreflightResult.AuthMissing();
killedBy: judge preflight cache treats loggedIn=false as AuthMissing and does not cache
statusReason: expected 'Ready' to be 'AuthMissing' // Object.is equality

[Killed] BlockStatement
src/app/judge-preflight.ts:156:7
       parsed === null ||
       !("loggedIn" in parsed) ||
       parsed.loggedIn !== true
-    ) {
-      return JudgePreflightResult.AuthMissing();
-    }
+    ) {}
     writeAnthropicAuthCache(nowMs);
     return JudgePreflightResult.Ready();
killedBy: judge preflight cache treats loggedIn=false as AuthMissing and does not cache
statusReason: expected 'Ready' to be 'AuthMissing' // Object.is equality

[Killed] ConditionalExpression
src/app/judge-preflight.ts:172:5
   switch (result._tag) {
     case "Ready":
       return null;
-    case "PreflightFailed":
-      return result.detail.length > 0
-        ? `claude auth preflight failed: ${result.detail}`
-        : "claude auth preflight failed";
+    case "PreflightFailed":
     case "AuthMissing":
       return "claude auth missing: run `claude auth login` or set ANTHROPIC_API_KEY";
killedBy: formatJudgePreflightMessage PreflightFailed with non-empty detail: 'claude auth preflight failed: <detail>'
statusReason: expected 'claude auth missing: run `claude auth…' to be 'claude auth preflight failed: spawn E…' // Object.is equality

[Killed] EqualityOperator
src/app/judge-preflight.ts:173:14
     case "Ready":
       return null;
     case "PreflightFailed":
-      return result.detail.length > 0
+      return result.detail.length <= 0
         ? `claude auth preflight failed: ${result.detail}`
         : "claude auth preflight failed";
killedBy: formatJudgePreflightMessage PreflightFailed with non-empty detail: 'claude auth preflight failed: <detail>'
statusReason: expected 'claude auth preflight failed' to be 'claude auth preflight failed: spawn E…' // Object.is equality

[Killed] EqualityOperator
src/app/judge-preflight.ts:173:14
     case "Ready":
       return null;
     case "PreflightFailed":
-      return result.detail.length > 0
+      return result.detail.length >= 0
         ? `claude auth preflight failed: ${result.detail}`
         : "claude auth preflight failed";
killedBy: formatJudgePreflightMessage PreflightFailed with empty detail: 'claude auth preflight failed' (no trailing colon)
statusReason: expected 'claude auth preflight failed: ' to be 'claude auth preflight failed' // Object.is equality

[Killed] EqualityOperator
src/app/judge-preflight.ts:179:14
     case "AuthMissing":
       return "claude auth missing: run `claude auth login` or set ANTHROPIC_API_KEY";
     case "InvalidJson":
-      return result.detail.length > 0
+      return result.detail.length >= 0
         ? `claude auth preflight returned invalid JSON: ${result.detail}`
         : "claude auth preflight returned invalid JSON";
killedBy: formatJudgePreflightMessage InvalidJson with empty detail: 'claude auth preflight returned invalid JSON' (no trailing colon)
statusReason: expected 'claude auth preflight returned invali…' to be 'claude auth preflight returned invali…' // Object.is equality

[Killed] ConditionalExpression
src/app/judge-preflight.ts:179:14
     case "AuthMissing":
       return "claude auth missing: run `claude auth login` or set ANTHROPIC_API_KEY";
     case "InvalidJson":
-      return result.detail.length > 0
+      return true
         ? `claude auth preflight returned invalid JSON: ${result.detail}`
         : "claude auth preflight returned invalid JSON";
killedBy: formatJudgePreflightMessage InvalidJson with empty detail: 'claude auth preflight returned invalid JSON' (no trailing colon)
statusReason: expected 'claude auth preflight returned invali…' to be 'claude auth preflight returned invali…' // Object.is equality

[Survived] BlockStatement
src/app/judge-preflight.ts:189:58
 // called both reset+clear in beforeEach. With no in-memory cache there is
 // no separate "memory" state to reset; both functions now clear the
 // disk cache.
-export function resetJudgePreflightCacheForTests(): void {
-  clearInvalidDiskCache(resolveAnthropicAuthCachePath());
-}
+export function resetJudgePreflightCacheForTests(): void {}
 
 export function clearJudgePreflightDiskCacheForTests(): void {

[Killed] BlockStatement
src/app/judge-preflight.ts:193:62
   clearInvalidDiskCache(resolveAnthropicAuthCachePath());
 }
 
-export function clearJudgePreflightDiskCacheForTests(): void {
-  clearInvalidDiskCache(resolveAnthropicAuthCachePath());
-}
+export function clearJudgePreflightDiskCacheForTests(): void {}
 
killedBy: judge preflight cache re-runs preflight after the disk cache is cleared
statusReason: expected "spy" to be called 2 times, but got 1 times
