[Survived] ConditionalExpression
src/runner/index.ts:334:13
         );
       }, opts.timeoutMs);
       child.on("close", () => {
-        if (finished) return;
+        if (false) return;
         finished = true;
         clearTimeout(timer);

[Killed] AssignmentOperator
src/runner/index.ts:337:9
         if (finished) return;
         finished = true;
         clearTimeout(timer);
-        handle.turnsExecuted.count += 1;
+        handle.turnsExecuted.count -= 1;
         const parsed = parseStreamJson(stdout);
         const responseText = parsed.response.length > 0 ? parsed.response : stderr;
killedBy: SubprocessRunner.turn() Turn shape increments turnsExecuted.count after each turn
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/index.ts:339:30
         clearTimeout(timer);
         handle.turnsExecuted.count += 1;
         const parsed = parseStreamJson(stdout);
-        const responseText = parsed.response.length > 0 ? parsed.response : stderr;
+        const responseText = parsed.response.length <= 0 ? parsed.response : stderr;
         const turn: Turn = {
           index: turnIndex,
killedBy: SubprocessRunner.turn() default args passes -p, --output-format, stream-json, --verbose, and prompt to binary
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/index.ts:339:30
         clearTimeout(timer);
         handle.turnsExecuted.count += 1;
         const parsed = parseStreamJson(stdout);
-        const responseText = parsed.response.length > 0 ? parsed.response : stderr;
+        const responseText = true ? parsed.response : stderr;
         const turn: Turn = {
           index: turnIndex,
killedBy: SubprocessRunner.turn() stream-json parsing uses stderr as fallback response when stdout is empty
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/index.ts:354:34
         };
         resume(Effect.succeed(turn));
       });
-      child.on("error", (err) => {
-        if (finished) return;
-        finished = true;
-        clearTimeout(timer);
-        // Spawn error mid-run: surface as a timeout-tagged failure so the pipeline
-        // folds it into a critical-severity RunRecord via the judge.
-        resume(
-          Effect.fail(
-            new AgentRunTimeoutError({
-              scenarioId: handle.scenarioId,
-              turnIndex,
-              timeoutMs: opts.timeoutMs,
-            }),
-          ),
-        );
-        void err;
-      });
+      child.on("error", (err) => {});
       return Effect.sync(() => {
         clearTimeout(timer);
killedBy: SubprocessRunner.turn() timeout + error paths returns AgentRunTimeoutError on spawn error (non-executable file)
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/runner/index.ts:354:16
         };
         resume(Effect.succeed(turn));
       });
-      child.on("error", (err) => {
+      child.on("", (err) => {
         if (finished) return;
         finished = true;
killedBy: SubprocessRunner.turn() timeout + error paths returns AgentRunTimeoutError on spawn error (non-executable file)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/index.ts:355:13
         resume(Effect.succeed(turn));
       });
       child.on("error", (err) => {
-        if (finished) return;
+        if (true) return;
         finished = true;
         clearTimeout(timer);
killedBy: SubprocessRunner.turn() timeout + error paths returns AgentRunTimeoutError on spawn error (non-executable file)
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/runner/index.ts:355:13
         resume(Effect.succeed(turn));
       });
       child.on("error", (err) => {
-        if (finished) return;
+        if (false) return;
         finished = true;
         clearTimeout(timer);

[NoCoverage] BlockStatement
src/runner/index.ts:371:32
         );
         void err;
       });
-      return Effect.sync(() => {
-        clearTimeout(timer);
-        try {
-          child.kill("SIGKILL");
-        } catch (err) { void err;
-          // Nothing to clean up — kill is best-effort during interruption.
-        }
-      });
+      return Effect.sync(() => {});
     });
   }

[NoCoverage] BlockStatement
src/runner/index.ts:373:13
       });
       return Effect.sync(() => {
         clearTimeout(timer);
-        try {
-          child.kill("SIGKILL");
-        } catch (err) { void err;
+        try {} catch (err) { void err;
           // Nothing to clean up — kill is best-effort during interruption.
         }

[NoCoverage] BlockStatement
src/runner/index.ts:375:23
         clearTimeout(timer);
         try {
           child.kill("SIGKILL");
-        } catch (err) { void err;
-          // Nothing to clean up — kill is best-effort during interruption.
-        }
+        } catch (err) {}
       });
     });

[Killed] BlockStatement
src/runner/index.ts:389:30
   }
 
   stop(handle: AgentHandle): Effect.Effect<void, never, never> {
-    return Effect.sync(() => {
-      try {
-        rmSync(handle.workspaceDir, { recursive: true, force: true });
-      } catch (err) { void err;
-        // Teardown is best-effort. Invariant #7: stop never fails.
-      }
-    });
+    return Effect.sync(() => {});
   }
 }
killedBy: SubprocessRunner.stop() removes the workspace directory
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/index.ts:390:11
 
   stop(handle: AgentHandle): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
-      try {
-        rmSync(handle.workspaceDir, { recursive: true, force: true });
-      } catch (err) { void err;
+      try {} catch (err) { void err;
         // Teardown is best-effort. Invariant #7: stop never fails.
       }
killedBy: SubprocessRunner.stop() removes the workspace directory
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/runner/index.ts:391:50
   stop(handle: AgentHandle): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
       try {
-        rmSync(handle.workspaceDir, { recursive: true, force: true });
+        rmSync(handle.workspaceDir, { recursive: false, force: true });
       } catch (err) { void err;
         // Teardown is best-effort. Invariant #7: stop never fails.
killedBy: SubprocessRunner.stop() removes the workspace directory
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/runner/index.ts:391:63
   stop(handle: AgentHandle): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
       try {
-        rmSync(handle.workspaceDir, { recursive: true, force: true });
+        rmSync(handle.workspaceDir, { recursive: true, force: false });
       } catch (err) { void err;
         // Teardown is best-effort. Invariant #7: stop never fails.

[NoCoverage] BlockStatement
src/runner/index.ts:392:21
     return Effect.sync(() => {
       try {
         rmSync(handle.workspaceDir, { recursive: true, force: true });
-      } catch (err) { void err;
-        // Teardown is best-effort. Invariant #7: stop never fails.
-      }
+      } catch (err) {}
     });
   }

[Killed] ConditionalExpression
src/runner/index.ts:419:11
   start(scenario: Scenario): Effect.Effect<AgentHandle, AgentStartError, never> {
     return Effect.suspend(() => {
       const imageAvailable = dockerImageExists(this.#opts.image);
-      if (!imageAvailable) {
+      if (false) {
         return Effect.fail(
           new AgentStartError({
killedBy: DockerRunner.start() returns AgentStartError{ImageMissing} when docker image inspect fails
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/index.ts:419:11
   start(scenario: Scenario): Effect.Effect<AgentHandle, AgentStartError, never> {
     return Effect.suspend(() => {
       const imageAvailable = dockerImageExists(this.#opts.image);
-      if (!imageAvailable) {
+      if (true) {
         return Effect.fail(
           new AgentStartError({
killedBy: DockerRunner.start() returns AgentStartError{ContainerStartFailed} when docker create fails
statusReason: StrykerJS: Unknown test failure

[Survived] StringLiteral
src/runner/index.ts:438:17
                 "-v",
                 `${dir}:/workspace`,
                 "-w",
-                "/workspace",
+                "",
                 "--network",
                 network,

[Killed] StringLiteral
src/runner/index.ts:439:17
                 `${dir}:/workspace`,
                 "-w",
                 "/workspace",
-                "--network",
+                "",
                 network,
                 ...(this.#opts.memoryMb !== undefined ? ["--memory", `${this.#opts.memoryMb}m`] : []),
killedBy: DockerRunner integration (real Docker) start() yields a running container; stop() tears it down
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/index.ts:441:21
                 "/workspace",
                 "--network",
                 network,
-                ...(this.#opts.memoryMb !== undefined ? ["--memory", `${this.#opts.memoryMb}m`] : []),
+                ...(true ? ["--memory", `${this.#opts.memoryMb}m`] : []),
                 ...(this.#opts.cpus !== undefined ? ["--cpus", String(this.#opts.cpus)] : []),
                 this.#opts.image,
killedBy: DockerRunner integration (real Docker) start() yields a running container; stop() tears it down
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/index.ts:441:21
                 "/workspace",
                 "--network",
                 network,
-                ...(this.#opts.memoryMb !== undefined ? ["--memory", `${this.#opts.memoryMb}m`] : []),
+                ...(this.#opts.memoryMb === undefined ? ["--memory", `${this.#opts.memoryMb}m`] : []),
                 ...(this.#opts.cpus !== undefined ? ["--cpus", String(this.#opts.cpus)] : []),
                 this.#opts.image,
killedBy: DockerRunner integration (real Docker) start() yields a running container; stop() tears it down
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/index.ts:442:21
                 "--network",
                 network,
                 ...(this.#opts.memoryMb !== undefined ? ["--memory", `${this.#opts.memoryMb}m`] : []),
-                ...(this.#opts.cpus !== undefined ? ["--cpus", String(this.#opts.cpus)] : []),
+                ...(this.#opts.cpus === undefined ? ["--cpus", String(this.#opts.cpus)] : []),
                 this.#opts.image,
                 "tail",
killedBy: DockerRunner integration (real Docker) start() yields a running container; stop() tears it down
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/index.ts:442:21
                 "--network",
                 network,
                 ...(this.#opts.memoryMb !== undefined ? ["--memory", `${this.#opts.memoryMb}m`] : []),
-                ...(this.#opts.cpus !== undefined ? ["--cpus", String(this.#opts.cpus)] : []),
+                ...(true ? ["--cpus", String(this.#opts.cpus)] : []),
                 this.#opts.image,
                 "tail",
killedBy: DockerRunner integration (real Docker) start() yields a running container; stop() tears it down
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/runner/index.ts:444:17
                 ...(this.#opts.memoryMb !== undefined ? ["--memory", `${this.#opts.memoryMb}m`] : []),
                 ...(this.#opts.cpus !== undefined ? ["--cpus", String(this.#opts.cpus)] : []),
                 this.#opts.image,
-                "tail",
+                "",
                 "-f",
                 "/dev/null",
killedBy: DockerRunner integration (real Docker) start() yields a running container; stop() tears it down
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/runner/index.ts:448:27
                 "-f",
                 "/dev/null",
               ];
-              const cid = execSync(`docker ${args.map(shellQuote).join(" ")}`, { stdio: ["ignore", "pipe", "pipe"] })
-                .toString("utf8")
-                .trim();
+              const cid = execSync(`docker ${args.map(shellQuote).join(" ")}`, {
+  stdio: ["ignore", "pipe", "pipe"]
+}).toString("utf8");
               execSync(`docker start ${shellQuote(cid)}`, { stdio: "ignore" });
               return {
killedBy: DockerRunner.start() returns AgentHandle on happy path with correct kind and containerId
statusReason: StrykerJS: Unknown test failure

[Survived] ObjectLiteral
src/runner/index.ts:451:59
               const cid = execSync(`docker ${args.map(shellQuote).join(" ")}`, { stdio: ["ignore", "pipe", "pipe"] })
                 .toString("utf8")
                 .trim();
-              execSync(`docker start ${shellQuote(cid)}`, { stdio: "ignore" });
+              execSync(`docker start ${shellQuote(cid)}`, {});
               return {
                 __brand: "AgentHandle",

[Killed] StringLiteral
src/runner/index.ts:489:27
 
     return Effect.async<Turn, AgentRunTimeoutError, never>((resume) => {
       let finished = false;
-      const child = spawn("docker", args, { stdio: ["ignore", "pipe", "pipe"] });
+      const child = spawn("", args, { stdio: ["ignore", "pipe", "pipe"] });
       let stdout = "";
       let stderr = "";
killedBy: DockerRunner.turn() spawn is called with docker exec <cid> claude and DEFAULT_CLAUDE_ARGS
statusReason: StrykerJS: Unknown test failure

[Killed] OptionalChaining
src/runner/index.ts:492:7
       const child = spawn("docker", args, { stdio: ["ignore", "pipe", "pipe"] });
       let stdout = "";
       let stderr = "";
-      child.stdout?.on("data", (c: Buffer) => {
+      child.stdout.on("data", (c: Buffer) => {
         stdout += c.toString("utf8");
       });
killedBy: DockerRunner.turn() optional chaining succeeds when child.stdout is undefined (optional chaining guard)
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/index.ts:492:47
       const child = spawn("docker", args, { stdio: ["ignore", "pipe", "pipe"] });
       let stdout = "";
       let stderr = "";
-      child.stdout?.on("data", (c: Buffer) => {
-        stdout += c.toString("utf8");
-      });
+      child.stdout?.on("data", (c: Buffer) => {});
       child.stderr?.on("data", (c: Buffer) => {
         stderr += c.toString("utf8");
killedBy: DockerRunner.turn() returns a Turn with assistant response from stdout
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/index.ts:495:47
       child.stdout?.on("data", (c: Buffer) => {
         stdout += c.toString("utf8");
       });
-      child.stderr?.on("data", (c: Buffer) => {
-        stderr += c.toString("utf8");
-      });
+      child.stderr?.on("data", (c: Buffer) => {});
       const timer = setTimeout(() => {
         if (finished) return;
killedBy: DockerRunner.turn() falls back to stderr when stdout produces no JSON response
statusReason: StrykerJS: Unknown test failure

[Killed] OptionalChaining
src/runner/index.ts:495:7
       child.stdout?.on("data", (c: Buffer) => {
         stdout += c.toString("utf8");
       });
-      child.stderr?.on("data", (c: Buffer) => {
+      child.stderr.on("data", (c: Buffer) => {
         stderr += c.toString("utf8");
       });
killedBy: DockerRunner.turn() optional chaining succeeds when child.stdout is undefined (optional chaining guard)
statusReason: StrykerJS: Unknown test failure

[Timeout] BlockStatement
src/runner/index.ts:498:38
       child.stderr?.on("data", (c: Buffer) => {
         stderr += c.toString("utf8");
       });
-      const timer = setTimeout(() => {
-        if (finished) return;
-        finished = true;
-        try {
-          child.kill("SIGKILL");
-        } catch (err) { void err;
-          // docker exec process may have already exited; container is handled in stop().
-        }
-        resume(
-          Effect.fail(
-            new AgentRunTimeoutError({
-              scenarioId: handle.scenarioId,
-              turnIndex,
-              timeoutMs: opts.timeoutMs,
-            }),
-          ),
-        );
-      }, opts.timeoutMs);
+      const timer = setTimeout(() => {}, opts.timeoutMs);
       child.on("close", () => {
         if (finished) return;

[NoCoverage] BlockStatement
src/runner/index.ts:503:23
         finished = true;
         try {
           child.kill("SIGKILL");
-        } catch (err) { void err;
-          // docker exec process may have already exited; container is handled in stop().
-        }
+        } catch (err) {}
         resume(
           Effect.fail(

[Killed] EqualityOperator
src/runner/index.ts:522:30
         clearTimeout(timer);
         handle.turnsExecuted.count += 1;
         const parsed = parseStreamJson(stdout);
-        const responseText = parsed.response.length > 0 ? parsed.response : stderr;
+        const responseText = parsed.response.length >= 0 ? parsed.response : stderr;
         const turn: Turn = {
           index: turnIndex,
killedBy: DockerRunner.turn() falls back to stderr when stdout produces no JSON response
statusReason: StrykerJS: Unknown test failure

[Timeout] BlockStatement
src/runner/index.ts:537:31
         };
         resume(Effect.succeed(turn));
       });
-      child.on("error", () => {
-        if (finished) return;
-        finished = true;
-        clearTimeout(timer);
-        resume(
-          Effect.fail(
-            new AgentRunTimeoutError({
-              scenarioId: handle.scenarioId,
-              turnIndex,
-              timeoutMs: opts.timeoutMs,
-            }),
-          ),
-        );
-      });
+      child.on("error", () => {});
       return Effect.sync(() => {
         clearTimeout(timer);

[Timeout] StringLiteral
src/runner/index.ts:537:16
         };
         resume(Effect.succeed(turn));
       });
-      child.on("error", () => {
+      child.on("", () => {
         if (finished) return;
         finished = true;

[Survived] ConditionalExpression
src/runner/index.ts:538:13
         resume(Effect.succeed(turn));
       });
       child.on("error", () => {
-        if (finished) return;
+        if (false) return;
         finished = true;
         clearTimeout(timer);

[Timeout] ConditionalExpression
src/runner/index.ts:538:13
         resume(Effect.succeed(turn));
       });
       child.on("error", () => {
-        if (finished) return;
+        if (true) return;
         finished = true;
         clearTimeout(timer);

[NoCoverage] BlockStatement
src/runner/index.ts:551:32
           ),
         );
       });
-      return Effect.sync(() => {
-        clearTimeout(timer);
-        try {
-          child.kill("SIGKILL");
-        } catch (err) { void err;
-          // Interrupted mid-flight; container cleanup is stop()'s job.
-        }
-      });
+      return Effect.sync(() => {});
     });
   }

[NoCoverage] BlockStatement
src/runner/index.ts:555:23
         clearTimeout(timer);
         try {
           child.kill("SIGKILL");
-        } catch (err) { void err;
-          // Interrupted mid-flight; container cleanup is stop()'s job.
-        }
+        } catch (err) {}
       });
     });

[Killed] BlockStatement
src/runner/index.ts:569:30
   }
 
   stop(handle: AgentHandle): Effect.Effect<void, never, never> {
-    return Effect.sync(() => {
-      const cid = handle.containerId;
-      if (cid !== undefined && cid.length > 0) {
-        try {
-          execSync(`docker kill ${shellQuote(cid)}`, { stdio: "ignore" });
-        } catch (err) { void err;
-          // Already dead — that is fine.
-        }
-        try {
-          execSync(`docker rm -f ${shellQuote(cid)}`, { stdio: "ignore" });
-        } catch (err) { void err;
-          // --rm handles most cleanup; this is a safety net.
-        }
-      }
-      try {
-        rmSync(handle.workspaceDir, { recursive: true, force: true });
-      } catch (err) { void err;
-        // Filesystem cleanup best-effort; invariant #7 forbids propagation.
-      }
-    });
+    return Effect.sync(() => {});
   }
 }
killedBy: DockerRunner.stop() removes workspace directory
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/index.ts:571:32
   stop(handle: AgentHandle): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
       const cid = handle.containerId;
-      if (cid !== undefined && cid.length > 0) {
+      if (cid !== undefined && cid.length <= 0) {
         try {
           execSync(`docker kill ${shellQuote(cid)}`, { stdio: "ignore" });
killedBy: DockerRunner.stop() calls docker kill and docker rm when containerId is present
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/index.ts:571:48
   stop(handle: AgentHandle): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
       const cid = handle.containerId;
-      if (cid !== undefined && cid.length > 0) {
-        try {
-          execSync(`docker kill ${shellQuote(cid)}`, { stdio: "ignore" });
-        } catch (err) { void err;
-          // Already dead — that is fine.
-        }
-        try {
-          execSync(`docker rm -f ${shellQuote(cid)}`, { stdio: "ignore" });
-        } catch (err) { void err;
-          // --rm handles most cleanup; this is a safety net.
-        }
-      }
+      if (cid !== undefined && cid.length > 0) {}
       try {
         rmSync(handle.workspaceDir, { recursive: true, force: true });
killedBy: DockerRunner.stop() calls docker kill and docker rm when containerId is present
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/index.ts:572:13
     return Effect.sync(() => {
       const cid = handle.containerId;
       if (cid !== undefined && cid.length > 0) {
-        try {
-          execSync(`docker kill ${shellQuote(cid)}`, { stdio: "ignore" });
-        } catch (err) { void err;
+        try {} catch (err) { void err;
           // Already dead — that is fine.
         }
killedBy: DockerRunner.stop() calls docker kill and docker rm when containerId is present
statusReason: StrykerJS: Unknown test failure

[Survived] BlockStatement
src/runner/index.ts:574:23
       if (cid !== undefined && cid.length > 0) {
         try {
           execSync(`docker kill ${shellQuote(cid)}`, { stdio: "ignore" });
-        } catch (err) { void err;
-          // Already dead — that is fine.
-        }
+        } catch (err) {}
         try {
           execSync(`docker rm -f ${shellQuote(cid)}`, { stdio: "ignore" });

[Killed] BlockStatement
src/runner/index.ts:577:13
         } catch (err) { void err;
           // Already dead — that is fine.
         }
-        try {
-          execSync(`docker rm -f ${shellQuote(cid)}`, { stdio: "ignore" });
-        } catch (err) { void err;
+        try {} catch (err) { void err;
           // --rm handles most cleanup; this is a safety net.
         }
killedBy: DockerRunner.stop() calls docker kill and docker rm when containerId is present
statusReason: StrykerJS: Unknown test failure

[Survived] BlockStatement
src/runner/index.ts:579:23
         }
         try {
           execSync(`docker rm -f ${shellQuote(cid)}`, { stdio: "ignore" });
-        } catch (err) { void err;
-          // --rm handles most cleanup; this is a safety net.
-        }
+        } catch (err) {}
       }
       try {

[Killed] BlockStatement
src/runner/index.ts:583:11
           // --rm handles most cleanup; this is a safety net.
         }
       }
-      try {
-        rmSync(handle.workspaceDir, { recursive: true, force: true });
-      } catch (err) { void err;
+      try {} catch (err) { void err;
         // Filesystem cleanup best-effort; invariant #7 forbids propagation.
       }
killedBy: DockerRunner.stop() removes workspace directory
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/runner/index.ts:585:21
       }
       try {
         rmSync(handle.workspaceDir, { recursive: true, force: true });
-      } catch (err) { void err;
-        // Filesystem cleanup best-effort; invariant #7 forbids propagation.
-      }
+      } catch (err) {}
     });
   }

[Killed] BooleanLiteral
src/runner/index.ts:595:12
 function dockerImageExists(image: string): boolean {
   try {
     execSync(`docker image inspect ${shellQuote(image)}`, { stdio: "ignore" });
-    return true;
+    return false;
   } catch (err) { void err;
     return false;
killedBy: DockerRunner integration (real Docker) start() yields a running container; stop() tears it down
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/runner/index.ts:597:12
     execSync(`docker image inspect ${shellQuote(image)}`, { stdio: "ignore" });
     return true;
   } catch (err) { void err;
-    return false;
+    return true;
   }
 }
killedBy: DockerRunner.start() returns AgentStartError{ImageMissing} when docker image inspect fails
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/index.ts:602:7
 }
 
 function shellQuote(s: string): string {
-  if (/^[A-Za-z0-9_:@./=-]+$/.test(s)) return s;
+  if (false) return s;
   return `'${s.replace(/'/g, `'\\''`)}'`;
 }
killedBy: DockerRunner shellQuote (via start() command inspection) safe image name is passed unquoted in docker image inspect command
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/index.ts:602:7
 }
 
 function shellQuote(s: string): string {
-  if (/^[A-Za-z0-9_:@./=-]+$/.test(s)) return s;
+  if (true) return s;
   return `'${s.replace(/'/g, `'\\''`)}'`;
 }
killedBy: DockerRunner shellQuote (via start() command inspection) image name with spaces is shell-quoted in docker commands
statusReason: StrykerJS: Unknown test failure

[Survived] StringLiteral
src/runner/index.ts:603:30
 
 function shellQuote(s: string): string {
   if (/^[A-Za-z0-9_:@./=-]+$/.test(s)) return s;
-  return `'${s.replace(/'/g, `'\\''`)}'`;
+  return `'${s.replace(/'/g, ``)}'`;
 }
 
