[Survived] ConditionalExpression
src/app/pipeline.ts:49:7
   opts: SharedOpts,
   run: (abortSignal: AbortSignal | undefined) => Effect.Effect<A, E, never>,
 ): Effect.Effect<A, E, never> {
-  if (opts.totalTimeoutMs === undefined) {
+  if (false) {
     return run(opts.abortSignal);
   }

[Survived] EqualityOperator
src/app/pipeline.ts:49:7
   opts: SharedOpts,
   run: (abortSignal: AbortSignal | undefined) => Effect.Effect<A, E, never>,
 ): Effect.Effect<A, E, never> {
-  if (opts.totalTimeoutMs === undefined) {
+  if (opts.totalTimeoutMs !== undefined) {
     return run(opts.abortSignal);
   }

[NoCoverage] BlockStatement
src/app/pipeline.ts:56:35
     Effect.sync(() => {
       const controller = new AbortController();
       const parentSignal = opts.abortSignal;
-      const onParentAbort = () => {
-        controller.abort(parentSignal?.reason);
-      };
+      const onParentAbort = () => {};
       if (parentSignal !== undefined) {
         if (parentSignal.aborted) {

[NoCoverage] BlockStatement
src/app/pipeline.ts:59:39
       const onParentAbort = () => {
         controller.abort(parentSignal?.reason);
       };
-      if (parentSignal !== undefined) {
-        if (parentSignal.aborted) {
-          controller.abort(parentSignal.reason);
-        } else {
-          parentSignal.addEventListener("abort", onParentAbort, { once: true });
-        }
-      }
+      if (parentSignal !== undefined) {}
       const timer = setTimeout(() => {
         controller.abort(new Error(`total timeout after ${String(opts.totalTimeoutMs)}ms`));

[NoCoverage] BlockStatement
src/app/pipeline.ts:60:35
         controller.abort(parentSignal?.reason);
       };
       if (parentSignal !== undefined) {
-        if (parentSignal.aborted) {
-          controller.abort(parentSignal.reason);
-        } else {
+        if (parentSignal.aborted) {} else {
           parentSignal.addEventListener("abort", onParentAbort, { once: true });
         }

[NoCoverage] BlockStatement
src/app/pipeline.ts:62:16
       if (parentSignal !== undefined) {
         if (parentSignal.aborted) {
           controller.abort(parentSignal.reason);
-        } else {
-          parentSignal.addEventListener("abort", onParentAbort, { once: true });
-        }
+        } else {}
       }
       const timer = setTimeout(() => {

[NoCoverage] BooleanLiteral
src/app/pipeline.ts:63:73
         if (parentSignal.aborted) {
           controller.abort(parentSignal.reason);
         } else {
-          parentSignal.addEventListener("abort", onParentAbort, { once: true });
+          parentSignal.addEventListener("abort", onParentAbort, { once: false });
         }
       }

[NoCoverage] BlockStatement
src/app/pipeline.ts:66:38
           parentSignal.addEventListener("abort", onParentAbort, { once: true });
         }
       }
-      const timer = setTimeout(() => {
-        controller.abort(new Error(`total timeout after ${String(opts.totalTimeoutMs)}ms`));
-      }, opts.totalTimeoutMs);
+      const timer = setTimeout(() => {}, opts.totalTimeoutMs);
       return {
         signal: controller.signal,

[NoCoverage] BlockStatement
src/app/pipeline.ts:71:24
       }, opts.totalTimeoutMs);
       return {
         signal: controller.signal,
-        cleanup: () => {
-          clearTimeout(timer);
-          parentSignal?.removeEventListener("abort", onParentAbort);
-        },
+        cleanup: () => {},
       };
     }),

[NoCoverage] StringLiteral
src/app/pipeline.ts:73:45
         signal: controller.signal,
         cleanup: () => {
           clearTimeout(timer);
-          parentSignal?.removeEventListener("abort", onParentAbort);
+          parentSignal?.removeEventListener("", onParentAbort);
         },
       };

[Killed] EqualityOperator
src/app/pipeline.ts:105:28
 };
 
 function classifyChange(c: WorkspaceFileChange): keyof DiffSummary {
-  if (c.before === null && c.after !== null) return "added";
+  if (c.before === null && c.after === null) return "added";
   if (c.before !== null && c.after === null) return "removed";
   return "changed";
killedBy: summarizeDiff (PBT) counts add/remove/change buckets matching the before/after rule
statusReason: Property failed after 3 tests
{ seed: -1360431627, path: "2:1:0:1:1:1:1", endOnFailure: true }
Counterexample: [[{"path":" ","before":null,"after":null}]]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/app/pipeline.ts:105:28
 };
 
 function classifyChange(c: WorkspaceFileChange): keyof DiffSummary {
-  if (c.before === null && c.after !== null) return "added";
+  if (c.before === null && true) return "added";
   if (c.before !== null && c.after === null) return "removed";
   return "changed";
killedBy: summarizeDiff (PBT) counts add/remove/change buckets matching the before/after rule
statusReason: Property failed after 24 tests
{ seed: 982786542, path: "23:1:0:0:0:1:1", endOnFailure: true }
Counterexample: [[{"path":" ","before":null,"after":null}]]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/app/pipeline.ts:106:7
 
 function classifyChange(c: WorkspaceFileChange): keyof DiffSummary {
   if (c.before === null && c.after !== null) return "added";
-  if (c.before !== null && c.after === null) return "removed";
+  if (false) return "removed";
   return "changed";
 }
killedBy: summarizeDiff (PBT) counts add/remove/change buckets matching the before/after rule
statusReason: Property failed after 1 tests
{ seed: 664653760, path: "0:1:1:1:2:1", endOnFailure: true }
Counterexample: [[{"path":" ","before":"","after":null}]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/app/pipeline.ts:106:7
 
 function classifyChange(c: WorkspaceFileChange): keyof DiffSummary {
   if (c.before === null && c.after !== null) return "added";
-  if (c.before !== null && c.after === null) return "removed";
+  if (true) return "removed";
   return "changed";
 }
killedBy: summarizeDiff (PBT) counts add/remove/change buckets matching the before/after rule
statusReason: Property failed after 1 tests
{ seed: 1795215942, path: "0:1:1:1:2:2", endOnFailure: true }
Counterexample: [[{"path":" ","before":"","after":""}]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/app/pipeline.ts:115:34
   return (diff?.changed ?? []).reduce<DiffSummary>(
     (acc, c) => {
       const bucket = classifyChange(c);
-      return { ...acc, [bucket]: acc[bucket] + 1 };
+      return { ...acc, [bucket]: acc[bucket] - 1 };
     },
     { changed: 0, added: 0, removed: 0 },
killedBy: summarizeDiff (PBT) counts add/remove/change buckets matching the before/after rule
statusReason: Property failed after 1 tests
{ seed: -2062268294, path: "0:1:0:0:1:1:1:1:1", endOnFailure: true }
Counterexample: [[{"path":" ","before":null,"after":null}]]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/app/pipeline.ts:125:22
 export function sumTurns(turns: ReadonlyArray<Turn>): TurnAggregate {
   return turns.reduce<TurnAggregate>(
     (acc, t) => ({
-      toolCallCount: acc.toolCallCount + t.toolCallCount,
+      toolCallCount: acc.toolCallCount - t.toolCallCount,
       inputTokens: acc.inputTokens + t.inputTokens,
       outputTokens: acc.outputTokens + t.outputTokens,
killedBy: sumTurns (PBT) each field is the field-wise sum across all input turns
statusReason: Property failed after 1 tests
{ seed: -567597076, path: "0:1:0:0:1:1:1:1:2:1:1:1:1:1:1:1:2:2:2:2:2", endOnFailure: true }
Counterexample: [[{"index":0,"prompt":"","response":"","startedAt":"2026-04-29T00:00:00.000Z","latencyMs":0,"toolCallCount":1,"inputTokens":0,"outputTokens":0,"cacheReadTokens":0,"cacheWriteTokens":0}]]
Shrunk 20 time(s)

Hint: Enable verbose mode in order to have the list of a

[Killed] ArithmeticOperator
src/app/pipeline.ts:126:20
   return turns.reduce<TurnAggregate>(
     (acc, t) => ({
       toolCallCount: acc.toolCallCount + t.toolCallCount,
-      inputTokens: acc.inputTokens + t.inputTokens,
+      inputTokens: acc.inputTokens - t.inputTokens,
       outputTokens: acc.outputTokens + t.outputTokens,
       cacheReadTokens: acc.cacheReadTokens + t.cacheReadTokens,
killedBy: sumTurns (PBT) each field is the field-wise sum across all input turns
statusReason: Property failed after 1 tests
{ seed: 1955668403, path: "0:1:0:1:1:1:1:2:1:1:2:2:2:2", endOnFailure: true }
Counterexample: [[{"index":0,"prompt":"","response":"","startedAt":"2026-04-29T00:00:00.000Z","latencyMs":0,"toolCallCount":0,"inputTokens":1,"outputTokens":0,"cacheReadTokens":0,"cacheWriteTokens":0}]]
Shrunk 13 time(s)

Hint: Enable verbose mode in order to have the list of all failing val

[Killed] ArithmeticOperator
src/app/pipeline.ts:127:21
     (acc, t) => ({
       toolCallCount: acc.toolCallCount + t.toolCallCount,
       inputTokens: acc.inputTokens + t.inputTokens,
-      outputTokens: acc.outputTokens + t.outputTokens,
+      outputTokens: acc.outputTokens - t.outputTokens,
       cacheReadTokens: acc.cacheReadTokens + t.cacheReadTokens,
       cacheWriteTokens: acc.cacheWriteTokens + t.cacheWriteTokens,
killedBy: sumTurns (PBT) each field is the field-wise sum across all input turns
statusReason: Property failed after 1 tests
{ seed: -1048580699, path: "0:1:0:1:1:1:1:1:1:2:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:2:2", endOnFailure: true }
Counterexample: [[{"index":0,"prompt":"","response":"","startedAt":"2026-04-29T00:00:00.000Z","latencyMs":0,"toolCallCount":0,"inputTokens":0,"outputTokens":1,"cacheReadTokens":0,"cacheWriteTokens":0}]]
Shrunk 28 time(s)

Hint: Enable verbose mode in order to h

[Killed] ArithmeticOperator
src/app/pipeline.ts:128:24
       toolCallCount: acc.toolCallCount + t.toolCallCount,
       inputTokens: acc.inputTokens + t.inputTokens,
       outputTokens: acc.outputTokens + t.outputTokens,
-      cacheReadTokens: acc.cacheReadTokens + t.cacheReadTokens,
+      cacheReadTokens: acc.cacheReadTokens - t.cacheReadTokens,
       cacheWriteTokens: acc.cacheWriteTokens + t.cacheWriteTokens,
     }),
killedBy: sumTurns (PBT) each field is the field-wise sum across all input turns
statusReason: Property failed after 1 tests
{ seed: 1991020353, path: "0:1:0:0:1:1:1:1:1:1:1:2:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:2", endOnFailure: true }
Counterexample: [[{"index":0,"prompt":"","response":"","startedAt":"2026-04-29T00:00:00.000Z","latencyMs":0,"toolCallCount":0,"inputTokens":0,"outputTokens":0,"cacheReadTokens":1,"cacheWriteTokens":0}]]
Shrunk 27 time(s)

Hint: Enable verbose mode in order to have

[Killed] ArithmeticOperator
src/app/pipeline.ts:129:25
       inputTokens: acc.inputTokens + t.inputTokens,
       outputTokens: acc.outputTokens + t.outputTokens,
       cacheReadTokens: acc.cacheReadTokens + t.cacheReadTokens,
-      cacheWriteTokens: acc.cacheWriteTokens + t.cacheWriteTokens,
+      cacheWriteTokens: acc.cacheWriteTokens - t.cacheWriteTokens,
     }),
     ZERO_TURN_AGGREGATE,
killedBy: sumTurns (PBT) each field is the field-wise sum across all input turns
statusReason: Property failed after 1 tests
{ seed: -252498958, path: "0:1:0:1:1:1:1:1:1:1:1:2:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:2", endOnFailure: true }
Counterexample: [[{"index":0,"prompt":"","response":"","startedAt":"2026-04-29T00:00:00.000Z","latencyMs":0,"toolCallCount":0,"inputTokens":0,"outputTokens":0,"cacheReadTokens":0,"cacheWriteTokens":1}]]
Shrunk 31 time(s)

Hint: Enable verbose mode in order

[Killed] EqualityOperator
src/app/pipeline.ts:143:43
 /** @internal — exported for direct property-based testing. */
 export function bundleModelName(bundle: JudgmentBundle): string {
   const modelName = bundle.metadata?.["modelName"];
-  return typeof modelName === "string" && modelName.length > 0
+  return typeof modelName === "string" && modelName.length <= 0
     ? modelName
     : `${bundle.project}/bundle`;
killedBy: bundleModelName (PBT) returns the metadata.modelName string when present and non-empty
statusReason: Property failed after 1 tests
{ seed: 540777456, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/app/pipeline.ts:143:43
 /** @internal — exported for direct property-based testing. */
 export function bundleModelName(bundle: JudgmentBundle): string {
   const modelName = bundle.metadata?.["modelName"];
-  return typeof modelName === "string" && modelName.length > 0
+  return typeof modelName === "string" && true
     ? modelName
     : `${bundle.project}/bundle`;
killedBy: bundleModelName (PBT) falls back to `${project}/bundle` when metadata.modelName is missing, empty, or non-string
statusReason: Property failed after 4 tests
{ seed: -1939373764, path: "3", endOnFailure: true }
Counterexample: [{"modelName":""}]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] StringLiteral
src/app/pipeline.ts:176:21
     outputTokens: agg.outputTokens,
     cacheReadTokens: agg.cacheReadTokens,
     cacheWriteTokens: agg.cacheWriteTokens,
-    transcriptPath: "",
+    transcriptPath: "Stryker was here!",
     workspaceDiffSummary: summary,
     ...(params.judge.failureKind !== undefined ? { failureKind: params.judge.failureKind } : {}),

[Survived] ConditionalExpression
src/app/pipeline.ts:178:9
     cacheWriteTokens: agg.cacheWriteTokens,
     transcriptPath: "",
     workspaceDiffSummary: summary,
-    ...(params.judge.failureKind !== undefined ? { failureKind: params.judge.failureKind } : {}),
+    ...(false ? { failureKind: params.judge.failureKind } : {}),
   };
 }

[Survived] EqualityOperator
src/app/pipeline.ts:178:9
     cacheWriteTokens: agg.cacheWriteTokens,
     transcriptPath: "",
     workspaceDiffSummary: summary,
-    ...(params.judge.failureKind !== undefined ? { failureKind: params.judge.failureKind } : {}),
+    ...(params.judge.failureKind === undefined ? { failureKind: params.judge.failureKind } : {}),
   };
 }

[Killed] MethodExpression
src/app/pipeline.ts:184:18
 
 /** @internal — exported for direct property-based testing. */
 export function buildReport(runs: ReadonlyArray<RunRecord>, artifactsDir: string | undefined): Report {
-  const passed = runs.filter((r) => r.pass).length;
+  const passed = runs.length;
   const latencyTotal = runs.reduce((sum, r) => sum + r.latencyMs, 0);
   const total = runs.length;
killedBy: buildReport (PBT) passed equals the count of pass=true runs
statusReason: Property failed after 1 tests
{ seed: -1609552985, path: "0:1:1:1:1:1", endOnFailure: true }
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/app/pipeline.ts:184:30
 
 /** @internal — exported for direct property-based testing. */
 export function buildReport(runs: ReadonlyArray<RunRecord>, artifactsDir: string | undefined): Report {
-  const passed = runs.filter((r) => r.pass).length;
+  const passed = runs.filter(() => undefined).length;
   const latencyTotal = runs.reduce((sum, r) => sum + r.latencyMs, 0);
   const total = runs.length;
killedBy: buildReport (PBT) passed equals the count of pass=true runs
statusReason: Property failed after 1 tests
{ seed: 1790473876, path: "0:1:0:0:2:2", endOnFailure: true }
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/app/pipeline.ts:185:48
 /** @internal — exported for direct property-based testing. */
 export function buildReport(runs: ReadonlyArray<RunRecord>, artifactsDir: string | undefined): Report {
   const passed = runs.filter((r) => r.pass).length;
-  const latencyTotal = runs.reduce((sum, r) => sum + r.latencyMs, 0);
+  const latencyTotal = runs.reduce((sum, r) => sum - r.latencyMs, 0);
   const total = runs.length;
   return {
killedBy: buildReport (PBT) avgLatencyMs equals total/count for non-empty input
statusReason: Property failed after 1 tests
{ seed: 355731230, path: "0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Shrunk 21 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/app/pipeline.ts:193:21
       total,
       passed,
       failed: total - passed,
-      avgLatencyMs: total === 0 ? 0 : latencyTotal / total,
+      avgLatencyMs: total !== 0 ? 0 : latencyTotal / total,
     },
     ...(artifactsDir !== undefined ? { artifactsDir } : {}),
killedBy: buildReport (PBT) returns zero summary when runs is empty
statusReason: expected { total: +0, passed: +0, …(2) } to deeply equal { total: +0, passed: +0, …(2) }

[Killed] ArrayDeclaration
src/app/pipeline.ts:213:19
   harness: PlannedRunInput["harness"],
   opts: HarnessRunOpts = {},
 ): Effect.Effect<Report, never, never> {
-  return runPlans([{ plan, harness }], opts);
+  return runPlans([], opts);
 }
 
killedBy: runWithHarness failure folding folds agent-start failure deterministically without invoking the judge
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/app/pipeline.ts:226:13
       const resultsDir = opts.resultsDir ?? "./eval-results";
       const emitter = makeReportEmitter({
         resultsDir,
-        ...(opts.githubComment !== undefined ? { githubComment: opts.githubComment } : {}),
+        ...(true ? { githubComment: opts.githubComment } : {}),
         ...(opts.githubCommentArtifactUrl !== undefined
           ? { githubCommentArtifactUrl: opts.githubCommentArtifactUrl }

[Survived] BooleanLiteral
src/app/pipeline.ts:248:90
       );
       const report = buildReport(records, resultsDir);
       yield* emitter.emitReport(report);
-      yield* Effect.forEach(obs, (observer) => observer.onReport({ report }), { discard: true });
+      yield* Effect.forEach(obs, (observer) => observer.onReport({ report }), { discard: false });
       if (opts.githubComment !== undefined) {
         yield* emitter.publishGithubComment(report).pipe(Effect.catchAll(() => Effect.void));

[NoCoverage] BlockStatement
src/app/pipeline.ts:249:45
       const report = buildReport(records, resultsDir);
       yield* emitter.emitReport(report);
       yield* Effect.forEach(obs, (observer) => observer.onReport({ report }), { discard: true });
-      if (opts.githubComment !== undefined) {
-        yield* emitter.publishGithubComment(report).pipe(Effect.catchAll(() => Effect.void));
-      }
+      if (opts.githubComment !== undefined) {}
       return report;
     }),

[Survived] ConditionalExpression
src/app/pipeline.ts:249:11
       const report = buildReport(records, resultsDir);
       yield* emitter.emitReport(report);
       yield* Effect.forEach(obs, (observer) => observer.onReport({ report }), { discard: true });
-      if (opts.githubComment !== undefined) {
+      if (false) {
         yield* emitter.publishGithubComment(report).pipe(Effect.catchAll(() => Effect.void));
       }

[Survived] ArithmeticOperator
src/app/pipeline.ts:278:17
                 input.plan,
                 error,
                 startedAt,
-                Date.now() - startMs,
+                Date.now() + startMs,
                 abortSignal,
               ),

[Survived] BooleanLiteral
src/app/pipeline.ts:298:85
       }),
     );
     yield* emitter.emitRun(record);
-    yield* Effect.forEach(obs, (observer) => observer.onRun({ record }), { discard: true });
+    yield* Effect.forEach(obs, (observer) => observer.onRun({ record }), { discard: false });
     return record;
   });

[NoCoverage] ObjectLiteral
src/app/pipeline.ts:315:13
         resultsDir,
         ...(opts.githubComment !== undefined ? { githubComment: opts.githubComment } : {}),
         ...(opts.githubCommentArtifactUrl !== undefined
-          ? { githubCommentArtifactUrl: opts.githubCommentArtifactUrl }
+          ? {}
           : {}),
       });

[Survived] ObjectLiteral
src/app/pipeline.ts:323:9
       const records = yield* Effect.forEach(
         bundles,
         (bundle) => scoreOneBundle(bundle, judge, emitter, obs, abortSignal),
-        { concurrency },
+        {},
       );
       const report = buildReport(records, resultsDir);

[Survived] ObjectLiteral
src/app/pipeline.ts:327:79
       );
       const report = buildReport(records, resultsDir);
       yield* emitter.emitReport(report);
-      yield* Effect.forEach(obs, (observer) => observer.onReport({ report }), { discard: true });
+      yield* Effect.forEach(obs, (observer) => observer.onReport({ report }), {});
       if (opts.githubComment !== undefined) {
         yield* emitter.publishGithubComment(report).pipe(Effect.catchAll(() => Effect.void));

[Survived] ConditionalExpression
src/app/pipeline.ts:328:11
       const report = buildReport(records, resultsDir);
       yield* emitter.emitReport(report);
       yield* Effect.forEach(obs, (observer) => observer.onReport({ report }), { discard: true });
-      if (opts.githubComment !== undefined) {
+      if (true) {
         yield* emitter.publishGithubComment(report).pipe(Effect.catchAll(() => Effect.void));
       }

[Survived] ArrayDeclaration
src/app/pipeline.ts:402:15
     description: plan.description,
     requirements: plan.requirements,
     agents: plan.agents.map(agentRefFromDeclaration),
-    outcomes: [...outcomes],
+    outcomes: [],
     metadata: {
       coordinationFailure: error.cause._tag,

[Survived] StringLiteral
src/app/pipeline.ts:405:18
     outcomes: [...outcomes],
     metadata: {
       coordinationFailure: error.cause._tag,
-      modelName: `${plan.project}/coordinator`,
+      modelName: ``,
       failureFold: "deterministic",
     },

[Survived] EqualityOperator
src/app/pipeline.ts:417:27
   endedAt: string,
   abortSignal: AbortSignal | undefined,
 ): ReadonlyArray<JudgmentBundle["outcomes"][number]> {
-  const cancelledReason = abortSignal?.aborted === true
+  const cancelledReason = abortSignal?.aborted !== true
     ? "run cancelled via abort signal"
     : "run cancelled after another agent failed";

[Survived] BooleanLiteral
src/app/pipeline.ts:417:52
   endedAt: string,
   abortSignal: AbortSignal | undefined,
 ): ReadonlyArray<JudgmentBundle["outcomes"][number]> {
-  const cancelledReason = abortSignal?.aborted === true
+  const cancelledReason = abortSignal?.aborted === false
     ? "run cancelled via abort signal"
     : "run cancelled after another agent failed";

[Survived] StringLiteral
src/app/pipeline.ts:418:7
   abortSignal: AbortSignal | undefined,
 ): ReadonlyArray<JudgmentBundle["outcomes"][number]> {
   const cancelledReason = abortSignal?.aborted === true
-    ? "run cancelled via abort signal"
+    ? ""
     : "run cancelled after another agent failed";
   const cause = error.cause;

[Survived] StringLiteral
src/app/pipeline.ts:419:7
 ): ReadonlyArray<JudgmentBundle["outcomes"][number]> {
   const cancelledReason = abortSignal?.aborted === true
     ? "run cancelled via abort signal"
-    : "run cancelled after another agent failed";
+    : "";
   const cause = error.cause;
   switch (cause._tag) {

[Killed] ConditionalExpression
src/app/pipeline.ts:424:9
   switch (cause._tag) {
     case "AgentStartFailed":
       return plan.agents.map((agent) =>
-        agent.id === cause.agentId
+        true
           ? {
               agentId: agent.id,
killedBy: runWithHarness failure folding folds agent-start failure deterministically without invoking the judge
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:424:9
   switch (cause._tag) {
     case "AgentStartFailed":
       return plan.agents.map((agent) =>
-        agent.id === cause.agentId
+        agent.id !== cause.agentId
           ? {
               agentId: agent.id,
killedBy: runWithHarness failure folding folds agent-start failure deterministically without invoking the judge
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:440:17
     case "HarnessFailed":
       return plan.agents.map((agent) => ({
         agentId: agent.id,
-        status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
+        status: abortSignal?.aborted !== true ? "cancelled" as const : "runtime_error" as const,
         endedAt,
         reason: abortSignal?.aborted === true ? cancelledReason : renderHarnessFailureCause(cause.detail),
killedBy: runWithHarness failure folding preserves cancelled status when the run is aborted
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/app/pipeline.ts:440:42
     case "HarnessFailed":
       return plan.agents.map((agent) => ({
         agentId: agent.id,
-        status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
+        status: abortSignal?.aborted === false ? "cancelled" as const : "runtime_error" as const,
         endedAt,
         reason: abortSignal?.aborted === true ? cancelledReason : renderHarnessFailureCause(cause.detail),
killedBy: runWithHarness failure folding preserves cancelled status when the run is aborted
statusReason: StrykerJS: Unknown test failure

[Survived] EqualityOperator
src/app/pipeline.ts:442:17
         agentId: agent.id,
         status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
         endedAt,
-        reason: abortSignal?.aborted === true ? cancelledReason : renderHarnessFailureCause(cause.detail),
+        reason: abortSignal?.aborted !== true ? cancelledReason : renderHarnessFailureCause(cause.detail),
       }));
     case "BundleBuildFailed":

[Survived] BooleanLiteral
src/app/pipeline.ts:442:42
         agentId: agent.id,
         status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
         endedAt,
-        reason: abortSignal?.aborted === true ? cancelledReason : renderHarnessFailureCause(cause.detail),
+        reason: abortSignal?.aborted === false ? cancelledReason : renderHarnessFailureCause(cause.detail),
       }));
     case "BundleBuildFailed":

[NoCoverage] ConditionalExpression
src/app/pipeline.ts:444:5
         endedAt,
         reason: abortSignal?.aborted === true ? cancelledReason : renderHarnessFailureCause(cause.detail),
       }));
-    case "BundleBuildFailed":
-      return plan.agents.map((agent) => ({
-        agentId: agent.id,
-        status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
-        endedAt,
-        reason: abortSignal?.aborted === true ? cancelledReason : renderBundleBuildFailureCause(cause.detail),
-      }));
+    case "BundleBuildFailed":
     default:
       return plan.agents.map((agent) => ({

[NoCoverage] ConditionalExpression
src/app/pipeline.ts:447:17
     case "BundleBuildFailed":
       return plan.agents.map((agent) => ({
         agentId: agent.id,
-        status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
+        status: false ? "cancelled" as const : "runtime_error" as const,
         endedAt,
         reason: abortSignal?.aborted === true ? cancelledReason : renderBundleBuildFailureCause(cause.detail),

[NoCoverage] EqualityOperator
src/app/pipeline.ts:449:17
         agentId: agent.id,
         status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
         endedAt,
-        reason: abortSignal?.aborted === true ? cancelledReason : renderBundleBuildFailureCause(cause.detail),
+        reason: abortSignal?.aborted !== true ? cancelledReason : renderBundleBuildFailureCause(cause.detail),
       }));
     default:

[NoCoverage] ConditionalExpression
src/app/pipeline.ts:449:17
         agentId: agent.id,
         status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
         endedAt,
-        reason: abortSignal?.aborted === true ? cancelledReason : renderBundleBuildFailureCause(cause.detail),
+        reason: false ? cancelledReason : renderBundleBuildFailureCause(cause.detail),
       }));
     default:

[NoCoverage] ConditionalExpression
src/app/pipeline.ts:454:17
     default:
       return plan.agents.map((agent) => ({
         agentId: agent.id,
-        status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
+        status: true ? "cancelled" as const : "runtime_error" as const,
         endedAt,
         reason: abortSignal?.aborted === true

[NoCoverage] BooleanLiteral
src/app/pipeline.ts:456:42
         agentId: agent.id,
         status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
         endedAt,
-        reason: abortSignal?.aborted === true
+        reason: abortSignal?.aborted === false
           ? cancelledReason
           : renderUnknownCoordinationFailure(cause),

[NoCoverage] EqualityOperator
src/app/pipeline.ts:456:17
         agentId: agent.id,
         status: abortSignal?.aborted === true ? "cancelled" as const : "runtime_error" as const,
         endedAt,
-        reason: abortSignal?.aborted === true
+        reason: abortSignal?.aborted !== true
           ? cancelledReason
           : renderUnknownCoordinationFailure(cause),
