[Survived] ConditionalExpression
src/app/pipeline.ts:467:51
   outcomes: ReadonlyArray<JudgmentBundle["outcomes"][number]>,
 ): JudgeResult {
   const issues = outcomes.map((outcome) => ({
-    issue: `${outcome.agentId} ${outcome.status}${outcome.reason !== undefined ? `: ${outcome.reason}` : ""}`,
+    issue: `${outcome.agentId} ${outcome.status}${false ? `: ${outcome.reason}` : ""}`,
     severity: "critical" as const,
   }));

[Survived] EqualityOperator
src/app/pipeline.ts:467:51
   outcomes: ReadonlyArray<JudgmentBundle["outcomes"][number]>,
 ): JudgeResult {
   const issues = outcomes.map((outcome) => ({
-    issue: `${outcome.agentId} ${outcome.status}${outcome.reason !== undefined ? `: ${outcome.reason}` : ""}`,
+    issue: `${outcome.agentId} ${outcome.status}${outcome.reason === undefined ? `: ${outcome.reason}` : ""}`,
     severity: "critical" as const,
   }));

[Killed] ArrowFunction
src/app/pipeline.ts:472:48
   }));
   return {
     pass: false,
-    reason: `coordination failed: ${issues.map((issue) => issue.issue).join("; ")}`,
+    reason: `coordination failed: ${issues.map(() => undefined).join("; ")}`,
     issues,
     overallSeverity: "critical",
killedBy: runWithHarness failure folding folds agent-start failure deterministically without invoking the judge
statusReason: StrykerJS: Unknown test failure

[NoCoverage] ConditionalExpression
src/app/pipeline.ts:483:10
   cause: RunCoordinationError["cause"],
 ): string {
   const detail = JSON.stringify(cause);
-  return detail === undefined
+  return false
     ? "unexpected coordination failure"
     : `unexpected coordination failure: ${detail}`;

[NoCoverage] EqualityOperator
src/app/pipeline.ts:483:10
   cause: RunCoordinationError["cause"],
 ): string {
   const detail = JSON.stringify(cause);
-  return detail === undefined
+  return detail !== undefined
     ? "unexpected coordination failure"
     : `unexpected coordination failure: ${detail}`;

[NoCoverage] StringLiteral
src/app/pipeline.ts:484:7
 ): string {
   const detail = JSON.stringify(cause);
   return detail === undefined
-    ? "unexpected coordination failure"
+    ? ""
     : `unexpected coordination failure: ${detail}`;
 }

[NoCoverage] StringLiteral
src/app/pipeline.ts:485:7
   const detail = JSON.stringify(cause);
   return detail === undefined
     ? "unexpected coordination failure"
-    : `unexpected coordination failure: ${detail}`;
+    : ``;
 }
 

[Killed] StringLiteral
src/app/pipeline.ts:494:14
     case "BuildContextMissing":
       return `build context missing at ${cause.path}`;
     case "DockerBuildFailed":
-      return `docker build failed: ${cause.message}`;
+      return ``;
     case "ImageMissing":
       return `image missing: ${cause.image}`;
killedBy: renderAgentStartCause (example, all branches) renders { _tag: 'DockerBuildFailed', message: 'boom' } containing boom
statusReason: expected '' to contain 'boom'

[Killed] ConditionalExpression
src/app/pipeline.ts:497:5
       return `docker build failed: ${cause.message}`;
     case "ImageMissing":
       return `image missing: ${cause.image}`;
-    case "ImagePullFailed":
-      return `image pull failed for ${cause.image}: ${cause.message}`;
+    case "ImagePullFailed":
     case "ContainerStartFailed":
       return `container start failed: ${cause.message}`;
killedBy: renderAgentStartCause (example, all branches) renders { _tag: 'ImagePullFailed', image: 'img:1', message: 'rate' } containing img:1
statusReason: expected 'container start failed: rate' to contain 'img:1'

[Killed] StringLiteral
src/app/pipeline.ts:498:14
     case "ImageMissing":
       return `image missing: ${cause.image}`;
     case "ImagePullFailed":
-      return `image pull failed for ${cause.image}: ${cause.message}`;
+      return ``;
     case "ContainerStartFailed":
       return `container start failed: ${cause.message}`;
killedBy: renderAgentStartCause (example, all branches) renders { _tag: 'ImagePullFailed', image: 'img:1', message: 'rate' } containing img:1
statusReason: expected '' to contain 'img:1'

[Killed] StringLiteral
src/app/pipeline.ts:500:14
     case "ImagePullFailed":
       return `image pull failed for ${cause.image}: ${cause.message}`;
     case "ContainerStartFailed":
-      return `container start failed: ${cause.message}`;
+      return ``;
     case "BinaryNotFound":
       return `binary not found: ${cause.path}`;
killedBy: renderAgentStartCause (example, all branches) renders { _tag: 'ContainerStartFailed', message: 'nope' } containing nope
statusReason: expected '' to contain 'nope'

[Survived] ConditionalExpression
src/app/pipeline.ts:515:5
   switch (cause._tag) {
     case "MissingRuntimeHandle":
       return `missing runtime handle for ${cause.agentId}`;
-    case "InvalidPlanMetadata":
-      return cause.message;
+    case "InvalidPlanMetadata":
     case "ExecutionFailed":
       return cause.message;

[Killed] StringLiteral
src/app/pipeline.ts:528:14
     case "DuplicateOutcome":
       return `duplicate outcome emitted for ${cause.agentId}`;
     case "MissingOutcomes":
-      return `missing outcomes for ${cause.agentIds.join(", ")}`;
+      return ``;
     case "UnknownAgent":
       return `unknown agent ${cause.agentId}`;
killedBy: renderBundleBuildFailureCause (example, all branches) renders { _tag: 'MissingOutcomes', agentIds: [ 'a', 'b' ] } containing a, b
statusReason: expected '' to contain 'a, b'

[Killed] StringLiteral
src/app/pipeline.ts:530:14
     case "MissingOutcomes":
       return `missing outcomes for ${cause.agentIds.join(", ")}`;
     case "UnknownAgent":
-      return `unknown agent ${cause.agentId}`;
+      return ``;
     case "EventOrderViolation":
       return `event order violated: ${String(cause.previousTs)} before ${String(cause.nextTs)}`;
killedBy: renderBundleBuildFailureCause (example, all branches) renders { _tag: 'UnknownAgent', agentId: 'a1' } containing a1
statusReason: expected '' to contain 'a1'
