[Survived] ConditionalExpression
src/core/types.ts:197:9
   return {
     id: agent.id,
     name: agent.name,
-    ...(agent.role !== undefined ? { role: agent.role } : {}),
+    ...(false ? { role: agent.role } : {}),
     ...(agent.metadata !== undefined ? { metadata: agent.metadata } : {}),
   };

[Survived] EqualityOperator
src/core/types.ts:197:9
   return {
     id: agent.id,
     name: agent.name,
-    ...(agent.role !== undefined ? { role: agent.role } : {}),
+    ...(agent.role === undefined ? { role: agent.role } : {}),
     ...(agent.metadata !== undefined ? { metadata: agent.metadata } : {}),
   };

[Survived] ConditionalExpression
src/core/types.ts:198:9
     id: agent.id,
     name: agent.name,
     ...(agent.role !== undefined ? { role: agent.role } : {}),
-    ...(agent.metadata !== undefined ? { metadata: agent.metadata } : {}),
+    ...(true ? { metadata: agent.metadata } : {}),
   };
 }

[Survived] EqualityOperator
src/core/types.ts:198:9
     id: agent.id,
     name: agent.name,
     ...(agent.role !== undefined ? { role: agent.role } : {}),
-    ...(agent.metadata !== undefined ? { metadata: agent.metadata } : {}),
+    ...(agent.metadata === undefined ? { metadata: agent.metadata } : {}),
   };
 }
