[Killed] BlockStatement
src/emit/bundle-codec.ts:25:26
 
 function decodeFromParsed(parsed: unknown, originPath: string): Effect.Effect<JudgmentBundleType, BundleDecodeError, never> {
   const errors = formatSchemaErrors(Value.Errors(JudgmentBundleSchema, parsed));
-  if (errors.length > 0) {
-    return Effect.fail(
-      new BundleDecodeError({
-        cause: BundleDecodeCause.SchemaInvalid({
-          path: originPath,
-          errors,
-        }),
-      }),
-    );
-  }
+  if (errors.length > 0) {}
   const decoded = Value.Decode(JudgmentBundleSchema, parsed);
   return Effect.succeed(normalizeBundle(decoded));
killedBy: bundleAutoCodec dispatch (example-based, mutation killer) auto: dispatches to JSON when input starts with [
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/bundle-codec.ts:25:7
 
 function decodeFromParsed(parsed: unknown, originPath: string): Effect.Effect<JudgmentBundleType, BundleDecodeError, never> {
   const errors = formatSchemaErrors(Value.Errors(JudgmentBundleSchema, parsed));
-  if (errors.length > 0) {
+  if (false) {
     return Effect.fail(
       new BundleDecodeError({
killedBy: bundleAutoCodec dispatch (example-based, mutation killer) auto: dispatches to JSON when input starts with [
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/emit/bundle-codec.ts:49:9
     requirements: decoded.requirements,
     agents: decoded.agents.map(normalizeAgentRef),
     ...(decoded.turns !== undefined ? { turns: decoded.turns.map(normalizeTurn) } : {}),
-    ...(decoded.events !== undefined ? { events: decoded.events } : {}),
+    ...(false ? { events: decoded.events } : {}),
     ...(decoded.phases !== undefined ? { phases: decoded.phases } : {}),
     ...(decoded.context !== undefined ? { context: decoded.context } : {}),

[Survived] ConditionalExpression
src/emit/bundle-codec.ts:49:9
     requirements: decoded.requirements,
     agents: decoded.agents.map(normalizeAgentRef),
     ...(decoded.turns !== undefined ? { turns: decoded.turns.map(normalizeTurn) } : {}),
-    ...(decoded.events !== undefined ? { events: decoded.events } : {}),
+    ...(true ? { events: decoded.events } : {}),
     ...(decoded.phases !== undefined ? { phases: decoded.phases } : {}),
     ...(decoded.context !== undefined ? { context: decoded.context } : {}),

[Survived] ConditionalExpression
src/emit/bundle-codec.ts:50:9
     agents: decoded.agents.map(normalizeAgentRef),
     ...(decoded.turns !== undefined ? { turns: decoded.turns.map(normalizeTurn) } : {}),
     ...(decoded.events !== undefined ? { events: decoded.events } : {}),
-    ...(decoded.phases !== undefined ? { phases: decoded.phases } : {}),
+    ...(false ? { phases: decoded.phases } : {}),
     ...(decoded.context !== undefined ? { context: decoded.context } : {}),
     ...(decoded.workspaceDiff !== undefined ? { workspaceDiff: decoded.workspaceDiff } : {}),

[Survived] ConditionalExpression
src/emit/bundle-codec.ts:50:9
     agents: decoded.agents.map(normalizeAgentRef),
     ...(decoded.turns !== undefined ? { turns: decoded.turns.map(normalizeTurn) } : {}),
     ...(decoded.events !== undefined ? { events: decoded.events } : {}),
-    ...(decoded.phases !== undefined ? { phases: decoded.phases } : {}),
+    ...(true ? { phases: decoded.phases } : {}),
     ...(decoded.context !== undefined ? { context: decoded.context } : {}),
     ...(decoded.workspaceDiff !== undefined ? { workspaceDiff: decoded.workspaceDiff } : {}),

[Survived] ConditionalExpression
src/emit/bundle-codec.ts:51:9
     ...(decoded.turns !== undefined ? { turns: decoded.turns.map(normalizeTurn) } : {}),
     ...(decoded.events !== undefined ? { events: decoded.events } : {}),
     ...(decoded.phases !== undefined ? { phases: decoded.phases } : {}),
-    ...(decoded.context !== undefined ? { context: decoded.context } : {}),
+    ...(false ? { context: decoded.context } : {}),
     ...(decoded.workspaceDiff !== undefined ? { workspaceDiff: decoded.workspaceDiff } : {}),
     outcomes: decoded.outcomes.map(normalizeOutcome),

[Survived] EqualityOperator
src/emit/bundle-codec.ts:51:9
     ...(decoded.turns !== undefined ? { turns: decoded.turns.map(normalizeTurn) } : {}),
     ...(decoded.events !== undefined ? { events: decoded.events } : {}),
     ...(decoded.phases !== undefined ? { phases: decoded.phases } : {}),
-    ...(decoded.context !== undefined ? { context: decoded.context } : {}),
+    ...(decoded.context === undefined ? { context: decoded.context } : {}),
     ...(decoded.workspaceDiff !== undefined ? { workspaceDiff: decoded.workspaceDiff } : {}),
     outcomes: decoded.outcomes.map(normalizeOutcome),

[Survived] EqualityOperator
src/emit/bundle-codec.ts:52:9
     ...(decoded.events !== undefined ? { events: decoded.events } : {}),
     ...(decoded.phases !== undefined ? { phases: decoded.phases } : {}),
     ...(decoded.context !== undefined ? { context: decoded.context } : {}),
-    ...(decoded.workspaceDiff !== undefined ? { workspaceDiff: decoded.workspaceDiff } : {}),
+    ...(decoded.workspaceDiff === undefined ? { workspaceDiff: decoded.workspaceDiff } : {}),
     outcomes: decoded.outcomes.map(normalizeOutcome),
     ...(decoded.metadata !== undefined ? { metadata: decoded.metadata } : {}),

[Survived] ConditionalExpression
src/emit/bundle-codec.ts:52:9
     ...(decoded.events !== undefined ? { events: decoded.events } : {}),
     ...(decoded.phases !== undefined ? { phases: decoded.phases } : {}),
     ...(decoded.context !== undefined ? { context: decoded.context } : {}),
-    ...(decoded.workspaceDiff !== undefined ? { workspaceDiff: decoded.workspaceDiff } : {}),
+    ...(false ? { workspaceDiff: decoded.workspaceDiff } : {}),
     outcomes: decoded.outcomes.map(normalizeOutcome),
     ...(decoded.metadata !== undefined ? { metadata: decoded.metadata } : {}),

[Survived] ConditionalExpression
src/emit/bundle-codec.ts:54:9
     ...(decoded.context !== undefined ? { context: decoded.context } : {}),
     ...(decoded.workspaceDiff !== undefined ? { workspaceDiff: decoded.workspaceDiff } : {}),
     outcomes: decoded.outcomes.map(normalizeOutcome),
-    ...(decoded.metadata !== undefined ? { metadata: decoded.metadata } : {}),
+    ...(true ? { metadata: decoded.metadata } : {}),
   };
 }

[Survived] ConditionalExpression
src/emit/bundle-codec.ts:54:9
     ...(decoded.context !== undefined ? { context: decoded.context } : {}),
     ...(decoded.workspaceDiff !== undefined ? { workspaceDiff: decoded.workspaceDiff } : {}),
     outcomes: decoded.outcomes.map(normalizeOutcome),
-    ...(decoded.metadata !== undefined ? { metadata: decoded.metadata } : {}),
+    ...(false ? { metadata: decoded.metadata } : {}),
   };
 }

[Killed] ArrowFunction
src/emit/bundle-codec.ts:78:10
 
 function decodeJson(source: string, originPath: string): Effect.Effect<JudgmentBundleType, BundleDecodeError, never> {
   return Effect.try({
-    try: () => JSON.parse(source),
+    try: () => undefined,
     catch: (error) =>
       new BundleDecodeError({
killedBy: BundleCodec round-trip (PBT) json: encode → decode preserves all structural fields
statusReason: StrykerJS: Unknown test failure

[Killed] ArrowFunction
src/emit/bundle-codec.ts:91:10
 
 function decodeYaml(source: string, originPath: string): Effect.Effect<JudgmentBundleType, BundleDecodeError, never> {
   return Effect.try({
-    try: () => YAML.parse(source),
+    try: () => undefined,
     catch: (error) =>
       new BundleDecodeError({
killedBy: BundleCodec round-trip (PBT) yaml: encode → decode preserves all structural fields
statusReason: StrykerJS: Unknown test failure

[NoCoverage] ArrayDeclaration
src/emit/bundle-codec.ts:96:19
       new BundleDecodeError({
         cause: BundleDecodeCause.SchemaInvalid({
           path: originPath,
-          errors: [error instanceof Error ? error.message : String(error)],
+          errors: [],
         }),
       }),

[Survived] MethodExpression
src/emit/bundle-codec.ts:126:21
   name: "auto",
   encode: encodeJson,
   decode(source, originPath) {
-    const trimmed = source.trimStart();
+    const trimmed = source.trimEnd();
     if (trimmed.startsWith("{") || trimmed.startsWith("[")) {
       return decodeJson(source, originPath);

[Killed] ConditionalExpression
src/emit/bundle-codec.ts:127:9
   encode: encodeJson,
   decode(source, originPath) {
     const trimmed = source.trimStart();
-    if (trimmed.startsWith("{") || trimmed.startsWith("[")) {
+    if (true) {
       return decodeJson(source, originPath);
     }
killedBy: bundleAutoCodec dispatch (example-based, mutation killer) auto: dispatches to YAML when input does not start with { or [
statusReason: StrykerJS: Unknown test failure

[Survived] BlockStatement
src/emit/bundle-codec.ts:127:61
   encode: encodeJson,
   decode(source, originPath) {
     const trimmed = source.trimStart();
-    if (trimmed.startsWith("{") || trimmed.startsWith("[")) {
-      return decodeJson(source, originPath);
-    }
+    if (trimmed.startsWith("{") || trimmed.startsWith("[")) {}
     return decodeYaml(source, originPath);
   },
