[NoCoverage] BlockStatement
src/emit/observability.ts:54:11
 
   onRun(event: ObservabilityEvent): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
-      try {
-        const logger = this.#ensureLogger();
-        logger.log({
-          input: { scenarioId: event.record.scenarioId, source: event.record.source },
-          output: { pass: event.record.pass, reason: event.record.reason },
-          scores: { pass: event.record.pass ? 1 : 0 },
-          metadata: {
-            runNumber: event.record.runNumber,
-            modelName: event.record.modelName,
-            judgeModel: event.record.judgeModel,
-            latencyMs: event.record.latencyMs,
-            retryCount: event.record.retryCount,
-            toolCallCount: event.record.toolCallCount,
-            inputTokens: event.record.inputTokens,
-            outputTokens: event.record.outputTokens,
-            overallSeverity: event.record.overallSeverity ?? "none",
-            ...(event.record.failureKind !== undefined && event.record.failureKind !== null
-              ? { failureKind: event.record.failureKind }
-              : {}),
-          },
-        });
-      } catch (err) {
+      try {} catch (err) {
         void err;
         // Invariant #12: observability never affects verdict. Drop and move on.

[NoCoverage] ObjectLiteral
src/emit/observability.ts:56:20
     return Effect.sync(() => {
       try {
         const logger = this.#ensureLogger();
-        logger.log({
-          input: { scenarioId: event.record.scenarioId, source: event.record.source },
-          output: { pass: event.record.pass, reason: event.record.reason },
-          scores: { pass: event.record.pass ? 1 : 0 },
-          metadata: {
-            runNumber: event.record.runNumber,
-            modelName: event.record.modelName,
-            judgeModel: event.record.judgeModel,
-            latencyMs: event.record.latencyMs,
-            retryCount: event.record.retryCount,
-            toolCallCount: event.record.toolCallCount,
-            inputTokens: event.record.inputTokens,
-            outputTokens: event.record.outputTokens,
-            overallSeverity: event.record.overallSeverity ?? "none",
-            ...(event.record.failureKind !== undefined && event.record.failureKind !== null
-              ? { failureKind: event.record.failureKind }
-              : {}),
-          },
-        });
+        logger.log({});
       } catch (err) {
         void err;

[NoCoverage] ConditionalExpression
src/emit/observability.ts:70:17
             inputTokens: event.record.inputTokens,
             outputTokens: event.record.outputTokens,
             overallSeverity: event.record.overallSeverity ?? "none",
-            ...(event.record.failureKind !== undefined && event.record.failureKind !== null
+            ...(false
               ? { failureKind: event.record.failureKind }
               : {}),

[NoCoverage] EqualityOperator
src/emit/observability.ts:70:59
             inputTokens: event.record.inputTokens,
             outputTokens: event.record.outputTokens,
             overallSeverity: event.record.overallSeverity ?? "none",
-            ...(event.record.failureKind !== undefined && event.record.failureKind !== null
+            ...(event.record.failureKind !== undefined && event.record.failureKind === null
               ? { failureKind: event.record.failureKind }
               : {}),

[NoCoverage] ObjectLiteral
src/emit/observability.ts:71:17
             outputTokens: event.record.outputTokens,
             overallSeverity: event.record.overallSeverity ?? "none",
             ...(event.record.failureKind !== undefined && event.record.failureKind !== null
-              ? { failureKind: event.record.failureKind }
+              ? {}
               : {}),
           },
