[Killed] StringLiteral
src/emit/report.ts:139:43
 export function makeReportEmitter(opts: ReportEmitterOpts): ReportEmitter {
   const resultsDir = path.resolve(opts.resultsDir);
   const detailsDir = path.join(resultsDir, "details");
-  const jsonlPath = path.join(resultsDir, "results.jsonl");
+  const jsonlPath = path.join(resultsDir, "");
   const summaryPath = path.join(resultsDir, "summary.md");
 
killedBy: ReportEmitter writes results.jsonl + summary.md + details/*.yaml
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/report.ts:165:36
           // emitRun path is best-effort; the report is the canonical form.
           if (existsSync(jsonlPath)) unlinkSync(jsonlPath);
           const jsonl = report.runs.map((r) => JSON.stringify(r)).join("\n");
-          writeFileSync(jsonlPath, jsonl.length > 0 ? `${jsonl}\n` : "", "utf8");
+          writeFileSync(jsonlPath, true ? `${jsonl}\n` : "", "utf8");
           writeFileSync(summaryPath, renderSummary(report), "utf8");
           ensureDir(detailsDir);
killedBy: ReportEmitter emitReport writes empty string to jsonl for zero runs
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/emit/report.ts:165:36
           // emitRun path is best-effort; the report is the canonical form.
           if (existsSync(jsonlPath)) unlinkSync(jsonlPath);
           const jsonl = report.runs.map((r) => JSON.stringify(r)).join("\n");
-          writeFileSync(jsonlPath, jsonl.length > 0 ? `${jsonl}\n` : "", "utf8");
+          writeFileSync(jsonlPath, jsonl.length <= 0 ? `${jsonl}\n` : "", "utf8");
           writeFileSync(summaryPath, renderSummary(report), "utf8");
           ensureDir(detailsDir);
killedBy: ReportEmitter writes results.jsonl + summary.md + details/*.yaml
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/report.ts:189:57
 
 // Helper: read an existing jsonl back into RunRecord[] for report consumers.
 export function readRunsJsonl(resultsDir: string): ReadonlyArray<RunRecord> {
-  const jsonlPath = path.join(path.resolve(resultsDir), "results.jsonl");
+  const jsonlPath = path.join(path.resolve(resultsDir), "");
   if (!existsSync(jsonlPath)) return [];
   const raw = readFileSync(jsonlPath, "utf8");
killedBy: ReportEmitter readRunsJsonl round-trips
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/report.ts:190:7
 // Helper: read an existing jsonl back into RunRecord[] for report consumers.
 export function readRunsJsonl(resultsDir: string): ReadonlyArray<RunRecord> {
   const jsonlPath = path.join(path.resolve(resultsDir), "results.jsonl");
-  if (!existsSync(jsonlPath)) return [];
+  if (true) return [];
   const raw = readFileSync(jsonlPath, "utf8");
   const out: RunRecord[] = [];
killedBy: ReportEmitter readRunsJsonl round-trips
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/report.ts:193:39
   if (!existsSync(jsonlPath)) return [];
   const raw = readFileSync(jsonlPath, "utf8");
   const out: RunRecord[] = [];
-  for (const line of raw.split("\n")) {
-    const trimmed = line.trim();
-    if (trimmed.length === 0) continue;
-    let parsed: unknown;
-    try {
-      parsed = JSON.parse(trimmed);
-    } catch (err) {
-      void err;
-      // Skip malformed line; inflight-crash recovery is best-effort.
-      continue;
-    }
-    if (!Value.Check(RunRecordSchema, parsed)) continue;
-    const decoded = Value.Decode(RunRecordSchema, parsed);
-    const { scenarioId: rawScenarioId, runNumber: rawRunNumber, ...rest } = decoded;
-    const record: RunRecord = {
-      ...rest,
-      scenarioId: ScenarioId(rawScenarioId),
-      runNumber: RunNumber(rawRunNumber),
-    };
-    out.push(record);
-  }
+  for (const line of raw.split("\n")) {}
   return out;
 }
killedBy: ReportEmitter readRunsJsonl round-trips
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/report.ts:204:9
       // Skip malformed line; inflight-crash recovery is best-effort.
       continue;
     }
-    if (!Value.Check(RunRecordSchema, parsed)) continue;
+    if (true) continue;
     const decoded = Value.Decode(RunRecordSchema, parsed);
     const { scenarioId: rawScenarioId, runNumber: rawRunNumber, ...rest } = decoded;
killedBy: ReportEmitter readRunsJsonl round-trips
statusReason: StrykerJS: Unknown test failure
