[Killed] StringLiteral
src/emit/wal.ts:176:36
   return {
     resultsDir,
     inflightDir: path.join(resultsDir, "inflight"),
-    runsDir: path.join(resultsDir, "runs"),
+    runsDir: path.join(resultsDir, ""),
   };
 }
killedBy: inspect file resolution labels source as 'completed' when file is in runs/
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/wal.ts:204:9
 export function previewPayload(payload: unknown): string {
   try {
     const serialized = JSON.stringify(payload);
-    if (serialized === undefined) return UNSTRINGIFIABLE_PAYLOAD;
+    if (true) return UNSTRINGIFIABLE_PAYLOAD;
     return serialized.length > PAYLOAD_PREVIEW_MAX_CHARS
       ? `${serialized.slice(0, PAYLOAD_PREVIEW_MAX_CHARS)}…`
killedBy: previewPayload (PBT) appends an ellipsis iff the JSON form exceeds the cap
statusReason: Property failed after 1 tests
{ seed: 648592967, path: "0", endOnFailure: true }
Counterexample: [false]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/emit/wal.ts:204:9
 export function previewPayload(payload: unknown): string {
   try {
     const serialized = JSON.stringify(payload);
-    if (serialized === undefined) return UNSTRINGIFIABLE_PAYLOAD;
+    if (false) return UNSTRINGIFIABLE_PAYLOAD;
     return serialized.length > PAYLOAD_PREVIEW_MAX_CHARS
       ? `${serialized.slice(0, PAYLOAD_PREVIEW_MAX_CHARS)}…`

[Killed] EqualityOperator
src/emit/wal.ts:205:12
   try {
     const serialized = JSON.stringify(payload);
     if (serialized === undefined) return UNSTRINGIFIABLE_PAYLOAD;
-    return serialized.length > PAYLOAD_PREVIEW_MAX_CHARS
+    return serialized.length <= PAYLOAD_PREVIEW_MAX_CHARS
       ? `${serialized.slice(0, PAYLOAD_PREVIEW_MAX_CHARS)}…`
       : serialized;
killedBy: previewPayload (PBT) output length never exceeds the cap plus one ellipsis char
statusReason: Property failed after 14 tests
Counterexample: [{"":[{"":""," ":-100000000000000,"  ":false,"         ":false,"    ":false,"\"     ":-1.0000000291053372e-291}],"  ":[-4.5899529992467876e-297,false,false,"   ",[100000000000000,1000000000000000,null]]}]
Shrunk 218 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/emit/wal.ts:205:12
   try {
     const serialized = JSON.stringify(payload);
     if (serialized === undefined) return UNSTRINGIFIABLE_PAYLOAD;
-    return serialized.length > PAYLOAD_PREVIEW_MAX_CHARS
+    return false
       ? `${serialized.slice(0, PAYLOAD_PREVIEW_MAX_CHARS)}…`
       : serialized;
killedBy: previewPayload (PBT) output length never exceeds the cap plus one ellipsis char
statusReason: Property failed after 1 tests
Counterexample: [{"":[-10000000000000,false,-1000000000000000,false],"  ":[false,false,false,"    ",1.0021358954569382e+153,-1000000000000000,1.3730411336830112e-296,1.2923700420496232e+121],"    \"     ":["         "]}]
Shrunk 296 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/emit/wal.ts:206:12
     const serialized = JSON.stringify(payload);
     if (serialized === undefined) return UNSTRINGIFIABLE_PAYLOAD;
     return serialized.length > PAYLOAD_PREVIEW_MAX_CHARS
-      ? `${serialized.slice(0, PAYLOAD_PREVIEW_MAX_CHARS)}…`
+      ? `${serialized}…`
       : serialized;
   } catch (err) {
killedBy: previewPayload (PBT) output length never exceeds the cap plus one ellipsis char
statusReason: Property failed after 7 tests
Counterexample: [[{"":2.4593248774e-314,"   \"":false,"    ":1.0000023713601872e-260,"   #":-1000000000000000},["          ","    ","  ",-1.1291430435974291e-298,undefined,undefined,false,null,undefined,"         "],1000000000000000]]
Shrunk 308 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/emit/wal.ts:214:88
   }
 }
 
-function walWarn(event: WalWarnEvent, detail: Readonly<Record<string, unknown>>): void {
-  // Single-line JSON for log-aggregator compatibility. `process.stderr`
-  // not `console.warn` so test harnesses that capture `console.*` don't
-  // drown in expected warnings.
-  try {
-    const line = JSON.stringify({
-      level: "warn",
-      source: WAL_WARN_SOURCE,
-      event,
-      ts: Date.now(),
-      ...detail,
-    });
-    process.stderr.write(`${line}\n`);
-  } catch (err) { void err; /* invariant #12: swallow */ }
-}
+function walWarn(event: WalWarnEvent, detail: Readonly<Record<string, unknown>>): void {}
 
 // ---------------------------------------------------------------------------
killedBy: WAL invariant #12 (errors swallowed on hot path) post-close append warning includes runId, kind, and payload preview
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/wal.ts:218:7
   // Single-line JSON for log-aggregator compatibility. `process.stderr`
   // not `console.warn` so test harnesses that capture `console.*` don't
   // drown in expected warnings.
-  try {
-    const line = JSON.stringify({
-      level: "warn",
-      source: WAL_WARN_SOURCE,
-      event,
-      ts: Date.now(),
-      ...detail,
-    });
-    process.stderr.write(`${line}\n`);
-  } catch (err) { void err; /* invariant #12: swallow */ }
+  try {} catch (err) { void err; /* invariant #12: swallow */ }
 }
 
killedBy: WAL invariant #12 (errors swallowed on hot path) post-close append warning includes runId, kind, and payload preview
statusReason: StrykerJS: Unknown test failure

[Survived] StringLiteral
src/emit/wal.ts:220:14
   // drown in expected warnings.
   try {
     const line = JSON.stringify({
-      level: "warn",
+      level: "",
       source: WAL_WARN_SOURCE,
       event,

[NoCoverage] BlockStatement
src/emit/wal.ts:227:17
       ...detail,
     });
     process.stderr.write(`${line}\n`);
-  } catch (err) { void err; /* invariant #12: swallow */ }
+  } catch (err) {}
 }
 

[Killed] StringLiteral
src/emit/wal.ts:241:39
 }
 
 function inflightPathFor(paths: WalPaths, runId: string): string {
-  return path.join(paths.inflightDir, `${runId}.jsonl`);
+  return path.join(paths.inflightDir, ``);
 }
 
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/wal.ts:245:35
 }
 
 function runsPathFor(paths: WalPaths, runId: string): string {
-  return path.join(paths.runsDir, `${runId}.jsonl`);
+  return path.join(paths.runsDir, ``);
 }
 
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/wal.ts:248:48
   return path.join(paths.runsDir, `${runId}.jsonl`);
 }
 
-function ensureDirsSync(paths: WalPaths): void {
-  // mkdirp both siblings. `recursive: true` so pre-existing dirs are a
-  // no-op. Wrapped by the caller in try/catch.
-  fs.mkdirSync(paths.inflightDir, { recursive: true });
-  fs.mkdirSync(paths.runsDir, { recursive: true });
-}
+function ensureDirsSync(paths: WalPaths): void {}
 
 function writeLineSync(file: string, line: WalLine): void {
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/emit/wal.ts:251:48
 function ensureDirsSync(paths: WalPaths): void {
   // mkdirp both siblings. `recursive: true` so pre-existing dirs are a
   // no-op. Wrapped by the caller in try/catch.
-  fs.mkdirSync(paths.inflightDir, { recursive: true });
+  fs.mkdirSync(paths.inflightDir, { recursive: false });
   fs.mkdirSync(paths.runsDir, { recursive: true });
 }

[Survived] BooleanLiteral
src/emit/wal.ts:252:44
   // mkdirp both siblings. `recursive: true` so pre-existing dirs are a
   // no-op. Wrapped by the caller in try/catch.
   fs.mkdirSync(paths.inflightDir, { recursive: true });
-  fs.mkdirSync(paths.runsDir, { recursive: true });
+  fs.mkdirSync(paths.runsDir, { recursive: false });
 }
 

[Killed] BlockStatement
src/emit/wal.ts:255:59
   fs.mkdirSync(paths.runsDir, { recursive: true });
 }
 
-function writeLineSync(file: string, line: WalLine): void {
-  fs.appendFileSync(file, `${JSON.stringify(line)}\n`);
-}
+function writeLineSync(file: string, line: WalLine): void {}
 
 function fsyncFile(file: string): void {
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Survived] BlockStatement
src/emit/wal.ts:259:40
   fs.appendFileSync(file, `${JSON.stringify(line)}\n`);
 }
 
-function fsyncFile(file: string): void {
-  // Open-fsync-close. We do not hold a long-lived fd (the design doc
-  // explicitly says "no fsync per event"); fsync happens once on
-  // `close()` before the atomic rename.
-  const fd = fs.openSync(file, "r+");
-  try {
-    fs.fsyncSync(fd);
-  } finally {
-    fs.closeSync(fd);
-  }
-}
+function fsyncFile(file: string): void {}
 
 // ---------------------------------------------------------------------------

[Survived] BlockStatement
src/emit/wal.ts:264:7
   // explicitly says "no fsync per event"); fsync happens once on
   // `close()` before the atomic rename.
   const fd = fs.openSync(file, "r+");
-  try {
-    fs.fsyncSync(fd);
-  } finally {
+  try {} finally {
     fs.closeSync(fd);
   }

[Survived] BlockStatement
src/emit/wal.ts:266:13
   const fd = fs.openSync(file, "r+");
   try {
     fs.fsyncSync(fd);
-  } finally {
-    fs.closeSync(fd);
-  }
+  } finally {}
 }
 

[Killed] BooleanLiteral
src/emit/wal.ts:289:52
   return Effect.acquireRelease(
     Effect.sync(() => {
       const file = inflightPathFor(paths, runId);
-      const state: HandleState = { seq: 0, closed: false, locked: false };
+      const state: HandleState = { seq: 0, closed: true, locked: false };
 
       // Create inflight dir (and runs dir, so the close-time rename
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/emit/wal.ts:289:67
   return Effect.acquireRelease(
     Effect.sync(() => {
       const file = inflightPathFor(paths, runId);
-      const state: HandleState = { seq: 0, closed: false, locked: false };
+      const state: HandleState = { seq: 0, closed: false, locked: true };
 
       // Create inflight dir (and runs dir, so the close-time rename

[Killed] BlockStatement
src/emit/wal.ts:293:11
 
       // Create inflight dir (and runs dir, so the close-time rename
       // doesn't fail on first run).
-      try {
-        ensureDirsSync(paths);
-      } catch (err) {
+      try {} catch (err) {
         walWarn(WAL_WARN_EVENT.MkdirFailed, {
           runId,
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/emit/wal.ts:295:21
       // doesn't fail on first run).
       try {
         ensureDirsSync(paths);
-      } catch (err) {
-        walWarn(WAL_WARN_EVENT.MkdirFailed, {
-          runId,
-          inflightDir: paths.inflightDir,
-          runsDir: paths.runsDir,
-          error: errorToString(err),
-        });
-      }
+      } catch (err) {}
 
       // Pre-create the empty inflight file so proper-lockfile has a

[Survived] BlockStatement
src/emit/wal.ts:307:11
       // Pre-create the empty inflight file so proper-lockfile has a
       // target to lock. lockSync with `realpath: false` because the file
       // may live on a tmpfs / overlayfs where realpath is lossy.
-      try {
-        fs.writeFileSync(file, "", { flag: "a" });
-      } catch (err) {
+      try {} catch (err) {
         walWarn(WAL_WARN_EVENT.PrecreateFailed, { runId, file, error: errorToString(err) });
       }

[Survived] ObjectLiteral
src/emit/wal.ts:308:36
       // target to lock. lockSync with `realpath: false` because the file
       // may live on a tmpfs / overlayfs where realpath is lossy.
       try {
-        fs.writeFileSync(file, "", { flag: "a" });
+        fs.writeFileSync(file, "", {});
       } catch (err) {
         walWarn(WAL_WARN_EVENT.PrecreateFailed, { runId, file, error: errorToString(err) });

[Survived] BlockStatement
src/emit/wal.ts:309:21
       // may live on a tmpfs / overlayfs where realpath is lossy.
       try {
         fs.writeFileSync(file, "", { flag: "a" });
-      } catch (err) {
-        walWarn(WAL_WARN_EVENT.PrecreateFailed, { runId, file, error: errorToString(err) });
-      }
+      } catch (err) {}
 
       try {

[Killed] BlockStatement
src/emit/wal.ts:313:11
         walWarn(WAL_WARN_EVENT.PrecreateFailed, { runId, file, error: errorToString(err) });
       }
 
-      try {
-        lockfile.lockSync(file, { realpath: false, retries: 0 });
-        state.locked = true;
-      } catch (err) {
+      try {} catch (err) {
         // Another process already owns this runId. Per the spec we still
         // return a handle; the hot-path writes will land in the shared
killedBy: WAL proper-lockfile concurrency openRunLog acquires a lock that checkSync observes as held; released on close
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/emit/wal.ts:314:45
       }
 
       try {
-        lockfile.lockSync(file, { realpath: false, retries: 0 });
+        lockfile.lockSync(file, { realpath: true, retries: 0 });
         state.locked = true;
       } catch (err) {

[Survived] ObjectLiteral
src/emit/wal.ts:314:33
       }
 
       try {
-        lockfile.lockSync(file, { realpath: false, retries: 0 });
+        lockfile.lockSync(file, {});
         state.locked = true;
       } catch (err) {

[Survived] BooleanLiteral
src/emit/wal.ts:315:24
 
       try {
         lockfile.lockSync(file, { realpath: false, retries: 0 });
-        state.locked = true;
+        state.locked = false;
       } catch (err) {
         // Another process already owns this runId. Per the spec we still

[NoCoverage] BlockStatement
src/emit/wal.ts:316:21
       try {
         lockfile.lockSync(file, { realpath: false, retries: 0 });
         state.locked = true;
-      } catch (err) {
-        // Another process already owns this runId. Per the spec we still
-        // return a handle; the hot-path writes will land in the shared
-        // file with best-effort seq. The recovery-sweep contract keys on
-        // the LOCK being held, not on our in-memory state, so lock
-        // collision here is diagnostic, not fatal.
-        walWarn(WAL_WARN_EVENT.LockFailed, { runId, file, error: errorToString(err) });
-      }
+      } catch (err) {}
 
       return makeHandle(runId, paths, state);

[Killed] BlockStatement
src/emit/wal.ts:359:25
   // the durability trade-off and how recovery covers run-level loss.
   function appendOneLocked(input: WalLineInput): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
-      if (state.closed) {
-        // Invariant #12 keeps this Effect non-failing, so post-close appends
-        // are dropped on the floor. To make the loss correlatable, walWarn
-        // includes runId, kind, and a short payload preview — operators
-        // monitoring the WAL_WARN_SOURCE channel can identify exactly which
-        // event went missing. A caller that races its own close against an
-        // emit will see the warning in stderr; the verdict is unaffected.
-        walWarn(WAL_WARN_EVENT.AppendAfterClose, {
-          runId,
-          kind: input.kind,
-          attemptedAt: Date.now(),
-          payloadPreview: previewPayload(input.payload),
-        });
-        return;
-      }
+      if (state.closed) {}
       const line: WalLine = {
         v: WAL_LINE_VERSION,
killedBy: WAL invariant #12 (errors swallowed on hot path) post-close append warning includes runId, kind, and payload preview
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/wal.ts:359:11
   // the durability trade-off and how recovery covers run-level loss.
   function appendOneLocked(input: WalLineInput): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
-      if (state.closed) {
+      if (true) {
         // Invariant #12 keeps this Effect non-failing, so post-close appends
         // are dropped on the floor. To make the loss correlatable, walWarn
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/wal.ts:382:11
         kind: input.kind,
         payload: input.payload,
       };
-      try {
-        writeLineSync(file, line);
-        state.seq += 1;
-      } catch (err) {
+      try {} catch (err) {
         walWarn(WAL_WARN_EVENT.AppendFailed, {
           runId,
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/emit/wal.ts:384:9
       };
       try {
         writeLineSync(file, line);
-        state.seq += 1;
+        state.seq -= 1;
       } catch (err) {
         walWarn(WAL_WARN_EVENT.AppendFailed, {
killedBy: WAL seq monotonicity (Effect.Semaphore) 20 concurrent appends produce strictly monotonic seq 0..19
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/wal.ts:385:21
       try {
         writeLineSync(file, line);
         state.seq += 1;
-      } catch (err) {
-        walWarn(WAL_WARN_EVENT.AppendFailed, {
-          runId,
-          kind: input.kind,
-          seq: state.seq,
-          error: errorToString(err),
-        });
-      }
+      } catch (err) {}
     });
   }
killedBy: WAL invariant #12 (errors swallowed on hot path) fs failures on the hot path are swallowed AND warn on stderr
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/wal.ts:407:13
       // Serialized so any in-flight append finishes first and the
       // outcome line is guaranteed last.
       return semaphore.withPermits(1)(Effect.sync(() => {
-        if (state.closed) return;
+        if (true) return;
         state.closed = true;
 
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/wal.ts:407:13
       // Serialized so any in-flight append finishes first and the
       // outcome line is guaranteed last.
       return semaphore.withPermits(1)(Effect.sync(() => {
-        if (state.closed) return;
+        if (false) return;
         state.closed = true;
 
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/emit/wal.ts:408:24
       // outcome line is guaranteed last.
       return semaphore.withPermits(1)(Effect.sync(() => {
         if (state.closed) return;
-        state.closed = true;
+        state.closed = false;
 
         const outcomeLine: WalLine = {
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Killed] ObjectLiteral
src/emit/wal.ts:416:20
           seq: state.seq,
           ts: Date.now(),
           kind: WAL_LINE_KIND.Outcome,
-          payload: {
-            status: outcome.status,
-            ...(outcome.reason !== undefined ? { reason: outcome.reason } : {}),
-            ...(outcome.details !== undefined ? { details: outcome.details } : {}),
-          },
+          payload: {},
         };
 
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/emit/wal.ts:418:17
           kind: WAL_LINE_KIND.Outcome,
           payload: {
             status: outcome.status,
-            ...(outcome.reason !== undefined ? { reason: outcome.reason } : {}),
+            ...(false ? { reason: outcome.reason } : {}),
             ...(outcome.details !== undefined ? { details: outcome.details } : {}),
           },

[Survived] ConditionalExpression
src/emit/wal.ts:418:17
           kind: WAL_LINE_KIND.Outcome,
           payload: {
             status: outcome.status,
-            ...(outcome.reason !== undefined ? { reason: outcome.reason } : {}),
+            ...(true ? { reason: outcome.reason } : {}),
             ...(outcome.details !== undefined ? { details: outcome.details } : {}),
           },

[Survived] ConditionalExpression
src/emit/wal.ts:419:17
           payload: {
             status: outcome.status,
             ...(outcome.reason !== undefined ? { reason: outcome.reason } : {}),
-            ...(outcome.details !== undefined ? { details: outcome.details } : {}),
+            ...(false ? { details: outcome.details } : {}),
           },
         };

[Survived] ConditionalExpression
src/emit/wal.ts:419:17
           payload: {
             status: outcome.status,
             ...(outcome.reason !== undefined ? { reason: outcome.reason } : {}),
-            ...(outcome.details !== undefined ? { details: outcome.details } : {}),
+            ...(true ? { details: outcome.details } : {}),
           },
         };

[Killed] BlockStatement
src/emit/wal.ts:423:13
           },
         };
 
-        try {
-          writeLineSync(file, outcomeLine);
-          state.seq += 1;
-        } catch (err) {
+        try {} catch (err) {
           walWarn(WAL_WARN_EVENT.OutcomeAppendFailed, {
             runId,
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[Survived] AssignmentOperator
src/emit/wal.ts:425:11
 
         try {
           writeLineSync(file, outcomeLine);
-          state.seq += 1;
+          state.seq -= 1;
         } catch (err) {
           walWarn(WAL_WARN_EVENT.OutcomeAppendFailed, {

[Survived] BlockStatement
src/emit/wal.ts:426:23
         try {
           writeLineSync(file, outcomeLine);
           state.seq += 1;
-        } catch (err) {
-          walWarn(WAL_WARN_EVENT.OutcomeAppendFailed, {
-            runId,
-            error: errorToString(err),
-          });
-        }
+        } catch (err) {}
 
         try {

[Survived] BlockStatement
src/emit/wal.ts:433:13
           });
         }
 
-        try {
-          fsyncFile(file);
-        } catch (err) {
+        try {} catch (err) {
           walWarn(WAL_WARN_EVENT.FsyncFailed, { runId, file, error: errorToString(err) });
         }

[Survived] BlockStatement
src/emit/wal.ts:435:23
 
         try {
           fsyncFile(file);
-        } catch (err) {
-          walWarn(WAL_WARN_EVENT.FsyncFailed, { runId, file, error: errorToString(err) });
-        }
+        } catch (err) {}
 
         // Release the lock BEFORE the rename. proper-lockfile's

[Survived] ObjectLiteral
src/emit/wal.ts:436:47
         try {
           fsyncFile(file);
         } catch (err) {
-          walWarn(WAL_WARN_EVENT.FsyncFailed, { runId, file, error: errorToString(err) });
+          walWarn(WAL_WARN_EVENT.FsyncFailed, {});
         }
 

[Survived] ConditionalExpression
src/emit/wal.ts:442:13
         // Release the lock BEFORE the rename. proper-lockfile's
         // `.lock`/`.unlock` sidecars key on the original path; if we
         // rename first the unlock cannot find its own sidecar.
-        if (state.locked) {
+        if (true) {
           try {
             lockfile.unlockSync(file, { realpath: false });

[Survived] BlockStatement
src/emit/wal.ts:442:27
         // Release the lock BEFORE the rename. proper-lockfile's
         // `.lock`/`.unlock` sidecars key on the original path; if we
         // rename first the unlock cannot find its own sidecar.
-        if (state.locked) {
-          try {
-            lockfile.unlockSync(file, { realpath: false });
-            state.locked = false;
-          } catch (err) {
-            walWarn(WAL_WARN_EVENT.UnlockFailed, { runId, file, error: errorToString(err) });
-          }
-        }
+        if (state.locked) {}
 
         const dest = runsPathFor(paths, runId);

[Survived] BlockStatement
src/emit/wal.ts:443:15
         // `.lock`/`.unlock` sidecars key on the original path; if we
         // rename first the unlock cannot find its own sidecar.
         if (state.locked) {
-          try {
-            lockfile.unlockSync(file, { realpath: false });
-            state.locked = false;
-          } catch (err) {
+          try {} catch (err) {
             walWarn(WAL_WARN_EVENT.UnlockFailed, { runId, file, error: errorToString(err) });
           }

[Survived] BooleanLiteral
src/emit/wal.ts:444:51
         // rename first the unlock cannot find its own sidecar.
         if (state.locked) {
           try {
-            lockfile.unlockSync(file, { realpath: false });
+            lockfile.unlockSync(file, { realpath: true });
             state.locked = false;
           } catch (err) {

[Survived] ObjectLiteral
src/emit/wal.ts:444:39
         // rename first the unlock cannot find its own sidecar.
         if (state.locked) {
           try {
-            lockfile.unlockSync(file, { realpath: false });
+            lockfile.unlockSync(file, {});
             state.locked = false;
           } catch (err) {

[Survived] BooleanLiteral
src/emit/wal.ts:445:28
         if (state.locked) {
           try {
             lockfile.unlockSync(file, { realpath: false });
-            state.locked = false;
+            state.locked = true;
           } catch (err) {
             walWarn(WAL_WARN_EVENT.UnlockFailed, { runId, file, error: errorToString(err) });

[NoCoverage] BlockStatement
src/emit/wal.ts:446:25
           try {
             lockfile.unlockSync(file, { realpath: false });
             state.locked = false;
-          } catch (err) {
-            walWarn(WAL_WARN_EVENT.UnlockFailed, { runId, file, error: errorToString(err) });
-          }
+          } catch (err) {}
         }
 

[Killed] BlockStatement
src/emit/wal.ts:452:13
         }
 
         const dest = runsPathFor(paths, runId);
-        try {
-          fs.renameSync(file, dest);
-        } catch (err) {
+        try {} catch (err) {
           walWarn(WAL_WARN_EVENT.RenameFailed, {
             runId,
killedBy: WAL happy path (openRunLog/append/close) appends lines to inflight and atomically renames to runs on close
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/emit/wal.ts:454:23
         const dest = runsPathFor(paths, runId);
         try {
           fs.renameSync(file, dest);
-        } catch (err) {
-          walWarn(WAL_WARN_EVENT.RenameFailed, {
-            runId,
-            from: file,
-            to: dest,
-            error: errorToString(err),
-          });
-        }
+        } catch (err) {}
       }));
     },

[Survived] ConditionalExpression
src/emit/wal.ts:496:11
       // ENOENT as a no-op sweep.
       entries = fs.readdirSync(paths.inflightDir);
     } catch (err) {
-      if (!isEnoent(err)) {
+      if (false) {
         walWarn(WAL_WARN_EVENT.SweepReaddirFailed, {
           inflightDir: paths.inflightDir,

[Survived] BooleanLiteral
src/emit/wal.ts:496:11
       // ENOENT as a no-op sweep.
       entries = fs.readdirSync(paths.inflightDir);
     } catch (err) {
-      if (!isEnoent(err)) {
+      if (isEnoent(err)) {
         walWarn(WAL_WARN_EVENT.SweepReaddirFailed, {
           inflightDir: paths.inflightDir,

[Killed] BlockStatement
src/emit/wal.ts:506:34
     }
 
     let scanned = 0;
-    for (const entry of entries) {
-      if (!entry.endsWith(".jsonl")) continue;
-      scanned += 1;
-
-      const runId = entry.slice(0, -".jsonl".length);
-      const inflightPath = path.join(paths.inflightDir, entry);
-      const result = sweepOneFile(paths, runId, inflightPath);
-      recovered.push(result);
-    }
+    for (const entry of entries) {}
 
     return { scanned, recovered };
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/emit/wal.ts:507:12
 
     let scanned = 0;
     for (const entry of entries) {
-      if (!entry.endsWith(".jsonl")) continue;
+      if (!entry.startsWith(".jsonl")) continue;
       scanned += 1;
 
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/wal.ts:507:11
 
     let scanned = 0;
     for (const entry of entries) {
-      if (!entry.endsWith(".jsonl")) continue;
+      if (true) continue;
       scanned += 1;
 
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/emit/wal.ts:508:7
     let scanned = 0;
     for (const entry of entries) {
       if (!entry.endsWith(".jsonl")) continue;
-      scanned += 1;
+      scanned -= 1;
 
       const runId = entry.slice(0, -".jsonl".length);
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure
