[Killed] UnaryOperator
src/emit/wal.ts:510:36
       if (!entry.endsWith(".jsonl")) continue;
       scanned += 1;
 
-      const runId = entry.slice(0, -".jsonl".length);
+      const runId = entry.slice(0, +".jsonl".length);
       const inflightPath = path.join(paths.inflightDir, entry);
       const result = sweepOneFile(paths, runId, inflightPath);
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/emit/wal.ts:510:21
       if (!entry.endsWith(".jsonl")) continue;
       scanned += 1;
 
-      const runId = entry.slice(0, -".jsonl".length);
+      const runId = entry;
       const inflightPath = path.join(paths.inflightDir, entry);
       const result = sweepOneFile(paths, runId, inflightPath);
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/wal.ts:527:7
 ): RecoveredFile {
   // Step 1: lock-held probe. A held lock means some other live process
   // owns this file; leave it alone.
-  try {
-    const held = lockfile.checkSync(inflightPath, { realpath: false });
-    if (held) {
-      return {
-        runId,
-        outcome: RECOVERY_OUTCOME.Locked,
-        inflightPath,
-        runsPath: null,
-      };
-    }
-  } catch (err) {
+  try {} catch (err) {
     walWarn(WAL_WARN_EVENT.SweepCheckFailed, {
       runId,
killedBy: WAL recovery sweep locked sweep: live-lock inflight is SKIPPED (no rename, no marker)
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/emit/wal.ts:528:63
   // Step 1: lock-held probe. A held lock means some other live process
   // owns this file; leave it alone.
   try {
-    const held = lockfile.checkSync(inflightPath, { realpath: false });
+    const held = lockfile.checkSync(inflightPath, { realpath: true });
     if (held) {
       return {

[Survived] ObjectLiteral
src/emit/wal.ts:528:51
   // Step 1: lock-held probe. A held lock means some other live process
   // owns this file; leave it alone.
   try {
-    const held = lockfile.checkSync(inflightPath, { realpath: false });
+    const held = lockfile.checkSync(inflightPath, {});
     if (held) {
       return {

[Killed] BlockStatement
src/emit/wal.ts:529:15
   // owns this file; leave it alone.
   try {
     const held = lockfile.checkSync(inflightPath, { realpath: false });
-    if (held) {
-      return {
-        runId,
-        outcome: RECOVERY_OUTCOME.Locked,
-        inflightPath,
-        runsPath: null,
-      };
-    }
+    if (held) {}
   } catch (err) {
     walWarn(WAL_WARN_EVENT.SweepCheckFailed, {
killedBy: WAL recovery sweep locked sweep: live-lock inflight is SKIPPED (no rename, no marker)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/wal.ts:529:9
   // owns this file; leave it alone.
   try {
     const held = lockfile.checkSync(inflightPath, { realpath: false });
-    if (held) {
+    if (true) {
       return {
         runId,
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/emit/wal.ts:537:17
         runsPath: null,
       };
     }
-  } catch (err) {
-    walWarn(WAL_WARN_EVENT.SweepCheckFailed, {
-      runId,
-      file: inflightPath,
-      error: errorToString(err),
-    });
-    // Fall through: treat an uncheckable lock as "probably stale" and
-    // proceed to the outcome-scan step. Worst case we append an
-    // orphaned marker onto a file whose owner was briefly unresponsive;
-    // that's preferable to leaving stale inflight files around forever.
-  }
+  } catch (err) {}
 
   // Step 2: scan for a terminal outcome line.

[Killed] ConditionalExpression
src/emit/wal.ts:553:7
   const hasOutcome = scanFileForOutcome(inflightPath);
 
   // Step 3: if no outcome, append orphaned marker.
-  if (!hasOutcome) {
+  if (false) {
     try {
       const marker: WalLine = {
killedBy: WAL recovery sweep orphan sweep: outcome-absent inflight gets orphaned marker + rename
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/emit/wal.ts:553:7
   const hasOutcome = scanFileForOutcome(inflightPath);
 
   // Step 3: if no outcome, append orphaned marker.
-  if (!hasOutcome) {
+  if (hasOutcome) {
     try {
       const marker: WalLine = {
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/wal.ts:554:9
 
   // Step 3: if no outcome, append orphaned marker.
   if (!hasOutcome) {
-    try {
-      const marker: WalLine = {
-        v: WAL_LINE_VERSION,
-        runId,
-        // seq=-1 so the marker is obvious and doesn't collide with any
-        // real append; inspect (#77) keys on kind, not seq.
-        seq: -1,
-        ts: Date.now(),
-        kind: WAL_LINE_KIND.Orphaned,
-        payload: { reason: "inflight file recovered without outcome" },
-      };
-      writeLineSync(inflightPath, marker);
-    } catch (err) {
+    try {} catch (err) {
       walWarn(WAL_WARN_EVENT.SweepMarkOrphanedFailed, {
         runId,
killedBy: WAL recovery sweep orphan sweep: outcome-absent inflight gets orphaned marker + rename
statusReason: StrykerJS: Unknown test failure

[Survived] UnaryOperator
src/emit/wal.ts:560:14
         runId,
         // seq=-1 so the marker is obvious and doesn't collide with any
         // real append; inspect (#77) keys on kind, not seq.
-        seq: -1,
+        seq: +1,
         ts: Date.now(),
         kind: WAL_LINE_KIND.Orphaned,

[NoCoverage] BlockStatement
src/emit/wal.ts:566:19
         payload: { reason: "inflight file recovered without outcome" },
       };
       writeLineSync(inflightPath, marker);
-    } catch (err) {
-      walWarn(WAL_WARN_EVENT.SweepMarkOrphanedFailed, {
-        runId,
-        file: inflightPath,
-        error: errorToString(err),
-      });
-      return {
-        runId,
-        outcome: RECOVERY_OUTCOME.Failed,
-        inflightPath,
-        runsPath: null,
-      };
-    }
+    } catch (err) {}
   }
 

[Killed] BlockStatement
src/emit/wal.ts:583:7
 
   // Step 4: rename to runs/.
   const dest = runsPathFor(paths, runId);
-  try {
-    fs.mkdirSync(paths.runsDir, { recursive: true });
-    fs.renameSync(inflightPath, dest);
-  } catch (err) {
+  try {} catch (err) {
     walWarn(WAL_WARN_EVENT.SweepRenameFailed, {
       runId,
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/emit/wal.ts:584:46
   // Step 4: rename to runs/.
   const dest = runsPathFor(paths, runId);
   try {
-    fs.mkdirSync(paths.runsDir, { recursive: true });
+    fs.mkdirSync(paths.runsDir, { recursive: false });
     fs.renameSync(inflightPath, dest);
   } catch (err) {

[NoCoverage] BlockStatement
src/emit/wal.ts:586:17
   try {
     fs.mkdirSync(paths.runsDir, { recursive: true });
     fs.renameSync(inflightPath, dest);
-  } catch (err) {
-    walWarn(WAL_WARN_EVENT.SweepRenameFailed, {
-      runId,
-      from: inflightPath,
-      to: dest,
-      error: errorToString(err),
-    });
-    return {
-      runId,
-      outcome: RECOVERY_OUTCOME.Failed,
-      inflightPath,
-      runsPath: null,
-    };
-  }
+  } catch (err) {}
 
   return {

[Killed] EqualityOperator
src/emit/wal.ts:615:9
 function scanFileForOutcome(file: string): boolean {
   try {
     const content = fs.readFileSync(file, "utf8");
-    if (content.length === 0) return false;
+    if (content.length !== 0) return false;
     const lines = content.split("\n");
     for (const raw of lines) {
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/wal.ts:615:9
 function scanFileForOutcome(file: string): boolean {
   try {
     const content = fs.readFileSync(file, "utf8");
-    if (content.length === 0) return false;
+    if (true) return false;
     const lines = content.split("\n");
     for (const raw of lines) {
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/wal.ts:617:30
     const content = fs.readFileSync(file, "utf8");
     if (content.length === 0) return false;
     const lines = content.split("\n");
-    for (const raw of lines) {
-      if (raw.length === 0) continue;
-      // Malformed lines are silently skipped (matches
-      // `readRunsJsonl` policy in `src/emit/report.ts`).
-      let parsed: unknown;
-      try {
-        parsed = JSON.parse(raw);
-      } catch (err) { void err; continue; }
-      if (isOutcomeLine(parsed)) return true;
-    }
+    for (const raw of lines) {}
     return false;
   } catch (err) {
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/emit/wal.ts:618:11
     if (content.length === 0) return false;
     const lines = content.split("\n");
     for (const raw of lines) {
-      if (raw.length === 0) continue;
+      if (raw.length !== 0) continue;
       // Malformed lines are silently skipped (matches
       // `readRunsJsonl` policy in `src/emit/report.ts`).
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/wal.ts:618:11
     if (content.length === 0) return false;
     const lines = content.split("\n");
     for (const raw of lines) {
-      if (raw.length === 0) continue;
+      if (true) continue;
       // Malformed lines are silently skipped (matches
       // `readRunsJsonl` policy in `src/emit/report.ts`).
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/wal.ts:622:11
       // Malformed lines are silently skipped (matches
       // `readRunsJsonl` policy in `src/emit/report.ts`).
       let parsed: unknown;
-      try {
-        parsed = JSON.parse(raw);
-      } catch (err) { void err; continue; }
+      try {} catch (err) { void err; continue; }
       if (isOutcomeLine(parsed)) return true;
     }
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/emit/wal.ts:624:21
       let parsed: unknown;
       try {
         parsed = JSON.parse(raw);
-      } catch (err) { void err; continue; }
+      } catch (err) {}
       if (isOutcomeLine(parsed)) return true;
     }

[Killed] ConditionalExpression
src/emit/wal.ts:625:11
       try {
         parsed = JSON.parse(raw);
       } catch (err) { void err; continue; }
-      if (isOutcomeLine(parsed)) return true;
+      if (false) return true;
     }
     return false;
killedBy: WAL recovery sweep clean sweep: outcome-present inflight is renamed WITHOUT orphaned marker
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/wal.ts:625:11
       try {
         parsed = JSON.parse(raw);
       } catch (err) { void err; continue; }
-      if (isOutcomeLine(parsed)) return true;
+      if (true) return true;
     }
     return false;
killedBy: WAL recovery sweep orphan sweep: outcome-absent inflight gets orphaned marker + rename
statusReason: StrykerJS: Unknown test failure

[NoCoverage] ObjectLiteral
src/emit/wal.ts:629:45
     }
     return false;
   } catch (err) {
-    walWarn(WAL_WARN_EVENT.SweepScanFailed, { file, error: errorToString(err) });
+    walWarn(WAL_WARN_EVENT.SweepScanFailed, {});
     return false;
   }

[NoCoverage] BooleanLiteral
src/emit/wal.ts:630:12
     return false;
   } catch (err) {
     walWarn(WAL_WARN_EVENT.SweepScanFailed, { file, error: errorToString(err) });
-    return false;
+    return true;
   }
 }

[Killed] ConditionalExpression
src/emit/wal.ts:636:36
 
 /** @internal — exported for direct property-based testing. */
 export function isOutcomeLine(value: unknown): boolean {
-  if (typeof value !== "object" || value === null) return false;
+  if (typeof value !== "object" || false) return false;
   const kind = (value as { kind?: unknown }).kind;
   return kind === WAL_LINE_KIND.Outcome;
killedBy: isOutcomeLine (PBT) returns false for non-object inputs
statusReason: Property failed after 3 tests
{ seed: -1344560641, path: "2", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/emit/wal.ts:636:7
 
 /** @internal — exported for direct property-based testing. */
 export function isOutcomeLine(value: unknown): boolean {
-  if (typeof value !== "object" || value === null) return false;
+  if (false) return false;
   const kind = (value as { kind?: unknown }).kind;
   return kind === WAL_LINE_KIND.Outcome;
killedBy: isOutcomeLine (PBT) returns false for non-object inputs
statusReason: Property failed after 1 tests
{ seed: 394127895, path: "0", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/emit/wal.ts:638:10
 export function isOutcomeLine(value: unknown): boolean {
   if (typeof value !== "object" || value === null) return false;
   const kind = (value as { kind?: unknown }).kind;
-  return kind === WAL_LINE_KIND.Outcome;
+  return true;
 }
 
killedBy: isOutcomeLine (PBT) returns true iff the object's kind field equals WAL_LINE_KIND.Outcome
statusReason: Property failed after 1 tests
{ seed: -1584774472, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{},""]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/emit/wal.ts:638:10
 export function isOutcomeLine(value: unknown): boolean {
   if (typeof value !== "object" || value === null) return false;
   const kind = (value as { kind?: unknown }).kind;
-  return kind === WAL_LINE_KIND.Outcome;
+  return false;
 }
 
killedBy: isOutcomeLine (PBT) recognises a concrete outcome line shape
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/emit/wal.ts:654:5
 /** @internal — exported for direct property-based testing. */
 export function isEnoent(err: unknown): boolean {
   return (
-    typeof err === "object" &&
-    err !== null &&
+    typeof err === "object" || err !== null &&
     (err as { code?: unknown }).code === "ENOENT"
   );
killedBy: isEnoent (PBT) returns false for non-object inputs
statusReason: Property failed after 4 tests
{ seed: 1996519938, path: "3", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/emit/wal.ts:654:5
 /** @internal — exported for direct property-based testing. */
 export function isEnoent(err: unknown): boolean {
   return (
-    typeof err === "object" &&
+    typeof err !== "object" &&
     err !== null &&
     (err as { code?: unknown }).code === "ENOENT"
killedBy: isEnoent (PBT) returns false for non-object inputs
statusReason: Property failed after 3 tests
{ seed: 1897536556, path: "2", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/emit/wal.ts:655:5
 export function isEnoent(err: unknown): boolean {
   return (
     typeof err === "object" &&
-    err !== null &&
+    true &&
     (err as { code?: unknown }).code === "ENOENT"
   );
killedBy: isEnoent (PBT) returns false for non-object inputs
statusReason: Property failed after 2 tests
{ seed: -600838032, path: "1", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/emit/wal.ts:656:5
   return (
     typeof err === "object" &&
     err !== null &&
-    (err as { code?: unknown }).code === "ENOENT"
+    true
   );
 }
killedBy: isEnoent (PBT) returns true iff the object has code === 'ENOENT'
statusReason: Property failed after 1 tests
{ seed: -1655657416, path: "0:0:0", endOnFailure: true }
Counterexample: [{},""]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/emit/wal.ts:656:5
   return (
     typeof err === "object" &&
     err !== null &&
-    (err as { code?: unknown }).code === "ENOENT"
+    (err as {
+  code?: unknown;
+}).code !== "ENOENT"
   );
 }
killedBy: isEnoent (PBT) returns true iff the object has code === 'ENOENT'
statusReason: Property failed after 1 tests
{ seed: 170489170, path: "0:0", endOnFailure: true }
Counterexample: [{},""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
