[Killed] EqualityOperator
src/judge/helpers.ts:34:7
 } as const;
 
 function renderChange(c: WorkspaceFileChange): string {
-  if (c.before === null && c.after !== null) {
+  if (c.before !== null && c.after !== null) {
     return `${DIFF_PREFIX.Added} ${c.path} (${c.after.length} bytes)`;
   }
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `+ added` lines with byte count for before=null entries
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/helpers.ts:34:46
 } as const;
 
 function renderChange(c: WorkspaceFileChange): string {
-  if (c.before === null && c.after !== null) {
-    return `${DIFF_PREFIX.Added} ${c.path} (${c.after.length} bytes)`;
-  }
+  if (c.before === null && c.after !== null) {}
   if (c.before !== null && c.after === null) {
     return `${DIFF_PREFIX.Removed} ${c.path}`;
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `+ added` lines with byte count for before=null entries
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/helpers.ts:37:28
   if (c.before === null && c.after !== null) {
     return `${DIFF_PREFIX.Added} ${c.path} (${c.after.length} bytes)`;
   }
-  if (c.before !== null && c.after === null) {
+  if (c.before !== null && true) {
     return `${DIFF_PREFIX.Removed} ${c.path}`;
   }
killedBy: renderDiff (PBT) a modified entry uses '~ modified'
statusReason: expected '- removed x.txt' to be '~ modified x.txt' // Object.is equality

[Killed] EqualityOperator
src/judge/helpers.ts:37:28
   if (c.before === null && c.after !== null) {
     return `${DIFF_PREFIX.Added} ${c.path} (${c.after.length} bytes)`;
   }
-  if (c.before !== null && c.after === null) {
+  if (c.before !== null && c.after !== null) {
     return `${DIFF_PREFIX.Removed} ${c.path}`;
   }
killedBy: renderDiff (PBT) a removed entry uses '- removed'
statusReason: expected '~ modified x.txt' to be '- removed x.txt' // Object.is equality

[Killed] EqualityOperator
src/judge/helpers.ts:45:7
 
 export function renderDiff(diff: WorkspaceDiff | undefined): string {
   const changes = diff?.changed ?? [];
-  if (changes.length === 0) return PROMPT_NO_DIFF;
+  if (changes.length !== 0) return PROMPT_NO_DIFF;
   return changes.map(renderChange).join("\n");
 }
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `+ added` lines with byte count for before=null entries
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/helpers.ts:45:7
 
 export function renderDiff(diff: WorkspaceDiff | undefined): string {
   const changes = diff?.changed ?? [];
-  if (changes.length === 0) return PROMPT_NO_DIFF;
+  if (true) return PROMPT_NO_DIFF;
   return changes.map(renderChange).join("\n");
 }
killedBy: renderDiff (PBT) emits one line per change
statusReason: Property failed after 1 tests
{ seed: 1272753657, path: "0:1:0:0:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [[{"path":" ","before":null,"after":null},{"path":" ","before":null,"after":null}]]
Shrunk 12 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/judge/helpers.ts:57:10
 } as const;
 
 export function turnHeader(index: number): string {
-  return `--- Turn ${index} ---`;
+  return ``;
 }
 
killedBy: AnthropicJudgeBackend renderTurns newline joining turn sections are separated by newlines, not empty-joined
statusReason: StrykerJS: Unknown test failure

[Killed] ArrowFunction
src/judge/helpers.ts:62:14
 
 export function renderTurns(turns: ReadonlyArray<Turn>): string {
   return turns
-    .flatMap((t) => [
-      turnHeader(t.index),
-      `${TURN_LABEL.User}: ${t.prompt}`,
-      `${TURN_LABEL.Assistant}: ${t.response}`,
-    ])
+    .flatMap(() => undefined)
     .join("\n");
 }
killedBy: AnthropicJudgeBackend prompt content renderTurns emits USER and ASSISTANT labels with turn index
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/helpers.ts:67:11
       `${TURN_LABEL.User}: ${t.prompt}`,
       `${TURN_LABEL.Assistant}: ${t.response}`,
     ])
-    .join("\n");
+    .join("");
 }
 
killedBy: AnthropicJudgeBackend renderTurns newline joining turn sections are separated by newlines, not empty-joined
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/helpers.ts:87:22
   const ts = isoTs(e.ts);
   switch (e.type) {
     case "message": {
-      const target = e.to !== undefined ? `${EVENT_PREFIX.MessageArrow}${e.to}` : "";
+      const target = e.to === undefined ? `${EVENT_PREFIX.MessageArrow}${e.to}` : "";
       return `[${ts}] [${e.channel}] ${e.from}${target}: ${e.text}`;
     }
killedBy: renderEvents (PBT) a message event starts with [iso] [channel] from
statusReason: expected '[1970-01-01T00:00:00.000Z] [chat] ali…' to be '[1970-01-01T00:00:00.000Z] [chat] ali…' // Object.is equality

[Killed] ConditionalExpression
src/judge/helpers.ts:87:22
   const ts = isoTs(e.ts);
   switch (e.type) {
     case "message": {
-      const target = e.to !== undefined ? `${EVENT_PREFIX.MessageArrow}${e.to}` : "";
+      const target = true ? `${EVENT_PREFIX.MessageArrow}${e.to}` : "";
       return `[${ts}] [${e.channel}] ${e.from}${target}: ${e.text}`;
     }
killedBy: renderEvents (PBT) a message event without `to` omits the arrow segment
statusReason: expected '[1970-01-01T00:00:00.000Z] [chat] ali…' to be '[1970-01-01T00:00:00.000Z] [chat] ali…' // Object.is equality

[Killed] EqualityOperator
src/judge/helpers.ts:91:21
       return `[${ts}] [${e.channel}] ${e.from}${target}: ${e.text}`;
     }
     case "phase": {
-      const round = e.round !== undefined ? ` (round ${e.round})` : "";
+      const round = e.round === undefined ? ` (round ${e.round})` : "";
       return `[${ts}] ${EVENT_PREFIX.Phase} ${e.phase}${round}`;
     }
killedBy: renderEvents (PBT) a phase event renders PHASE: with optional round suffix
statusReason: expected '[1970-01-01T00:00:00.000Z] PHASE: p1' to contain 'PHASE: p1 (round 3)'

[Survived] ConditionalExpression
src/judge/helpers.ts:91:21
       return `[${ts}] [${e.channel}] ${e.from}${target}: ${e.text}`;
     }
     case "phase": {
-      const round = e.round !== undefined ? ` (round ${e.round})` : "";
+      const round = true ? ` (round ${e.round})` : "";
       return `[${ts}] ${EVENT_PREFIX.Phase} ${e.phase}${round}`;
     }

[Killed] ConditionalExpression
src/judge/helpers.ts:108:16
 // ── agents ──────────────────────────────────────────────────────────────────
 
 function renderAgentLine(a: AgentRef): string {
-  const role = a.role !== undefined ? ` role=${a.role}` : "";
+  const role = false ? ` role=${a.role}` : "";
   return `- ${a.name} (${a.id})${role}`;
 }
killedBy: renderAgents (PBT) includes role suffix iff role is defined
statusReason: expected '- A (a)' to be '- A (a) role=judge' // Object.is equality

[Killed] EqualityOperator
src/judge/helpers.ts:108:16
 // ── agents ──────────────────────────────────────────────────────────────────
 
 function renderAgentLine(a: AgentRef): string {
-  const role = a.role !== undefined ? ` role=${a.role}` : "";
+  const role = a.role === undefined ? ` role=${a.role}` : "";
   return `- ${a.name} (${a.id})${role}`;
 }
killedBy: renderAgents (PBT) includes role suffix iff role is defined
statusReason: expected '- A (a) role=undefined' to be '- A (a)' // Object.is equality

[Killed] ArithmeticOperator
src/judge/helpers.ts:151:11
       from: agentName,
       channel: RESPONSE_CHANNEL,
       text: entry.turn.response,
-      ts: promptTs + entry.turn.latencyMs,
+      ts: promptTs - entry.turn.latencyMs,
     },
   ];
killedBy: turnEntryToEvents (PBT) response event's ts is prompt ts + latencyMs
statusReason: expected -250 to be 250 // Object.is equality

[Killed] ConditionalExpression
src/judge/helpers.ts:159:38
 export function bundleTurnsToEvents(
   bundle: JudgmentBundle,
 ): ReadonlyArray<TraceEvent> | undefined {
-  if (bundle.events !== undefined && bundle.events.length > 0) {
+  if (bundle.events !== undefined && true) {
     return bundle.events;
   }
killedBy: bundleTurnsToEvents (PBT) returns undefined when events is empty array and no turns
statusReason: expected [] to be undefined

[Killed] BlockStatement
src/judge/helpers.ts:159:64
 export function bundleTurnsToEvents(
   bundle: JudgmentBundle,
 ): ReadonlyArray<TraceEvent> | undefined {
-  if (bundle.events !== undefined && bundle.events.length > 0) {
-    return bundle.events;
-  }
+  if (bundle.events !== undefined && bundle.events.length > 0) {}
   const turns = bundle.turns ?? [];
   if (turns.length === 0) return undefined;
killedBy: bundleTurnsToEvents (PBT) returns bundle.events directly when present and non-empty
statusReason: expected undefined to be [ { type: 'phase', …(2) } ] // Object.is equality

[Killed] ConditionalExpression
src/judge/helpers.ts:163:7
     return bundle.events;
   }
   const turns = bundle.turns ?? [];
-  if (turns.length === 0) return undefined;
+  if (true) return undefined;
   const agentNameById = new Map(bundle.agents.map((a) => [a.id, a.name]));
   return turns.flatMap((entry) => turnEntryToEvents(entry, agentNameById));
killedBy: bundleTurnsToEvents (PBT) synthesizes events from turns when bundle.events is empty/missing
statusReason: expected undefined to be 2 // Object.is equality

[Killed] EqualityOperator
src/judge/helpers.ts:163:7
     return bundle.events;
   }
   const turns = bundle.turns ?? [];
-  if (turns.length === 0) return undefined;
+  if (turns.length !== 0) return undefined;
   const agentNameById = new Map(bundle.agents.map((a) => [a.id, a.name]));
   return turns.flatMap((entry) => turnEntryToEvents(entry, agentNameById));
killedBy: bundleTurnsToEvents (PBT) returns undefined when no events and no turns
statusReason: expected [] to be undefined

[Killed] MethodExpression
src/judge/helpers.ts:179:10
  * body itself; bad JSON downstream is the caller's problem.
  */
 export function extractJsonText(text: string): string {
-  return text.trim().replace(FENCE_START, "").replace(FENCE_END, "").trim();
+  return text.replace(FENCE_START, "").replace(FENCE_END, "").trim();
 }
 
killedBy: AnthropicJudgeBackend extractJsonText fence variations strips leading and trailing whitespace around fences
statusReason: StrykerJS: Unknown test failure

[Survived] MethodExpression
src/judge/helpers.ts:179:10
  * body itself; bad JSON downstream is the caller's problem.
  */
 export function extractJsonText(text: string): string {
-  return text.trim().replace(FENCE_START, "").replace(FENCE_END, "").trim();
+  return text.trim().replace(FENCE_START, "").replace(FENCE_END, "");
 }
 

[Killed] ConditionalExpression
src/judge/helpers.ts:187:10
 const VALID_SEVERITIES: ReadonlyArray<IssueSeverity> = ["minor", "significant", "critical"];
 
 export function coerceSeverity(v: unknown): IssueSeverity | null {
-  return typeof v === "string" && (VALID_SEVERITIES as ReadonlyArray<string>).includes(v)
+  return true
     ? (v as IssueSeverity)
     : null;
killedBy: AnthropicJudgeBackend drops malformed issues (non-string text, unknown severity)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/helpers.ts:187:10
 const VALID_SEVERITIES: ReadonlyArray<IssueSeverity> = ["minor", "significant", "critical"];
 
 export function coerceSeverity(v: unknown): IssueSeverity | null {
-  return typeof v === "string" && (VALID_SEVERITIES as ReadonlyArray<string>).includes(v)
+  return false
     ? (v as IssueSeverity)
     : null;
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/helpers.ts:198:36
 }
 
 function coerceIssue(entry: unknown): Issue | null {
-  if (typeof entry !== "object" || entry === null) return null;
+  if (typeof entry !== "object" || false) return null;
   const e = entry as RawIssueEntry;
   if (typeof e.issue !== "string") return null;
killedBy: AnthropicJudgeBackend coerceIssues null-entry filtering drops null entries in issues array
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/judge/helpers.ts:198:7
 }
 
 function coerceIssue(entry: unknown): Issue | null {
-  if (typeof entry !== "object" || entry === null) return null;
+  if (typeof entry !== "object" && entry === null) return null;
   const e = entry as RawIssueEntry;
   if (typeof e.issue !== "string") return null;
killedBy: AnthropicJudgeBackend coerceIssues null-entry filtering drops null entries in issues array
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/helpers.ts:209:26
 export function coerceIssues(v: unknown): ReadonlyArray<Issue> {
   if (!Array.isArray(v)) return [];
   const out: Issue[] = [];
-  for (const entry of v) {
-    const issue = coerceIssue(entry);
-    if (issue !== null) out.push(issue);
-  }
+  for (const entry of v) {}
   return out;
 }
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/judge/helpers.ts:223:22
  */
 export function coerceConfidence(v: unknown): number | undefined {
   if (typeof v !== "number" || Number.isNaN(v)) return undefined;
-  return Math.max(0, Math.min(1, v));
+  return Math.max(0, Math.max(1, v));
 }
 
killedBy: coerceConfidence (PBT) clamps to [0, 1]
statusReason: Property failed after 7 tests
{ seed: 32490718, path: "6:2:0:0:0:0:0:0:0:1:1:0:0:2:0:0:0:0:1:1:1:0", endOnFailure: true }
Counterexample: [1.0000001192092896]
Shrunk 21 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/judge/helpers.ts:223:10
  */
 export function coerceConfidence(v: unknown): number | undefined {
   if (typeof v !== "number" || Number.isNaN(v)) return undefined;
-  return Math.max(0, Math.min(1, v));
+  return Math.min(0, Math.min(1, v));
 }
 
killedBy: coerceConfidence (PBT) clamps to [0, 1]
statusReason: Property failed after 1 tests
{ seed: 15218259, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [-1.401298464324817e-45]
Shrunk 30 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
