[Survived] LogicalOperator
src/judge/index.ts:103:9
 export function bundleToJudgeInput(bundle: JudgmentBundle, abortSignal?: AbortSignal): JudgeInput {
   const events = bundleTurnsToEvents(bundle);
   const context = {
-    ...(bundle.context ?? {}),
+    ...(bundle.context && {}),
     agentOutcomes: bundle.outcomes,
   };

[Survived] ConditionalExpression
src/judge/index.ts:109:9
   return {
     target: bundleToJudgeTarget(bundle),
     turns: bundleTurnsToTurns(bundle),
-    ...(bundle.workspaceDiff !== undefined ? { workspaceDiff: bundle.workspaceDiff } : {}),
+    ...(false ? { workspaceDiff: bundle.workspaceDiff } : {}),
     ...(events !== undefined ? { events } : {}),
     ...(bundle.phases !== undefined ? { phases: bundle.phases } : {}),

[Survived] EqualityOperator
src/judge/index.ts:109:9
   return {
     target: bundleToJudgeTarget(bundle),
     turns: bundleTurnsToTurns(bundle),
-    ...(bundle.workspaceDiff !== undefined ? { workspaceDiff: bundle.workspaceDiff } : {}),
+    ...(bundle.workspaceDiff === undefined ? { workspaceDiff: bundle.workspaceDiff } : {}),
     ...(events !== undefined ? { events } : {}),
     ...(bundle.phases !== undefined ? { phases: bundle.phases } : {}),

[Survived] ConditionalExpression
src/judge/index.ts:111:9
     turns: bundleTurnsToTurns(bundle),
     ...(bundle.workspaceDiff !== undefined ? { workspaceDiff: bundle.workspaceDiff } : {}),
     ...(events !== undefined ? { events } : {}),
-    ...(bundle.phases !== undefined ? { phases: bundle.phases } : {}),
+    ...(true ? { phases: bundle.phases } : {}),
     ...(bundle.agents.length > 0 ? { agents: bundle.agents } : {}),
     ...(Object.keys(context).length > 0 ? { context } : {}),

[Survived] EqualityOperator
src/judge/index.ts:111:9
     turns: bundleTurnsToTurns(bundle),
     ...(bundle.workspaceDiff !== undefined ? { workspaceDiff: bundle.workspaceDiff } : {}),
     ...(events !== undefined ? { events } : {}),
-    ...(bundle.phases !== undefined ? { phases: bundle.phases } : {}),
+    ...(bundle.phases === undefined ? { phases: bundle.phases } : {}),
     ...(bundle.agents.length > 0 ? { agents: bundle.agents } : {}),
     ...(Object.keys(context).length > 0 ? { context } : {}),

[Survived] ConditionalExpression
src/judge/index.ts:112:9
     ...(bundle.workspaceDiff !== undefined ? { workspaceDiff: bundle.workspaceDiff } : {}),
     ...(events !== undefined ? { events } : {}),
     ...(bundle.phases !== undefined ? { phases: bundle.phases } : {}),
-    ...(bundle.agents.length > 0 ? { agents: bundle.agents } : {}),
+    ...(false ? { agents: bundle.agents } : {}),
     ...(Object.keys(context).length > 0 ? { context } : {}),
     ...(abortSignal !== undefined ? { abortSignal } : {}),

[Survived] ConditionalExpression
src/judge/index.ts:112:9
     ...(bundle.workspaceDiff !== undefined ? { workspaceDiff: bundle.workspaceDiff } : {}),
     ...(events !== undefined ? { events } : {}),
     ...(bundle.phases !== undefined ? { phases: bundle.phases } : {}),
-    ...(bundle.agents.length > 0 ? { agents: bundle.agents } : {}),
+    ...(true ? { agents: bundle.agents } : {}),
     ...(Object.keys(context).length > 0 ? { context } : {}),
     ...(abortSignal !== undefined ? { abortSignal } : {}),

[Survived] ConditionalExpression
src/judge/index.ts:113:9
     ...(events !== undefined ? { events } : {}),
     ...(bundle.phases !== undefined ? { phases: bundle.phases } : {}),
     ...(bundle.agents.length > 0 ? { agents: bundle.agents } : {}),
-    ...(Object.keys(context).length > 0 ? { context } : {}),
+    ...(false ? { context } : {}),
     ...(abortSignal !== undefined ? { abortSignal } : {}),
   };

[Survived] ConditionalExpression
src/judge/index.ts:113:9
     ...(events !== undefined ? { events } : {}),
     ...(bundle.phases !== undefined ? { phases: bundle.phases } : {}),
     ...(bundle.agents.length > 0 ? { agents: bundle.agents } : {}),
-    ...(Object.keys(context).length > 0 ? { context } : {}),
+    ...(true ? { context } : {}),
     ...(abortSignal !== undefined ? { abortSignal } : {}),
   };

[Killed] ArrowFunction
src/judge/index.ts:144:59
 
 function renderPrompt(input: JudgeInput): string {
   const target = input.target;
-  const checks = target.requirements.validationChecks.map((c, i) => `${i + 1}. ${c}`).join("\n");
+  const checks = target.requirements.validationChecks.map(() => undefined).join("\n");
   const sections: string[] = [
     `${PROMPT_HEADING.EvaluationTarget} ${target.name}`,
killedBy: AnthropicJudgeBackend prompt content renderPrompt includes scenario name, description, expectedBehavior, and validationChecks
statusReason: StrykerJS: Unknown test failure

[Killed] ArithmeticOperator
src/judge/index.ts:144:72
 
 function renderPrompt(input: JudgeInput): string {
   const target = input.target;
-  const checks = target.requirements.validationChecks.map((c, i) => `${i + 1}. ${c}`).join("\n");
+  const checks = target.requirements.validationChecks.map((c, i) => `${i - 1}. ${c}`).join("\n");
   const sections: string[] = [
     `${PROMPT_HEADING.EvaluationTarget} ${target.name}`,
killedBy: AnthropicJudgeBackend prompt content renderPrompt includes scenario name, description, expectedBehavior, and validationChecks
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/judge/index.ts:145:30
 function renderPrompt(input: JudgeInput): string {
   const target = input.target;
   const checks = target.requirements.validationChecks.map((c, i) => `${i + 1}. ${c}`).join("\n");
-  const sections: string[] = [
-    `${PROMPT_HEADING.EvaluationTarget} ${target.name}`,
-    `${PROMPT_HEADING.DescriptionLine} ${target.description}`,
-    `${PROMPT_HEADING.ExpectedBehaviorLine} ${target.requirements.expectedBehavior}`,
-    "",
-    PROMPT_HEADING.ValidationChecks,
-    checks,
-  ];
+  const sections: string[] = [];
 
   if (input.agents !== undefined && input.agents.length > 0) {
killedBy: AnthropicJudgeBackend prompt content renderPrompt includes scenario name, description, expectedBehavior, and validationChecks
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:146:5
   const target = input.target;
   const checks = target.requirements.validationChecks.map((c, i) => `${i + 1}. ${c}`).join("\n");
   const sections: string[] = [
-    `${PROMPT_HEADING.EvaluationTarget} ${target.name}`,
+    ``,
     `${PROMPT_HEADING.DescriptionLine} ${target.description}`,
     `${PROMPT_HEADING.ExpectedBehaviorLine} ${target.requirements.expectedBehavior}`,
killedBy: AnthropicJudgeBackend prompt content renderPrompt includes scenario name, description, expectedBehavior, and validationChecks
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:147:5
   const checks = target.requirements.validationChecks.map((c, i) => `${i + 1}. ${c}`).join("\n");
   const sections: string[] = [
     `${PROMPT_HEADING.EvaluationTarget} ${target.name}`,
-    `${PROMPT_HEADING.DescriptionLine} ${target.description}`,
+    ``,
     `${PROMPT_HEADING.ExpectedBehaviorLine} ${target.requirements.expectedBehavior}`,
     "",
killedBy: AnthropicJudgeBackend prompt content renderPrompt includes scenario name, description, expectedBehavior, and validationChecks
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:148:5
   const sections: string[] = [
     `${PROMPT_HEADING.EvaluationTarget} ${target.name}`,
     `${PROMPT_HEADING.DescriptionLine} ${target.description}`,
-    `${PROMPT_HEADING.ExpectedBehaviorLine} ${target.requirements.expectedBehavior}`,
+    ``,
     "",
     PROMPT_HEADING.ValidationChecks,
killedBy: AnthropicJudgeBackend prompt content renderPrompt includes scenario name, description, expectedBehavior, and validationChecks
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:149:5
     `${PROMPT_HEADING.EvaluationTarget} ${target.name}`,
     `${PROMPT_HEADING.DescriptionLine} ${target.description}`,
     `${PROMPT_HEADING.ExpectedBehaviorLine} ${target.requirements.expectedBehavior}`,
-    "",
+    "Stryker was here!",
     PROMPT_HEADING.ValidationChecks,
     checks,
killedBy: AnthropicJudgeBackend renderPrompt blank line separators blank line appears between scenario header and Validation checks heading
statusReason: StrykerJS: Unknown test failure

[NoCoverage] EqualityOperator
src/judge/index.ts:154:37
     checks,
   ];
 
-  if (input.agents !== undefined && input.agents.length > 0) {
+  if (input.agents !== undefined && input.agents.length >= 0) {
     sections.push("", PROMPT_HEADING.Agents, renderAgents(input.agents));
   }

[NoCoverage] EqualityOperator
src/judge/index.ts:154:37
     checks,
   ];
 
-  if (input.agents !== undefined && input.agents.length > 0) {
+  if (input.agents !== undefined && input.agents.length <= 0) {
     sections.push("", PROMPT_HEADING.Agents, renderAgents(input.agents));
   }

[NoCoverage] StringLiteral
src/judge/index.ts:155:19
   ];
 
   if (input.agents !== undefined && input.agents.length > 0) {
-    sections.push("", PROMPT_HEADING.Agents, renderAgents(input.agents));
+    sections.push("Stryker was here!", PROMPT_HEADING.Agents, renderAgents(input.agents));
   }
 

[NoCoverage] ConditionalExpression
src/judge/index.ts:158:37
     sections.push("", PROMPT_HEADING.Agents, renderAgents(input.agents));
   }
 
-  if (input.events !== undefined && input.events.length > 0) {
+  if (input.events !== undefined && true) {
     sections.push("", PROMPT_HEADING.EventTimeline, renderEvents(input.events));
   } else {

[NoCoverage] BlockStatement
src/judge/index.ts:158:62
     sections.push("", PROMPT_HEADING.Agents, renderAgents(input.agents));
   }
 
-  if (input.events !== undefined && input.events.length > 0) {
-    sections.push("", PROMPT_HEADING.EventTimeline, renderEvents(input.events));
-  } else {
+  if (input.events !== undefined && input.events.length > 0) {} else {
     sections.push("", PROMPT_HEADING.Transcript, renderTurns(input.turns));
   }

[NoCoverage] StringLiteral
src/judge/index.ts:159:19
   }
 
   if (input.events !== undefined && input.events.length > 0) {
-    sections.push("", PROMPT_HEADING.EventTimeline, renderEvents(input.events));
+    sections.push("Stryker was here!", PROMPT_HEADING.EventTimeline, renderEvents(input.events));
   } else {
     sections.push("", PROMPT_HEADING.Transcript, renderTurns(input.turns));

[Killed] BlockStatement
src/judge/index.ts:160:10
 
   if (input.events !== undefined && input.events.length > 0) {
     sections.push("", PROMPT_HEADING.EventTimeline, renderEvents(input.events));
-  } else {
-    sections.push("", PROMPT_HEADING.Transcript, renderTurns(input.turns));
-  }
+  } else {}
 
   sections.push("", PROMPT_HEADING.WorkspaceDiff, renderDiff(input.workspaceDiff));
killedBy: AnthropicJudgeBackend prompt content renderTurns emits USER and ASSISTANT labels with turn index
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:161:19
   if (input.events !== undefined && input.events.length > 0) {
     sections.push("", PROMPT_HEADING.EventTimeline, renderEvents(input.events));
   } else {
-    sections.push("", PROMPT_HEADING.Transcript, renderTurns(input.turns));
+    sections.push("Stryker was here!", PROMPT_HEADING.Transcript, renderTurns(input.turns));
   }
 
killedBy: AnthropicJudgeBackend renderPrompt section structure prompt sections are joined with newlines (not concatenated)
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:164:17
     sections.push("", PROMPT_HEADING.Transcript, renderTurns(input.turns));
   }
 
-  sections.push("", PROMPT_HEADING.WorkspaceDiff, renderDiff(input.workspaceDiff));
+  sections.push("Stryker was here!", PROMPT_HEADING.WorkspaceDiff, renderDiff(input.workspaceDiff));
 
   if (input.context !== undefined && Object.keys(input.context).length > 0) {
killedBy: AnthropicJudgeBackend renderPrompt section structure prompt sections are joined with newlines (not concatenated)
statusReason: StrykerJS: Unknown test failure

[NoCoverage] EqualityOperator
src/judge/index.ts:166:38
 
   sections.push("", PROMPT_HEADING.WorkspaceDiff, renderDiff(input.workspaceDiff));
 
-  if (input.context !== undefined && Object.keys(input.context).length > 0) {
+  if (input.context !== undefined && Object.keys(input.context).length >= 0) {
     sections.push("", PROMPT_HEADING.Context, JSON.stringify(input.context, null, 2));
   }

[Survived] ConditionalExpression
src/judge/index.ts:166:7
 
   sections.push("", PROMPT_HEADING.WorkspaceDiff, renderDiff(input.workspaceDiff));
 
-  if (input.context !== undefined && Object.keys(input.context).length > 0) {
+  if (true) {
     sections.push("", PROMPT_HEADING.Context, JSON.stringify(input.context, null, 2));
   }

[NoCoverage] StringLiteral
src/judge/index.ts:167:19
   sections.push("", PROMPT_HEADING.WorkspaceDiff, renderDiff(input.workspaceDiff));
 
   if (input.context !== undefined && Object.keys(input.context).length > 0) {
-    sections.push("", PROMPT_HEADING.Context, JSON.stringify(input.context, null, 2));
+    sections.push("Stryker was here!", PROMPT_HEADING.Context, JSON.stringify(input.context, null, 2));
   }
 

[Killed] StringLiteral
src/judge/index.ts:171:24
   }
 
   sections.push("", PROMPT_HEADING.Trailer);
-  return sections.join("\n");
+  return sections.join("");
 }
 
killedBy: AnthropicJudgeBackend renderPrompt section structure prompt sections are joined with newlines (not concatenated)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:196:11
       structured = m.structured_output;
     } else if (m.type === "assistant") {
       const content = m.message.content;
-      if (Array.isArray(content)) {
+      if (false) {
         for (const block of content) {
           if (
killedBy: AnthropicJudgeBackend assembles text from assistant message blocks when no result success message is present
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:199:13
       if (Array.isArray(content)) {
         for (const block of content) {
           if (
-            typeof block === "object" &&
+            typeof block !== "object" &&
             block !== null &&
             "type" in block &&
killedBy: AnthropicJudgeBackend assembles text from assistant message blocks when no result success message is present
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/judge/index.ts:244:42
         maxTurns,
         abortController,
         systemPrompt: { type: "preset", preset: "claude_code", append: systemPrompt },
-        allowDangerouslySkipPermissions: true,
+        allowDangerouslySkipPermissions: false,
       },
     });

[Survived] ArithmeticOperator
src/judge/index.ts:249:22
     });
     const iter = q[Symbol.asyncIterator]();
     const collected: SDKMessage[] = [];
-    const deadline = Date.now() + timeoutMs;
+    const deadline = Date.now() - timeoutMs;
 
     const nextWithTimeout = Effect.tryPromise({

[Killed] ArithmeticOperator
src/judge/index.ts:260:31
         }),
     }).pipe(
       Effect.timeoutFail({
-        duration: Math.max(1, deadline - Date.now()),
+        duration: Math.max(1, deadline + Date.now()),
         onTimeout: () =>
           new JudgeAttemptError({
killedBy: AnthropicJudgeBackend aborts and closes the SDK iterator when a judge attempt times out
statusReason: Test timed out in 10000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] MethodExpression
src/judge/index.ts:260:19
         }),
     }).pipe(
       Effect.timeoutFail({
-        duration: Math.max(1, deadline - Date.now()),
+        duration: Math.min(1, deadline - Date.now()),
         onTimeout: () =>
           new JudgeAttemptError({

[Survived] StringLiteral
src/judge/index.ts:264:22
         onTimeout: () =>
           new JudgeAttemptError({
             kind: "Timeout",
-            message: `per-attempt timeout after ${timeoutMs}ms`,
+            message: ``,
           }),
       }),

[Killed] EqualityOperator
src/judge/index.ts:268:9
           }),
       }),
       Effect.tapError((error) =>
-        error.kind === "Timeout"
+        error.kind !== "Timeout"
           ? Effect.sync(() => {
               abortController.abort();
killedBy: AnthropicJudgeBackend aborts and closes the SDK iterator when a judge attempt times out
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:268:9
           }),
       }),
       Effect.tapError((error) =>
-        error.kind === "Timeout"
+        false
           ? Effect.sync(() => {
               abortController.abort();
killedBy: AnthropicJudgeBackend aborts and closes the SDK iterator when a judge attempt times out
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:269:31
       }),
       Effect.tapError((error) =>
         error.kind === "Timeout"
-          ? Effect.sync(() => {
-              abortController.abort();
-            }).pipe(
+          ? Effect.sync(() => {}).pipe(
               Effect.zipRight(
                 Effect.tryPromise({
killedBy: AnthropicJudgeBackend aborts and closes the SDK iterator when a judge attempt times out
statusReason: StrykerJS: Unknown test failure

[Survived] OptionalChaining
src/judge/index.ts:274:30
             }).pipe(
               Effect.zipRight(
                 Effect.tryPromise({
-                  try: () => iter.return?.() ?? Promise.resolve(undefined),
+                  try: () => iter.return() ?? Promise.resolve(undefined),
                   catch: (returnError) => returnError,
                 }).pipe(

[Survived] ArrowFunction
src/judge/index.ts:275:26
               Effect.zipRight(
                 Effect.tryPromise({
                   try: () => iter.return?.() ?? Promise.resolve(undefined),
-                  catch: (returnError) => returnError,
+                  catch: () => undefined,
                 }).pipe(
                   Effect.catchAll((returnError) => {

[Killed] ConditionalExpression
src/judge/index.ts:304:42
 
 function parseVerdict(parsed: ParsedAssistantResult): Effect.Effect<JudgeResult, JudgeAttemptError, never> {
   let value: unknown;
-  if (parsed.structured !== undefined && parsed.structured !== null) {
+  if (parsed.structured !== undefined && true) {
     value = parsed.structured;
   } else {
killedBy: AnthropicJudgeBackend parseVerdict / buildResult structured=null falls back to text path (not treated as valid value)
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/judge/index.ts:304:7
 
 function parseVerdict(parsed: ParsedAssistantResult): Effect.Effect<JudgeResult, JudgeAttemptError, never> {
   let value: unknown;
-  if (parsed.structured !== undefined && parsed.structured !== null) {
+  if (parsed.structured !== undefined || parsed.structured !== null) {
     value = parsed.structured;
   } else {
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:306:10
   let value: unknown;
   if (parsed.structured !== undefined && parsed.structured !== null) {
     value = parsed.structured;
-  } else {
-    const raw = extractJsonText(parsed.text);
-    if (raw.length === 0) {
-      return Effect.fail(
-        new JudgeAttemptError({
-          kind: "NoOutput",
-          message: "judge model returned empty output",
-        }),
-      );
-    }
-    try {
-      value = JSON.parse(raw);
-    } catch (err) {
-      return Effect.fail(
-        new JudgeAttemptError({
-          kind: "MalformedJson",
-          message: err instanceof Error ? err.message : String(err),
-        }),
-      );
-    }
-  }
+  } else {}
   return buildResult(value, 0);
 }
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:308:27
     value = parsed.structured;
   } else {
     const raw = extractJsonText(parsed.text);
-    if (raw.length === 0) {
-      return Effect.fail(
-        new JudgeAttemptError({
-          kind: "NoOutput",
-          message: "judge model returned empty output",
-        }),
-      );
-    }
+    if (raw.length === 0) {}
     try {
       value = JSON.parse(raw);
killedBy: AnthropicJudgeBackend folds empty text output into critical after retries exhausted
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:308:9
     value = parsed.structured;
   } else {
     const raw = extractJsonText(parsed.text);
-    if (raw.length === 0) {
+    if (false) {
       return Effect.fail(
         new JudgeAttemptError({
killedBy: AnthropicJudgeBackend folds empty text output into critical after retries exhausted
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:312:20
       return Effect.fail(
         new JudgeAttemptError({
           kind: "NoOutput",
-          message: "judge model returned empty output",
+          message: "",
         }),
       );
killedBy: AnthropicJudgeBackend parseVerdict / buildResult NoOutput error message contains 'empty output' context
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:318:19
     }
     try {
       value = JSON.parse(raw);
-    } catch (err) {
-      return Effect.fail(
-        new JudgeAttemptError({
-          kind: "MalformedJson",
-          message: err instanceof Error ? err.message : String(err),
-        }),
-      );
-    }
+    } catch (err) {}
   }
   return buildResult(value, 0);
killedBy: AnthropicJudgeBackend folds malformed JSON into critical after retries exhausted
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/judge/index.ts:344:54
   }
   const raw: RawJudgeVerdict = value;
   const candidate = {
-    pass: typeof raw.pass === "boolean" ? raw.pass : false,
+    pass: typeof raw.pass === "boolean" ? raw.pass : true,
     reason: typeof raw.reason === "string" ? raw.reason : "",
     issues: coerceIssues(raw.issues),
killedBy: AnthropicJudgeBackend folds schema-invalid verdict (wrong type for pass) into critical after retries
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:344:11
   }
   const raw: RawJudgeVerdict = value;
   const candidate = {
-    pass: typeof raw.pass === "boolean" ? raw.pass : false,
+    pass: true ? raw.pass : false,
     reason: typeof raw.reason === "string" ? raw.reason : "",
     issues: coerceIssues(raw.issues),
killedBy: AnthropicJudgeBackend folds schema-invalid verdict (wrong type for pass) into critical after retries
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:345:13
   const raw: RawJudgeVerdict = value;
   const candidate = {
     pass: typeof raw.pass === "boolean" ? raw.pass : false,
-    reason: typeof raw.reason === "string" ? raw.reason : "",
+    reason: true ? raw.reason : "",
     issues: coerceIssues(raw.issues),
     overallSeverity: coerceSeverity(raw.overallSeverity),
killedBy: AnthropicJudgeBackend parseVerdict / buildResult reason defaults to empty string when raw.reason is non-string
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/judge/index.ts:351:26
     judgeConfidence: coerceConfidence(raw.judgeConfidence),
     retryCount,
   };
-  const errs: string[] = [];
+  const errs: string[] = ["Stryker was here"];
   for (const e of Value.Errors(JudgeResultSchema, candidate)) {
     errs.push(`${e.path} ${e.message}`);
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[NoCoverage] StringLiteral
src/judge/index.ts:359:28
     return Effect.fail(
       new JudgeAttemptError({
         kind: "SchemaInvalid",
-        message: errs.join("; "),
+        message: errs.join(""),
       }),
     );

[Killed] StringLiteral
src/judge/index.ts:389:14
   retryCount: number,
 ): JudgeResult {
   const issues: ReadonlyArray<Issue> = [
-    { issue: `judge ${err.kind}: ${err.message}`, severity: "critical" },
+    { issue: ``, severity: "critical" },
   ];
   return {
killedBy: AnthropicJudgeBackend fails fast on ResultError instead of retrying explicit Claude failures
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:425:33
     timeoutMs,
   ).pipe(
     Effect.flatMap((messages) => {
-      for (const m of messages) {
-        if (m.type === "result" && m.subtype !== "success") {
-          return Effect.fail(
-            new JudgeAttemptError({
-              kind: "ResultError",
-              message: m.errors.length > 0 ? m.errors.join("; ") : m.subtype,
-            }),
-          );
-        }
-      }
+      for (const m of messages) {}
       return parseVerdict(collectAssistantText(messages));
     }),
killedBy: AnthropicJudgeBackend fails fast on ResultError instead of retrying explicit Claude failures
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:426:61
   ).pipe(
     Effect.flatMap((messages) => {
       for (const m of messages) {
-        if (m.type === "result" && m.subtype !== "success") {
-          return Effect.fail(
-            new JudgeAttemptError({
-              kind: "ResultError",
-              message: m.errors.length > 0 ? m.errors.join("; ") : m.subtype,
-            }),
-          );
-        }
+        if (m.type === "result" && m.subtype !== "success") {}
       }
       return parseVerdict(collectAssistantText(messages));
killedBy: AnthropicJudgeBackend fails fast on ResultError instead of retrying explicit Claude failures
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:430:24
           return Effect.fail(
             new JudgeAttemptError({
               kind: "ResultError",
-              message: m.errors.length > 0 ? m.errors.join("; ") : m.subtype,
+              message: m.errors.length <= 0 ? m.errors.join("; ") : m.subtype,
             }),
           );
killedBy: AnthropicJudgeBackend fails fast on ResultError instead of retrying explicit Claude failures
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:430:24
           return Effect.fail(
             new JudgeAttemptError({
               kind: "ResultError",
-              message: m.errors.length > 0 ? m.errors.join("; ") : m.subtype,
+              message: m.errors.length >= 0 ? m.errors.join("; ") : m.subtype,
             }),
           );
killedBy: AnthropicJudgeBackend runAttempt ResultError branch ResultError with empty errors array uses subtype as message
statusReason: StrykerJS: Unknown test failure

[NoCoverage] EqualityOperator
src/judge/index.ts:464:53
     const schedule = this.#retrySchedule;
     const basePrompt = this.#systemPrompt;
     const rubric = input.target.requirements.judgeRubric;
-    const effectivePrompt = rubric !== undefined && rubric.length > 0
+    const effectivePrompt = rubric !== undefined && rubric.length <= 0
       ? `${basePrompt}\n\n${rubric}`
       : basePrompt;

[Survived] ConditionalExpression
src/judge/index.ts:464:29
     const schedule = this.#retrySchedule;
     const basePrompt = this.#systemPrompt;
     const rubric = input.target.requirements.judgeRubric;
-    const effectivePrompt = rubric !== undefined && rubric.length > 0
+    const effectivePrompt = true
       ? `${basePrompt}\n\n${rubric}`
       : basePrompt;

[NoCoverage] StringLiteral
src/judge/index.ts:465:9
     const basePrompt = this.#systemPrompt;
     const rubric = input.target.requirements.judgeRubric;
     const effectivePrompt = rubric !== undefined && rubric.length > 0
-      ? `${basePrompt}\n\n${rubric}`
+      ? ``
       : basePrompt;
 

[Killed] EqualityOperator
src/judge/index.ts:474:14
         kind: "NoOutput",
         message: "no attempts ran",
       });
-      while (attempt <= schedule.length) {
+      while (attempt > schedule.length) {
         if (attempt > 0) {
           const delay = schedule[attempt - 1] ?? 0;
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:474:14
         kind: "NoOutput",
         message: "no attempts ran",
       });
-      while (attempt <= schedule.length) {
+      while (attempt < schedule.length) {
         if (attempt > 0) {
           const delay = schedule[attempt - 1] ?? 0;
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[Survived] BlockStatement
src/judge/index.ts:475:26
         message: "no attempts ran",
       });
       while (attempt <= schedule.length) {
-        if (attempt > 0) {
-          const delay = schedule[attempt - 1] ?? 0;
-          yield* sleepEff(delay);
-        }
+        if (attempt > 0) {}
         const result = yield* runAttempt(
           input,

[Killed] BlockStatement
src/judge/index.ts:495:45
         );
         if (result.success) return result.verdict;
         lastErr = result.error;
-        if (lastErr.kind === "ResultError") {
-          return criticalFallback(lastErr, attempt);
-        }
+        if (lastErr.kind === "ResultError") {}
         attempt += 1;
       }
killedBy: AnthropicJudgeBackend fails fast on ResultError instead of retrying explicit Claude failures
statusReason: StrykerJS: Unknown test failure
