[Killed] EqualityOperator
src/judge/index.ts:495:13
         );
         if (result.success) return result.verdict;
         lastErr = result.error;
-        if (lastErr.kind === "ResultError") {
+        if (lastErr.kind !== "ResultError") {
           return criticalFallback(lastErr, attempt);
         }
killedBy: AnthropicJudgeBackend folds empty text output into critical after retries exhausted
statusReason: StrykerJS: Unknown test failure
