[Killed] BooleanLiteral
src/plans/compiler.ts:67:57
 }
 
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return typeof value === "object" && value !== null && Array.isArray(value);
 }
 
killedBy: planned harness compiler + cli ingress compiles loaded documents into planned run inputs
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/plans/compiler.ts:67:10
 }
 
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return false;
 }
 
killedBy: planned harness compiler + cli ingress compiles loaded documents into planned run inputs
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/plans/compiler.ts:71:10
 }
 
 function isExternalHarnessModule(value: unknown): value is ExternalHarnessModule {
-  return isRecord(value) && typeof value["load"] === "function";
+  return false;
 }
 
killedBy: planned harness compiler + cli ingress compiles loaded documents into planned run inputs
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/plans/compiler.ts:71:29
 }
 
 function isExternalHarnessModule(value: unknown): value is ExternalHarnessModule {
-  return isRecord(value) && typeof value["load"] === "function";
+  return isRecord(value) && typeof value["load"] !== "function";
 }
 
killedBy: planned harness compiler + cli ingress compiles loaded documents into planned run inputs
statusReason: StrykerJS: Unknown test failure

[Survived] StringLiteral
src/plans/compiler.ts:103:24
   const exportName = document.document.harness.export ?? "default";
   return resolveModulePath(document).pipe(
     Effect.flatMap((resolvedPath) => {
-      const cacheKey = `${resolvedPath}#${exportName}`;
+      const cacheKey = ``;
       const cached = cache.get(cacheKey);
       if (cached !== undefined) {

[NoCoverage] BlockStatement
src/plans/compiler.ts:105:33
     Effect.flatMap((resolvedPath) => {
       const cacheKey = `${resolvedPath}#${exportName}`;
       const cached = cache.get(cacheKey);
-      if (cached !== undefined) {
-        return Effect.succeed(cached);
-      }
+      if (cached !== undefined) {}
       return Effect.tryPromise({
         try: () => import(pathToFileURL(resolvedPath).href),

[Killed] EqualityOperator
src/plans/compiler.ts:115:15
       }).pipe(
         Effect.flatMap((namespaceObject) => {
           const exported = readNamedExport(namespaceObject, exportName);
-          if (exported === undefined) {
+          if (exported !== undefined) {
             return Effect.fail(
               new PlannedHarnessIngressError({
killedBy: planned harness compiler + cli ingress compiles loaded documents into planned run inputs
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/plans/compiler.ts:115:15
       }).pipe(
         Effect.flatMap((namespaceObject) => {
           const exported = readNamedExport(namespaceObject, exportName);
-          if (exported === undefined) {
+          if (false) {
             return Effect.fail(
               new PlannedHarnessIngressError({

[Survived] ConditionalExpression
src/plans/compiler.ts:164:15
           name: document.document.name,
           description: document.document.description,
           requirements: document.document.requirements,
-          ...(document.document.metadata !== undefined
+          ...(true
             ? { metadata: document.document.metadata }
             : {}),

[Survived] EqualityOperator
src/plans/compiler.ts:164:15
           name: document.document.name,
           description: document.document.description,
           requirements: document.document.requirements,
-          ...(document.document.metadata !== undefined
+          ...(document.document.metadata === undefined
             ? { metadata: document.document.metadata }
             : {}),

[NoCoverage] ObjectLiteral
src/plans/compiler.ts:165:15
           description: document.document.description,
           requirements: document.document.requirements,
           ...(document.document.metadata !== undefined
-            ? { metadata: document.document.metadata }
+            ? {}
             : {}),
         },

[Killed] BlockStatement
src/plans/compiler.ts:195:9
 ): Effect.Effect<PlannedRunInput, PlannedHarnessIngressError, never> {
   return Effect.suspend(() => {
     let loadResult: unknown;
-    try {
-      loadResult = imported.module.load(args);
-    } catch (error) {
+    try {} catch (error) {
       return Effect.fail(
         harnessLoadFailed(
killedBy: planned harness compiler + cli ingress compiles loaded documents into planned run inputs
statusReason: StrykerJS: Unknown test failure

[Survived] BlockStatement
src/plans/compiler.ts:197:21
     let loadResult: unknown;
     try {
       loadResult = imported.module.load(args);
-    } catch (error) {
-      return Effect.fail(
-        harnessLoadFailed(
-          document.sourcePath,
-          document.document.harness.module,
-          `harness load() threw synchronously: ${error instanceof Error ? error.message : String(error)}`,
-        ),
-      );
-    }
+    } catch (error) {}
     if (
       loadResult === null ||

[Killed] LogicalOperator
src/plans/compiler.ts:207:7
       );
     }
     if (
-      loadResult === null ||
-      typeof loadResult !== "object" ||
+      loadResult === null && typeof loadResult !== "object" ||
       typeof (loadResult as { pipe?: unknown }).pipe !== "function"
     ) {
killedBy: planned harness compiler + cli ingress compiler errors when load() returns null
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/plans/compiler.ts:207:7
       );
     }
     if (
-      loadResult === null ||
-      typeof loadResult !== "object" ||
-      typeof (loadResult as { pipe?: unknown }).pipe !== "function"
+      false
     ) {
       const got =
killedBy: planned harness compiler + cli ingress compiler maps a non-Effect return value from load() to a typed error
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/plans/compiler.ts:208:7
     }
     if (
       loadResult === null ||
-      typeof loadResult !== "object" ||
+      typeof loadResult === "object" ||
       typeof (loadResult as { pipe?: unknown }).pipe !== "function"
     ) {
killedBy: planned harness compiler + cli ingress compiles loaded documents into planned run inputs
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/plans/compiler.ts:208:7
     }
     if (
       loadResult === null ||
-      typeof loadResult !== "object" ||
+      false ||
       typeof (loadResult as { pipe?: unknown }).pipe !== "function"
     ) {

[Killed] EqualityOperator
src/plans/compiler.ts:209:7
     if (
       loadResult === null ||
       typeof loadResult !== "object" ||
-      typeof (loadResult as { pipe?: unknown }).pipe !== "function"
+      typeof (loadResult as {
+  pipe?: unknown;
+}).pipe === "function"
     ) {
       const got =
killedBy: planned harness compiler + cli ingress compiles loaded documents into planned run inputs
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/plans/compiler.ts:209:7
     if (
       loadResult === null ||
       typeof loadResult !== "object" ||
-      typeof (loadResult as { pipe?: unknown }).pipe !== "function"
+      false
     ) {
       const got =
killedBy: planned harness compiler + cli ingress compiler maps a non-Effect return value from load() to a typed error
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/plans/compiler.ts:210:7
       loadResult === null ||
       typeof loadResult !== "object" ||
       typeof (loadResult as { pipe?: unknown }).pipe !== "function"
-    ) {
-      const got =
-        loadResult !== null &&
-        typeof loadResult === "object" &&
-        typeof (loadResult as { then?: unknown }).then === "function"
-          ? "Promise (did you accidentally mark load() async?)"
-          : loadResult === null
-            ? "null"
-            : typeof loadResult;
-      return Effect.fail(
-        harnessLoadFailed(
-          document.sourcePath,
-          document.document.harness.module,
-          `harness load() must return an Effect; got ${got}`,
-        ),
-      );
-    }
+    ) {}
     const loadEff = loadResult as Effect.Effect<PlannedRunInput, HarnessPlanError, never>;
     return loadEff.pipe(
killedBy: planned harness compiler + cli ingress compiler maps a non-Effect return value from load() to a typed error
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/plans/compiler.ts:212:9
       typeof (loadResult as { pipe?: unknown }).pipe !== "function"
     ) {
       const got =
-        loadResult !== null &&
-        typeof loadResult === "object" &&
-        typeof (loadResult as { then?: unknown }).then === "function"
+        loadResult !== null && typeof loadResult === "object" || typeof (loadResult as {
+  then?: unknown;
+}).then === "function"
           ? "Promise (did you accidentally mark load() async?)"
           : loadResult === null
killedBy: planned harness compiler + cli ingress compiler errors when load() returns null
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/plans/compiler.ts:212:9
       typeof (loadResult as { pipe?: unknown }).pipe !== "function"
     ) {
       const got =
-        loadResult !== null &&
-        typeof loadResult === "object" &&
+        true &&
         typeof (loadResult as { then?: unknown }).then === "function"
           ? "Promise (did you accidentally mark load() async?)"
killedBy: planned harness compiler + cli ingress compiler errors when load() returns null
statusReason: StrykerJS: Unknown test failure

[Survived] EqualityOperator
src/plans/compiler.ts:213:9
     ) {
       const got =
         loadResult !== null &&
-        typeof loadResult === "object" &&
+        typeof loadResult !== "object" &&
         typeof (loadResult as { then?: unknown }).then === "function"
           ? "Promise (did you accidentally mark load() async?)"

[Survived] ConditionalExpression
src/plans/compiler.ts:213:9
     ) {
       const got =
         loadResult !== null &&
-        typeof loadResult === "object" &&
+        true &&
         typeof (loadResult as { then?: unknown }).then === "function"
           ? "Promise (did you accidentally mark load() async?)"

[Survived] EqualityOperator
src/plans/compiler.ts:214:9
       const got =
         loadResult !== null &&
         typeof loadResult === "object" &&
-        typeof (loadResult as { then?: unknown }).then === "function"
+        typeof (loadResult as {
+  then?: unknown;
+}).then !== "function"
           ? "Promise (did you accidentally mark load() async?)"
           : loadResult === null

[Survived] ConditionalExpression
src/plans/compiler.ts:214:9
       const got =
         loadResult !== null &&
         typeof loadResult === "object" &&
-        typeof (loadResult as { then?: unknown }).then === "function"
+        true
           ? "Promise (did you accidentally mark load() async?)"
           : loadResult === null

[Survived] ConditionalExpression
src/plans/compiler.ts:216:13
         typeof loadResult === "object" &&
         typeof (loadResult as { then?: unknown }).then === "function"
           ? "Promise (did you accidentally mark load() async?)"
-          : loadResult === null
+          : true
             ? "null"
             : typeof loadResult;

[Survived] EqualityOperator
src/plans/compiler.ts:216:13
         typeof loadResult === "object" &&
         typeof (loadResult as { then?: unknown }).then === "function"
           ? "Promise (did you accidentally mark load() async?)"
-          : loadResult === null
+          : loadResult !== null
             ? "null"
             : typeof loadResult;

[Survived] StringLiteral
src/plans/compiler.ts:223:11
         harnessLoadFailed(
           document.sourcePath,
           document.document.harness.module,
-          `harness load() must return an Effect; got ${got}`,
+          ``,
         ),
       );

[Survived] StringLiteral
src/plans/compiler.ts:241:13
           harnessLoadFailed(
             document.sourcePath,
             document.document.harness.module,
-            `harness load() effect produced an uncaught defect: ${defect instanceof Error ? defect.message : String(defect)}`,
+            ``,
           ),
         ),
