[Killed] Regex
src/plans/loader.ts:20:10
 const YAML_GLOB = "**/*.{yaml,yml}";
 
 function isGlobPattern(value: string): boolean {
-  return /[*?[\]{}]/.test(value);
+  return /[^*?[\]{}]/.test(value);
 }
 
killedBy: planned harness loader returns FileNotFound for a missing non-glob path
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BooleanLiteral
src/plans/loader.ts:40:59
     try: () =>
       doGlob(
         pattern,
-        cwd !== undefined ? { cwd, absolute: true, nodir: true } : { absolute: true, nodir: true },
+        cwd !== undefined ? { cwd, absolute: true, nodir: false } : { absolute: true, nodir: true },
       ),
     catch: (error) => {

[Survived] BooleanLiteral
src/plans/loader.ts:40:80
     try: () =>
       doGlob(
         pattern,
-        cwd !== undefined ? { cwd, absolute: true, nodir: true } : { absolute: true, nodir: true },
+        cwd !== undefined ? { cwd, absolute: true, nodir: true } : { absolute: false, nodir: true },
       ),
     catch: (error) => {

[Killed] MethodExpression
src/plans/loader.ts:46:35
       const syntheticPath = PlanFilePathBrand(path.resolve(pattern));
       return parseFailure(syntheticPath, error);
     },
-  }).pipe(Effect.map((matches) => matches.slice().sort()));
+  }).pipe(Effect.map((matches) => matches.slice()));
 
 const statEff = (
killedBy: planned harness loader rejects duplicate scenario ids across matched files
statusReason: StrykerJS: Unknown test failure

[Survived] MethodExpression
src/plans/loader.ts:46:35
       const syntheticPath = PlanFilePathBrand(path.resolve(pattern));
       return parseFailure(syntheticPath, error);
     },
-  }).pipe(Effect.map((matches) => matches.slice().sort()));
+  }).pipe(Effect.map((matches) => matches.sort()));
 
 const statEff = (

[Killed] ConditionalExpression
src/plans/loader.ts:71:9
     if (entry === null) {
       return [];
     }
-    if (entry.isDirectory) {
+    if (true) {
       return yield* globEff(YAML_GLOB, abs);
     }
killedBy: planned harness loader returns ParseFailure for malformed yaml
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/plans/loader.ts:71:9
     if (entry === null) {
       return [];
     }
-    if (entry.isDirectory) {
+    if (false) {
       return yield* globEff(YAML_GLOB, abs);
     }

[Killed] ArrayDeclaration
src/plans/loader.ts:74:12
     if (entry.isDirectory) {
       return yield* globEff(YAML_GLOB, abs);
     }
-    return [abs];
+    return [];
   });
 
killedBy: planned harness loader returns ParseFailure for malformed yaml
statusReason: StrykerJS: Unknown test failure

[NoCoverage] ConditionalExpression
src/plans/loader.ts:83:11
     catch: (error) =>
       new PlannedHarnessIngressError({
         cause:
-          error instanceof Error &&
-          "code" in error &&
-          (error as { readonly code?: string }).code === "ENOENT"
+          false
             ? PlannedHarnessIngressErrorCause.FileNotFound({ path: pathValue })
             : PlannedHarnessIngressErrorCause.ParseFailure({

[NoCoverage] ConditionalExpression
src/plans/loader.ts:83:11
     catch: (error) =>
       new PlannedHarnessIngressError({
         cause:
-          error instanceof Error &&
-          "code" in error &&
+          true &&
           (error as { readonly code?: string }).code === "ENOENT"
             ? PlannedHarnessIngressErrorCause.FileNotFound({ path: pathValue })

[NoCoverage] EqualityOperator
src/plans/loader.ts:85:11
         cause:
           error instanceof Error &&
           "code" in error &&
-          (error as { readonly code?: string }).code === "ENOENT"
+          (error as {
+  readonly code?: string;
+}).code !== "ENOENT"
             ? PlannedHarnessIngressErrorCause.FileNotFound({ path: pathValue })
             : PlannedHarnessIngressErrorCause.ParseFailure({

[NoCoverage] ConditionalExpression
src/plans/loader.ts:85:11
         cause:
           error instanceof Error &&
           "code" in error &&
-          (error as { readonly code?: string }).code === "ENOENT"
+          true
             ? PlannedHarnessIngressErrorCause.FileNotFound({ path: pathValue })
             : PlannedHarnessIngressErrorCause.ParseFailure({

[Killed] BlockStatement
src/plans/loader.ts:124:37
   documents: ReadonlyArray<LoadedHarnessPlanDocument>,
 ): Effect.Effect<ReadonlyArray<LoadedHarnessPlanDocument>, PlannedHarnessIngressError, never> {
   const seen = new Map<string, PlanFilePath>();
-  for (const document of documents) {
-    const scenarioId = document.document.scenarioId;
-    const previousPath = seen.get(scenarioId);
-    if (previousPath !== undefined) {
-      return Effect.fail(
-        new PlannedHarnessIngressError({
-          cause: PlannedHarnessIngressErrorCause.DuplicateScenarioId({
-            scenarioId,
-            paths: [previousPath, document.sourcePath],
-          }),
-        }),
-      );
-    }
-    seen.set(scenarioId, document.sourcePath);
-  }
+  for (const document of documents) {}
   return Effect.succeed(documents);
 }
killedBy: planned harness loader rejects duplicate scenario ids across matched files
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/plans/loader.ts:127:37
   for (const document of documents) {
     const scenarioId = document.document.scenarioId;
     const previousPath = seen.get(scenarioId);
-    if (previousPath !== undefined) {
-      return Effect.fail(
-        new PlannedHarnessIngressError({
-          cause: PlannedHarnessIngressErrorCause.DuplicateScenarioId({
-            scenarioId,
-            paths: [previousPath, document.sourcePath],
-          }),
-        }),
-      );
-    }
+    if (previousPath !== undefined) {}
     seen.set(scenarioId, document.sourcePath);
   }
killedBy: planned harness loader rejects duplicate scenario ids across matched files
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/plans/loader.ts:151:11
 > {
   return resolvePaths(pathOrGlob).pipe(
     Effect.flatMap((paths) => {
-      if (paths.length === 0) {
+      if (paths.length !== 0) {
         return isGlobPattern(pathOrGlob)
           ? Effect.fail(
killedBy: planned harness loader returns FileNotFound for a missing non-glob path
statusReason: StrykerJS: Unknown test failure
