[Killed] EqualityOperator
src/plans/schema.ts:132:39
 }
 
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return typeof value === "object" && value === null && !Array.isArray(value);
 }
 
killedBy: planned harness schema decodes one planned-harness document from YAML
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/plans/schema.ts:132:10
 }
 
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return typeof value !== "object" && value !== null && !Array.isArray(value);
 }
 
killedBy: planned harness schema decodes one planned-harness document from YAML
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/plans/schema.ts:141:7
   originPath: PlanFilePath,
 ): Effect.Effect<T, PlannedHarnessIngressError, never> {
   const errors = formatSchemaErrors(Value.Errors(schema, source));
-  if (errors.length > 0) {
+  if (errors.length <= 0) {
     return Effect.fail(schemaInvalid(originPath, errors));
   }
killedBy: planned harness schema decodes one planned-harness document from YAML
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/plans/schema.ts:141:7
   originPath: PlanFilePath,
 ): Effect.Effect<T, PlannedHarnessIngressError, never> {
   const errors = formatSchemaErrors(Value.Errors(schema, source));
-  if (errors.length > 0) {
+  if (true) {
     return Effect.fail(schemaInvalid(originPath, errors));
   }
killedBy: planned harness schema decodes one planned-harness document from YAML
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/plans/schema.ts:152:9
 ): HarnessModuleSpec {
   return {
     module: decoded.module,
-    ...(decoded.export !== undefined ? { export: decoded.export } : {}),
+    ...(decoded.export === undefined ? { export: decoded.export } : {}),
     ...("payload" in decoded ? { payload: decoded.payload } : {}),
   };
killedBy: planned harness compiler + cli ingress returns exit 2 when harness export is missing
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/plans/schema.ts:152:9
 ): HarnessModuleSpec {
   return {
     module: decoded.module,
-    ...(decoded.export !== undefined ? { export: decoded.export } : {}),
+    ...(false ? { export: decoded.export } : {}),
     ...("payload" in decoded ? { payload: decoded.payload } : {}),
   };
killedBy: planned harness compiler + cli ingress returns exit 2 when harness export is missing
statusReason: StrykerJS: Unknown test failure

[Survived] EqualityOperator
src/plans/schema.ts:166:9
     name: decoded.name,
     description: decoded.description,
     requirements: decoded.requirements,
-    ...(decoded.metadata !== undefined ? { metadata: decoded.metadata } : {}),
+    ...(decoded.metadata === undefined ? { metadata: decoded.metadata } : {}),
     harness: toHarnessModuleSpec(decoded.harness),
   };

[Survived] ConditionalExpression
src/plans/schema.ts:166:9
     name: decoded.name,
     description: decoded.description,
     requirements: decoded.requirements,
-    ...(decoded.metadata !== undefined ? { metadata: decoded.metadata } : {}),
+    ...(true ? { metadata: decoded.metadata } : {}),
     harness: toHarnessModuleSpec(decoded.harness),
   };

[Killed] ConditionalExpression
src/plans/schema.ts:175:7
   source: unknown,
   originPath: PlanFilePath,
 ): Effect.Effect<SharedHarnessPlanDocument, PlannedHarnessIngressError, never> {
-  if (!isRecord(source) || !("harness" in source)) {
+  if (true) {
     return Effect.fail(
       new PlannedHarnessIngressError({
killedBy: planned harness schema decodes one planned-harness document from YAML
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/plans/schema.ts:175:28
   source: unknown,
   originPath: PlanFilePath,
 ): Effect.Effect<SharedHarnessPlanDocument, PlannedHarnessIngressError, never> {
-  if (!isRecord(source) || !("harness" in source)) {
+  if (!isRecord(source) || "harness" in source) {
     return Effect.fail(
       new PlannedHarnessIngressError({
killedBy: planned harness schema decodes one planned-harness document from YAML
statusReason: StrykerJS: Unknown test failure
