[Killed] ArrowFunction
src/runner/coordinator.ts:98:22
       plan.agents,
       (agent) =>
         this.#runtime.prepare(agent, plan).pipe(
-          Effect.tap((handle) =>
-            Effect.sync(() => {
-              handles.push(handle);
-            }),
+          Effect.tap(() => undefined,
           ),
         ),
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:99:31
       (agent) =>
         this.#runtime.prepare(agent, plan).pipe(
           Effect.tap((handle) =>
-            Effect.sync(() => {
-              handles.push(handle);
-            }),
+            Effect.sync(() => {}),
           ),
         ),
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Survived] MethodExpression
src/runner/coordinator.ts:119:24
       Effect.mapError((error) => mapRunCoordinationError(error)),
       Effect.ensuring(
         Effect.forEach(handles, (handle) => this.#runtime.stop(handle), {
-          concurrency: Math.max(1, handles.length),
+          concurrency: Math.min(1, handles.length),
           discard: true,
         }),

[Survived] BooleanLiteral
src/runner/coordinator.ts:120:20
       Effect.ensuring(
         Effect.forEach(handles, (handle) => this.#runtime.stop(handle), {
           concurrency: Math.max(1, handles.length),
-          discard: true,
+          discard: false,
         }),
       ),

[Killed] BlockStatement
src/runner/coordinator.ts:142:36
     opts: { readonly abortSignal?: AbortSignal },
   ): Effect.Effect<void, HarnessExecutionError | AgentRunTimeoutError, never> {
     const config = this.#config;
-    return Effect.gen(function* () {
-      const perAgentDiffs = new Map<AgentId, WorkspaceDiff>();
-      yield* Effect.forEach(
-        plan.agents,
-        (agent) =>
-          runPromptSequence(agent.id, execution, sink, config, opts.abortSignal).pipe(
-            Effect.tap(({ diff }) =>
-              Effect.sync(() => {
-                perAgentDiffs.set(agent.id, diff);
-              }),
-            ),
-          ),
-        { concurrency: plan.agents.length, discard: true },
-      );
-      if (plan.agents.length === 1) {
-        const onlyAgent = plan.agents[0];
-        const diff = onlyAgent !== undefined ? perAgentDiffs.get(onlyAgent.id) : undefined;
-        if (diff !== undefined) {
-          yield* sink.setWorkspaceDiff(diff).pipe(Effect.mapError(bundleBuildToHarness));
-        }
-        return;
-      }
-      const workspaceDiffByAgent = Object.fromEntries(perAgentDiffs.entries());
-      yield* sink.recordContextPatch({ workspaceDiffByAgent }).pipe(Effect.mapError(bundleBuildToHarness));
-    });
+    return Effect.gen(function* () {});
   }
 }
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] ArrowFunction
src/runner/coordinator.ts:148:24
         plan.agents,
         (agent) =>
           runPromptSequence(agent.id, execution, sink, config, opts.abortSignal).pipe(
-            Effect.tap(({ diff }) =>
-              Effect.sync(() => {
-                perAgentDiffs.set(agent.id, diff);
-              }),
+            Effect.tap(() => undefined,
             ),
           ),
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:149:33
         (agent) =>
           runPromptSequence(agent.id, execution, sink, config, opts.abortSignal).pipe(
             Effect.tap(({ diff }) =>
-              Effect.sync(() => {
-                perAgentDiffs.set(agent.id, diff);
-              }),
+              Effect.sync(() => {}),
             ),
           ),
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/runner/coordinator.ts:154:53
               }),
             ),
           ),
-        { concurrency: plan.agents.length, discard: true },
+        { concurrency: plan.agents.length, discard: false },
       );
       if (plan.agents.length === 1) {

[Killed] ConditionalExpression
src/runner/coordinator.ts:156:11
           ),
         { concurrency: plan.agents.length, discard: true },
       );
-      if (plan.agents.length === 1) {
+      if (true) {
         const onlyAgent = plan.agents[0];
         const diff = onlyAgent !== undefined ? perAgentDiffs.get(onlyAgent.id) : undefined;
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/coordinator.ts:156:11
           ),
         { concurrency: plan.agents.length, discard: true },
       );
-      if (plan.agents.length === 1) {
+      if (plan.agents.length !== 1) {
         const onlyAgent = plan.agents[0];
         const diff = onlyAgent !== undefined ? perAgentDiffs.get(onlyAgent.id) : undefined;
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[NoCoverage] ConditionalExpression
src/runner/coordinator.ts:158:22
       );
       if (plan.agents.length === 1) {
         const onlyAgent = plan.agents[0];
-        const diff = onlyAgent !== undefined ? perAgentDiffs.get(onlyAgent.id) : undefined;
+        const diff = true ? perAgentDiffs.get(onlyAgent.id) : undefined;
         if (diff !== undefined) {
           yield* sink.setWorkspaceDiff(diff).pipe(Effect.mapError(bundleBuildToHarness));

[NoCoverage] ConditionalExpression
src/runner/coordinator.ts:158:22
       );
       if (plan.agents.length === 1) {
         const onlyAgent = plan.agents[0];
-        const diff = onlyAgent !== undefined ? perAgentDiffs.get(onlyAgent.id) : undefined;
+        const diff = false ? perAgentDiffs.get(onlyAgent.id) : undefined;
         if (diff !== undefined) {
           yield* sink.setWorkspaceDiff(diff).pipe(Effect.mapError(bundleBuildToHarness));

[NoCoverage] BlockStatement
src/runner/coordinator.ts:159:33
       if (plan.agents.length === 1) {
         const onlyAgent = plan.agents[0];
         const diff = onlyAgent !== undefined ? perAgentDiffs.get(onlyAgent.id) : undefined;
-        if (diff !== undefined) {
-          yield* sink.setWorkspaceDiff(diff).pipe(Effect.mapError(bundleBuildToHarness));
-        }
+        if (diff !== undefined) {}
         return;
       }

[Killed] BooleanLiteral
src/runner/coordinator.ts:185:43
   return {
     recordTurn(turn) {
       return Effect.suspend(() => {
-        if (turn.agentId !== undefined && !knownAgents.has(turn.agentId)) {
+        if (turn.agentId !== undefined && knownAgents.has(turn.agentId)) {
           return Effect.fail(
             new BundleBuildError({
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:185:75
   return {
     recordTurn(turn) {
       return Effect.suspend(() => {
-        if (turn.agentId !== undefined && !knownAgents.has(turn.agentId)) {
-          return Effect.fail(
-            new BundleBuildError({
-              cause: BundleBuildCause.UnknownAgent({ agentId: turn.agentId }),
-            }),
-          );
-        }
+        if (turn.agentId !== undefined && !knownAgents.has(turn.agentId)) {}
         turns.push(turn);
         return Effect.void;
killedBy: makeNormalizedBundleSink: harness contract recordTurn rejects an unknown agentId with UnknownAgent
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:198:32
     },
 
     recordEvent(event) {
-      return Effect.sync(() => {
-        events.push(event);
-      });
+      return Effect.sync(() => {});
     },
 
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:204:32
     },
 
     recordPhase(phase) {
-      return Effect.sync(() => {
-        phases.push(phase);
-      });
+      return Effect.sync(() => {});
     },
 
killedBy: makeNormalizedBundleSink: harness contract finalize includes phases when at least one was recorded
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:210:32
     },
 
     recordContextPatch(patch) {
-      return Effect.sync(() => {
-        context = {
-          ...(context ?? {}),
-          ...patch,
-        };
-      });
+      return Effect.sync(() => {});
     },
 
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] ObjectLiteral
src/runner/coordinator.ts:211:19
 
     recordContextPatch(patch) {
       return Effect.sync(() => {
-        context = {
-          ...(context ?? {}),
-          ...patch,
-        };
+        context = {};
       });
     },
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/runner/coordinator.ts:212:15
     recordContextPatch(patch) {
       return Effect.sync(() => {
         context = {
-          ...(context ?? {}),
+          ...(context && {}),
           ...patch,
         };
killedBy: makeNormalizedBundleSink: harness contract finalize merges multiple recordContextPatch calls (later wins per key)
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:219:32
     },
 
     setWorkspaceDiff(diff) {
-      return Effect.sync(() => {
-        workspaceDiff = diff;
-      });
+      return Effect.sync(() => {});
     },
 
killedBy: makeNormalizedBundleSink: harness contract finalize includes workspaceDiff when set
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/runner/coordinator.ts:226:13
 
     recordOutcome(outcome) {
       return Effect.suspend(() => {
-        if (!knownAgents.has(outcome.agentId)) {
+        if (knownAgents.has(outcome.agentId)) {
           return Effect.fail(
             new BundleBuildError({
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:226:48
 
     recordOutcome(outcome) {
       return Effect.suspend(() => {
-        if (!knownAgents.has(outcome.agentId)) {
-          return Effect.fail(
-            new BundleBuildError({
-              cause: BundleBuildCause.UnknownAgent({ agentId: outcome.agentId }),
-            }),
-          );
-        }
+        if (!knownAgents.has(outcome.agentId)) {}
         if (outcomes.has(outcome.agentId)) {
           return Effect.fail(
killedBy: makeNormalizedBundleSink: harness contract recordOutcome rejects an unknown agentId with UnknownAgent
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/coordinator.ts:233:13
             }),
           );
         }
-        if (outcomes.has(outcome.agentId)) {
+        if (false) {
           return Effect.fail(
             new BundleBuildError({
killedBy: makeNormalizedBundleSink: harness contract recordOutcome rejects a second outcome for the same agent
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:233:44
             }),
           );
         }
-        if (outcomes.has(outcome.agentId)) {
-          return Effect.fail(
-            new BundleBuildError({
-              cause: BundleBuildCause.DuplicateOutcome({ agentId: outcome.agentId }),
-            }),
-          );
-        }
+        if (outcomes.has(outcome.agentId)) {}
         outcomes.set(outcome.agentId, outcome);
         return Effect.void;
killedBy: makeNormalizedBundleSink: harness contract recordOutcome rejects a second outcome for the same agent
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/runner/coordinator.ts:247:33
 
     finalize() {
       return Effect.suspend(() => {
-        const missingOutcomes = plan.agents
-          .map((agent) => agent.id)
-          .filter((agentId) => !outcomes.has(agentId));
+        const missingOutcomes = plan.agents.map(agent => agent.id);
         if (missingOutcomes.length > 0) {
           return Effect.fail(
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/runner/coordinator.ts:249:32
       return Effect.suspend(() => {
         const missingOutcomes = plan.agents
           .map((agent) => agent.id)
-          .filter((agentId) => !outcomes.has(agentId));
+          .filter((agentId) => outcomes.has(agentId));
         if (missingOutcomes.length > 0) {
           return Effect.fail(
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] ArrowFunction
src/runner/coordinator.ts:249:19
       return Effect.suspend(() => {
         const missingOutcomes = plan.agents
           .map((agent) => agent.id)
-          .filter((agentId) => !outcomes.has(agentId));
+          .filter(() => undefined);
         if (missingOutcomes.length > 0) {
           return Effect.fail(
killedBy: makeNormalizedBundleSink: harness contract finalize rejects when one or more agents have no outcome
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:250:41
         const missingOutcomes = plan.agents
           .map((agent) => agent.id)
           .filter((agentId) => !outcomes.has(agentId));
-        if (missingOutcomes.length > 0) {
-          return Effect.fail(
-            new BundleBuildError({
-              cause: BundleBuildCause.MissingOutcomes({ agentIds: missingOutcomes }),
-            }),
-          );
-        }
+        if (missingOutcomes.length > 0) {}
         const bundle: JudgmentBundle = {
           runId: RunId(runId),
killedBy: makeNormalizedBundleSink: harness contract finalize rejects when one or more agents have no outcome
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/coordinator.ts:250:13
         const missingOutcomes = plan.agents
           .map((agent) => agent.id)
           .filter((agentId) => !outcomes.has(agentId));
-        if (missingOutcomes.length > 0) {
+        if (missingOutcomes.length >= 0) {
           return Effect.fail(
             new BundleBuildError({
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/coordinator.ts:265:15
           description: plan.description,
           requirements: plan.requirements,
           agents: plan.agents.map(agentRefFromDeclaration),
-          ...(turns.length > 0 ? { turns: sortTurns(turns) } : {}),
+          ...(turns.length >= 0 ? { turns: sortTurns(turns) } : {}),
           ...(events.length > 0 ? { events: sortEvents(events) } : {}),
           ...(phases.length > 0 ? { phases: sortPhases(phases) } : {}),
killedBy: makeNormalizedBundleSink: harness contract finalize omits empty optional fields (turns/events/phases/context)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/coordinator.ts:265:15
           description: plan.description,
           requirements: plan.requirements,
           agents: plan.agents.map(agentRefFromDeclaration),
-          ...(turns.length > 0 ? { turns: sortTurns(turns) } : {}),
+          ...(true ? { turns: sortTurns(turns) } : {}),
           ...(events.length > 0 ? { events: sortEvents(events) } : {}),
           ...(phases.length > 0 ? { phases: sortPhases(phases) } : {}),
killedBy: makeNormalizedBundleSink: harness contract finalize omits empty optional fields (turns/events/phases/context)
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/coordinator.ts:266:15
           requirements: plan.requirements,
           agents: plan.agents.map(agentRefFromDeclaration),
           ...(turns.length > 0 ? { turns: sortTurns(turns) } : {}),
-          ...(events.length > 0 ? { events: sortEvents(events) } : {}),
+          ...(events.length <= 0 ? { events: sortEvents(events) } : {}),
           ...(phases.length > 0 ? { phases: sortPhases(phases) } : {}),
           ...(context !== undefined && Object.keys(context).length > 0 ? { context } : {}),
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/coordinator.ts:266:15
           requirements: plan.requirements,
           agents: plan.agents.map(agentRefFromDeclaration),
           ...(turns.length > 0 ? { turns: sortTurns(turns) } : {}),
-          ...(events.length > 0 ? { events: sortEvents(events) } : {}),
+          ...(false ? { events: sortEvents(events) } : {}),
           ...(phases.length > 0 ? { phases: sortPhases(phases) } : {}),
           ...(context !== undefined && Object.keys(context).length > 0 ? { context } : {}),
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/coordinator.ts:267:15
           agents: plan.agents.map(agentRefFromDeclaration),
           ...(turns.length > 0 ? { turns: sortTurns(turns) } : {}),
           ...(events.length > 0 ? { events: sortEvents(events) } : {}),
-          ...(phases.length > 0 ? { phases: sortPhases(phases) } : {}),
+          ...(false ? { phases: sortPhases(phases) } : {}),
           ...(context !== undefined && Object.keys(context).length > 0 ? { context } : {}),
           ...(workspaceDiff !== undefined ? { workspaceDiff } : {}),
killedBy: makeNormalizedBundleSink: harness contract finalize includes phases when at least one was recorded
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/coordinator.ts:267:15
           agents: plan.agents.map(agentRefFromDeclaration),
           ...(turns.length > 0 ? { turns: sortTurns(turns) } : {}),
           ...(events.length > 0 ? { events: sortEvents(events) } : {}),
-          ...(phases.length > 0 ? { phases: sortPhases(phases) } : {}),
+          ...(phases.length >= 0 ? { phases: sortPhases(phases) } : {}),
           ...(context !== undefined && Object.keys(context).length > 0 ? { context } : {}),
           ...(workspaceDiff !== undefined ? { workspaceDiff } : {}),
killedBy: makeNormalizedBundleSink: harness contract finalize omits empty optional fields (turns/events/phases/context)
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/coordinator.ts:268:40
           ...(turns.length > 0 ? { turns: sortTurns(turns) } : {}),
           ...(events.length > 0 ? { events: sortEvents(events) } : {}),
           ...(phases.length > 0 ? { phases: sortPhases(phases) } : {}),
-          ...(context !== undefined && Object.keys(context).length > 0 ? { context } : {}),
+          ...(context !== undefined && Object.keys(context).length <= 0 ? { context } : {}),
           ...(workspaceDiff !== undefined ? { workspaceDiff } : {}),
           outcomes: Array.from(outcomes.values()),
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Survived] EqualityOperator
src/runner/coordinator.ts:268:40
           ...(turns.length > 0 ? { turns: sortTurns(turns) } : {}),
           ...(events.length > 0 ? { events: sortEvents(events) } : {}),
           ...(phases.length > 0 ? { phases: sortPhases(phases) } : {}),
-          ...(context !== undefined && Object.keys(context).length > 0 ? { context } : {}),
+          ...(context !== undefined && Object.keys(context).length >= 0 ? { context } : {}),
           ...(workspaceDiff !== undefined ? { workspaceDiff } : {}),
           outcomes: Array.from(outcomes.values()),

[Killed] ConditionalExpression
src/runner/coordinator.ts:273:13
           outcomes: Array.from(outcomes.values()),
         };
         const errors = formatSchemaErrors(Value.Errors(JudgmentBundleSchema, bundle));
-        if (errors.length > 0) {
+        if (true) {
           return Effect.fail(
             new BundleBuildError({
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/coordinator.ts:273:13
           outcomes: Array.from(outcomes.values()),
         };
         const errors = formatSchemaErrors(Value.Errors(JudgmentBundleSchema, bundle));
-        if (errors.length > 0) {
+        if (errors.length <= 0) {
           return Effect.fail(
             new BundleBuildError({
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Survived] BlockStatement
src/runner/coordinator.ts:315:72
 ): Effect.Effect<{ readonly diff: WorkspaceDiff }, HarnessExecutionError | AgentRunTimeoutError, never> {
   return Effect.gen(function* () {
     const handle = yield* execution.getHandle(agentId);
-    if (config.workspace !== undefined && config.workspace.length > 0) {
-      yield* handle.writeWorkspace(config.workspace);
-    }
+    if (config.workspace !== undefined && config.workspace.length > 0) {}
     const startedAt = new Date().toISOString();
     let finishedWithFailure = false;

[Survived] EqualityOperator
src/runner/coordinator.ts:315:43
 ): Effect.Effect<{ readonly diff: WorkspaceDiff }, HarnessExecutionError | AgentRunTimeoutError, never> {
   return Effect.gen(function* () {
     const handle = yield* execution.getHandle(agentId);
-    if (config.workspace !== undefined && config.workspace.length > 0) {
+    if (config.workspace !== undefined && config.workspace.length <= 0) {
       yield* handle.writeWorkspace(config.workspace);
     }

[Killed] BooleanLiteral
src/runner/coordinator.ts:319:31
       yield* handle.writeWorkspace(config.workspace);
     }
     const startedAt = new Date().toISOString();
-    let finishedWithFailure = false;
+    let finishedWithFailure = true;
     for (const prompt of config.prompts) {
       const result = yield* handle.executePrompt(prompt, {
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/runner/coordinator.ts:331:13
           }),
         );
       if (!result.success) {
-        if (abortSignal?.aborted === true) {
+        if (abortSignal?.aborted !== true) {
           return yield* Effect.fail(result.error);
         }
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness forwards abort signals into the live prompt path
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/coordinator.ts:331:44
           }),
         );
       if (!result.success) {
-        if (abortSignal?.aborted === true) {
-          return yield* Effect.fail(result.error);
-        }
+        if (abortSignal?.aborted === true) {}
         const endedAt = new Date().toISOString();
         if (result.error instanceof AgentRunTimeoutError) {
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness forwards abort signals into the live prompt path
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/runner/coordinator.ts:335:59
           return yield* Effect.fail(result.error);
         }
         const endedAt = new Date().toISOString();
-        if (result.error instanceof AgentRunTimeoutError) {
-          yield* sink.recordOutcome({
-            agentId,
-            status: AGENT_LIFECYCLE_STATUS.TimedOut,
-            startedAt,
-            endedAt,
-            reason: `agent timed out after ${String(result.error.timeoutMs)}ms`,
-          }).pipe(Effect.mapError(bundleBuildToHarness));
-        } else {
+        if (result.error instanceof AgentRunTimeoutError) {} else {
           yield* sink.recordOutcome({
             agentId,

[NoCoverage] StringLiteral
src/runner/coordinator.ts:341:21
             status: AGENT_LIFECYCLE_STATUS.TimedOut,
             startedAt,
             endedAt,
-            reason: `agent timed out after ${String(result.error.timeoutMs)}ms`,
+            reason: ``,
           }).pipe(Effect.mapError(bundleBuildToHarness));
         } else {

[NoCoverage] BlockStatement
src/runner/coordinator.ts:343:16
             endedAt,
             reason: `agent timed out after ${String(result.error.timeoutMs)}ms`,
           }).pipe(Effect.mapError(bundleBuildToHarness));
-        } else {
-          yield* sink.recordOutcome({
-            agentId,
-            status: AGENT_LIFECYCLE_STATUS.RuntimeError,
-            startedAt,
-            endedAt,
-            reason: renderHarnessCause(result.error.cause),
-          }).pipe(Effect.mapError(bundleBuildToHarness));
-        }
+        } else {}
         finishedWithFailure = true;
         break;

[NoCoverage] BooleanLiteral
src/runner/coordinator.ts:352:31
             reason: renderHarnessCause(result.error.cause),
           }).pipe(Effect.mapError(bundleBuildToHarness));
         }
-        finishedWithFailure = true;
+        finishedWithFailure = false;
         break;
       }

[Killed] ArithmeticOperator
src/runner/coordinator.ts:375:13
         from: handle.agent.name,
         channel: "response",
         text: turn.response,
-        ts: safePromptTs + turn.latencyMs,
+        ts: safePromptTs - turn.latencyMs,
       }).pipe(Effect.mapError(bundleBuildToHarness));
     }
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/runner/coordinator.ts:379:9
       }).pipe(Effect.mapError(bundleBuildToHarness));
     }
     const diff = yield* handle.diffWorkspace();
-    if (!finishedWithFailure) {
+    if (finishedWithFailure) {
       yield* sink.recordOutcome({
         agentId,
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/coordinator.ts:379:9
       }).pipe(Effect.mapError(bundleBuildToHarness));
     }
     const diff = yield* handle.diffWorkspace();
-    if (!finishedWithFailure) {
+    if (false) {
       yield* sink.recordOutcome({
         agentId,
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Survived] MethodExpression
src/runner/coordinator.ts:392:10
 }
 
 function sortTurns(turns: ReadonlyArray<AgentTurn>): ReadonlyArray<AgentTurn> {
-  return [...turns].sort((left, right) => {
-    const leftTs = Date.parse(left.turn.startedAt);
-    const rightTs = Date.parse(right.turn.startedAt);
-    return leftTs - rightTs;
-  });
+  return [...turns];
 }
 

[Survived] ArithmeticOperator
src/runner/coordinator.ts:395:12
   return [...turns].sort((left, right) => {
     const leftTs = Date.parse(left.turn.startedAt);
     const rightTs = Date.parse(right.turn.startedAt);
-    return leftTs - rightTs;
+    return leftTs + rightTs;
   });
 }

[Killed] ArithmeticOperator
src/runner/coordinator.ts:400:44
 }
 
 function sortEvents(events: ReadonlyArray<TraceEvent>): ReadonlyArray<TraceEvent> {
-  return [...events].sort((left, right) => left.ts - right.ts);
+  return [...events].sort((left, right) => left.ts + right.ts);
 }
 
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/runner/coordinator.ts:400:10
 }
 
 function sortEvents(events: ReadonlyArray<TraceEvent>): ReadonlyArray<TraceEvent> {
-  return [...events].sort((left, right) => left.ts - right.ts);
+  return [...events];
 }
 
killedBy: DefaultRunCoordinator + PromptWorkspaceHarness coordinates a multi-agent run and emits a normalized bundle
statusReason: StrykerJS: Unknown test failure

[Survived] MethodExpression
src/runner/coordinator.ts:404:10
 }
 
 function sortPhases(phases: ReadonlyArray<Phase>): ReadonlyArray<Phase> {
-  return [...phases].sort((left, right) => left.tsStart - right.tsStart);
+  return [...phases];
 }
 

[NoCoverage] ArithmeticOperator
src/runner/coordinator.ts:404:44
 }
 
 function sortPhases(phases: ReadonlyArray<Phase>): ReadonlyArray<Phase> {
-  return [...phases].sort((left, right) => left.tsStart - right.tsStart);
+  return [...phases].sort((left, right) => left.tsStart + right.tsStart);
 }
 
