[NoCoverage] BlockStatement
src/runner/coordinator.ts:409:46
 
 
 function mapRunCoordinationError(error: unknown): RunCoordinationError {
-  if (error instanceof RunCoordinationError) {
-    return error;
-  }
+  if (error instanceof RunCoordinationError) {}
   if (error instanceof BundleBuildError) {
     return new RunCoordinationError({

[NoCoverage] BlockStatement
src/runner/coordinator.ts:412:42
   if (error instanceof RunCoordinationError) {
     return error;
   }
-  if (error instanceof BundleBuildError) {
-    return new RunCoordinationError({
-      cause: RunCoordinationCause.BundleBuildFailed({
-        detail: error.cause,
-      }),
-    });
-  }
+  if (error instanceof BundleBuildError) {}
   if (error instanceof HarnessExecutionError) {
     return new RunCoordinationError({

[Survived] BlockStatement
src/runner/coordinator.ts:419:47
       }),
     });
   }
-  if (error instanceof HarnessExecutionError) {
-    return new RunCoordinationError({
-      cause: RunCoordinationCause.HarnessFailed({
-        detail: error.cause,
-      }),
-    });
-  }
+  if (error instanceof HarnessExecutionError) {}
   if (error instanceof AgentStartError) {
     return new RunCoordinationError({

[NoCoverage] BlockStatement
src/runner/coordinator.ts:426:41
       }),
     });
   }
-  if (error instanceof AgentStartError) {
-    return new RunCoordinationError({
-      cause: RunCoordinationCause.AgentStartFailed({
-        agentId: error.agentId ?? "unknown-agent",
-        detail: error.cause,
-      }),
-    });
-  }
+  if (error instanceof AgentStartError) {}
   return new RunCoordinationError({
     cause: RunCoordinationCause.HarnessFailed({

[NoCoverage] StringLiteral
src/runner/coordinator.ts:456:58
     case "DuplicateOutcome":
       return `duplicate outcome for ${cause.agentId}`;
     case "MissingOutcomes":
-      return `missing outcomes for ${cause.agentIds.join(", ")}`;
+      return `missing outcomes for ${cause.agentIds.join("")}`;
     case "UnknownAgent":
       return `unknown agent ${cause.agentId}`;

[NoCoverage] StringLiteral
src/runner/coordinator.ts:469:14
 function renderHarnessCause(cause: HarnessExecutionCause): string {
   switch (cause._tag) {
     case "MissingRuntimeHandle":
-      return `missing runtime handle for ${cause.agentId}`;
+      return ``;
     case "InvalidPlanMetadata":
       return cause.message;
