[Survived] MethodExpression
src/runner/helpers.ts:45:19
 };
 
 function parseLine(line: string): unknown {
-  const trimmed = line.trim();
+  const trimmed = line;
   if (trimmed.length === 0) return null;
   try {

[Killed] ConditionalExpression
src/runner/helpers.ts:46:7
 
 function parseLine(line: string): unknown {
   const trimmed = line.trim();
-  if (trimmed.length === 0) return null;
+  if (true) return null;
   try {
     return JSON.parse(trimmed);
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '{"type":"assistant","content":"Hello …' to be 'Hello world.' // Object.is equality

[Killed] EqualityOperator
src/runner/helpers.ts:46:7
 
 function parseLine(line: string): unknown {
   const trimmed = line.trim();
-  if (trimmed.length === 0) return null;
+  if (trimmed.length !== 0) return null;
   try {
     return JSON.parse(trimmed);
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '{"type":"assistant","content":"Hello …' to be 'Hello world.' // Object.is equality

[Killed] BlockStatement
src/runner/helpers.ts:47:7
 function parseLine(line: string): unknown {
   const trimmed = line.trim();
   if (trimmed.length === 0) return null;
-  try {
-    return JSON.parse(trimmed);
-  } catch (err) {
+  try {} catch (err) {
     void err;
     return null;
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '{"type":"assistant","content":"Hello …' to be 'Hello world.' // Object.is equality

[Survived] BlockStatement
src/runner/helpers.ts:49:17
   if (trimmed.length === 0) return null;
   try {
     return JSON.parse(trimmed);
-  } catch (err) {
-    void err;
-    return null;
-  }
+  } catch (err) {}
 }
 

[Killed] ConditionalExpression
src/runner/helpers.ts:60:7
 }
 
 function aggregateUsage(acc: ParsedTurn, usage: unknown): ParsedTurn {
-  if (typeof usage !== "object" || usage === null) return acc;
+  if (true) return acc;
   const tokens = usage as StreamJsonUsage;
   return {
killedBy: parseStreamJson: usage tokens aggregates token counts across multiple events
statusReason: expected +0 to be 13 // Object.is equality

[Killed] LogicalOperator
src/runner/helpers.ts:60:7
 }
 
 function aggregateUsage(acc: ParsedTurn, usage: unknown): ParsedTurn {
-  if (typeof usage !== "object" || usage === null) return acc;
+  if (typeof usage !== "object" && usage === null) return acc;
   const tokens = usage as StreamJsonUsage;
   return {
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: Cannot read properties of undefined (reading 'input_tokens')

[Killed] ArithmeticOperator
src/runner/helpers.ts:64:18
   const tokens = usage as StreamJsonUsage;
   return {
     ...acc,
-    inputTokens: acc.inputTokens + readNumber(tokens.input_tokens),
+    inputTokens: acc.inputTokens - readNumber(tokens.input_tokens),
     outputTokens: acc.outputTokens + readNumber(tokens.output_tokens),
     cacheReadTokens: acc.cacheReadTokens + readNumber(tokens.cache_read_input_tokens),
killedBy: parseStreamJson: usage tokens aggregates token counts across multiple events
statusReason: expected -13 to be 13 // Object.is equality

[Killed] ArithmeticOperator
src/runner/helpers.ts:65:19
   return {
     ...acc,
     inputTokens: acc.inputTokens + readNumber(tokens.input_tokens),
-    outputTokens: acc.outputTokens + readNumber(tokens.output_tokens),
+    outputTokens: acc.outputTokens - readNumber(tokens.output_tokens),
     cacheReadTokens: acc.cacheReadTokens + readNumber(tokens.cache_read_input_tokens),
     cacheWriteTokens: acc.cacheWriteTokens + readNumber(tokens.cache_creation_input_tokens),
killedBy: parseStreamJson: usage tokens aggregates token counts across multiple events
statusReason: expected -7 to be 7 // Object.is equality

[Killed] ArithmeticOperator
src/runner/helpers.ts:66:22
     ...acc,
     inputTokens: acc.inputTokens + readNumber(tokens.input_tokens),
     outputTokens: acc.outputTokens + readNumber(tokens.output_tokens),
-    cacheReadTokens: acc.cacheReadTokens + readNumber(tokens.cache_read_input_tokens),
+    cacheReadTokens: acc.cacheReadTokens - readNumber(tokens.cache_read_input_tokens),
     cacheWriteTokens: acc.cacheWriteTokens + readNumber(tokens.cache_creation_input_tokens),
   };
killedBy: parseStreamJson: usage tokens aggregates cache_read and cache_creation tokens separately
statusReason: expected -80 to be 80 // Object.is equality

[Killed] ArithmeticOperator
src/runner/helpers.ts:67:23
     inputTokens: acc.inputTokens + readNumber(tokens.input_tokens),
     outputTokens: acc.outputTokens + readNumber(tokens.output_tokens),
     cacheReadTokens: acc.cacheReadTokens + readNumber(tokens.cache_read_input_tokens),
-    cacheWriteTokens: acc.cacheWriteTokens + readNumber(tokens.cache_creation_input_tokens),
+    cacheWriteTokens: acc.cacheWriteTokens - readNumber(tokens.cache_creation_input_tokens),
   };
 }
killedBy: parseStreamJson: usage tokens aggregates cache_read and cache_creation tokens separately
statusReason: expected -20 to be 20 // Object.is equality

[Killed] EqualityOperator
src/runner/helpers.ts:72:16
 }
 
 function applyEvent(acc: ParsedTurn, obj: StreamJsonEvent): ParsedTurn {
-  const type = typeof obj.type === "string" ? obj.type : "";
+  const type = typeof obj.type !== "string" ? obj.type : "";
   switch (type) {
     case "assistant":
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '' to be 'Hello world.' // Object.is equality

[Killed] ConditionalExpression
src/runner/helpers.ts:72:16
 }
 
 function applyEvent(acc: ParsedTurn, obj: StreamJsonEvent): ParsedTurn {
-  const type = typeof obj.type === "string" ? obj.type : "";
+  const type = false ? obj.type : "";
   switch (type) {
     case "assistant":
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '' to be 'Hello world.' // Object.is equality

[Killed] ConditionalExpression
src/runner/helpers.ts:74:5
 function applyEvent(acc: ParsedTurn, obj: StreamJsonEvent): ParsedTurn {
   const type = typeof obj.type === "string" ? obj.type : "";
   switch (type) {
-    case "assistant":
-      return typeof obj.content === "string"
-        ? { ...acc, response: acc.response + obj.content }
-        : acc;
+    case "assistant":
     case "result":
       // First non-empty result wins; assistant content takes precedence.
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '' to be 'Hello world.' // Object.is equality

[Killed] ConditionalExpression
src/runner/helpers.ts:75:14
   const type = typeof obj.type === "string" ? obj.type : "";
   switch (type) {
     case "assistant":
-      return typeof obj.content === "string"
+      return false
         ? { ...acc, response: acc.response + obj.content }
         : acc;
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '' to be 'Hello world.' // Object.is equality

[Killed] EqualityOperator
src/runner/helpers.ts:75:14
   const type = typeof obj.type === "string" ? obj.type : "";
   switch (type) {
     case "assistant":
-      return typeof obj.content === "string"
+      return typeof obj.content !== "string"
         ? { ...acc, response: acc.response + obj.content }
         : acc;
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '' to be 'Hello world.' // Object.is equality

[Killed] ConditionalExpression
src/runner/helpers.ts:78:5
       return typeof obj.content === "string"
         ? { ...acc, response: acc.response + obj.content }
         : acc;
-    case "result":
-      // First non-empty result wins; assistant content takes precedence.
-      return typeof obj.result === "string" && acc.response.length === 0
-        ? { ...acc, response: obj.result }
-        : acc;
+    case "result":
     case "tool_use":
     case "tool_call":
killedBy: parseStreamJson: events uses result event when no assistant content was seen
statusReason: expected '' to be 'final answer' // Object.is equality

[Killed] EqualityOperator
src/runner/helpers.ts:80:48
         : acc;
     case "result":
       // First non-empty result wins; assistant content takes precedence.
-      return typeof obj.result === "string" && acc.response.length === 0
+      return typeof obj.result === "string" && acc.response.length !== 0
         ? { ...acc, response: obj.result }
         : acc;
killedBy: parseStreamJson: events uses result event when no assistant content was seen
statusReason: expected '' to be 'final answer' // Object.is equality

[Killed] ConditionalExpression
src/runner/helpers.ts:80:48
         : acc;
     case "result":
       // First non-empty result wins; assistant content takes precedence.
-      return typeof obj.result === "string" && acc.response.length === 0
+      return typeof obj.result === "string" && true
         ? { ...acc, response: obj.result }
         : acc;
killedBy: parseStreamJson: events ignores result event when assistant content was already collected
statusReason: expected 'should be ignored' to be 'the real answer' // Object.is equality

[Killed] ConditionalExpression
src/runner/helpers.ts:84:5
         ? { ...acc, response: obj.result }
         : acc;
     case "tool_use":
-    case "tool_call":
-      return { ...acc, toolCallCount: acc.toolCallCount + 1 };
+    case "tool_call":
     default:
       return acc;
killedBy: parseStreamJson: events counts tool_use and tool_call events
statusReason: expected +0 to be 3 // Object.is equality

[Killed] StringLiteral
src/runner/helpers.ts:84:10
         ? { ...acc, response: obj.result }
         : acc;
     case "tool_use":
-    case "tool_call":
+    case "":
       return { ...acc, toolCallCount: acc.toolCallCount + 1 };
     default:
killedBy: parseStreamJson: events counts tool_use and tool_call events
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/runner/helpers.ts:85:39
         : acc;
     case "tool_use":
     case "tool_call":
-      return { ...acc, toolCallCount: acc.toolCallCount + 1 };
+      return { ...acc, toolCallCount: acc.toolCallCount - 1 };
     default:
       return acc;
killedBy: parseStreamJson: events counts tool_use and tool_call events
statusReason: expected -3 to be 3 // Object.is equality

[Killed] BooleanLiteral
src/runner/helpers.ts:100:23
  */
 export function parseStreamJson(stdout: string): ParsedTurn {
   let acc = ZERO_TURN;
-  let sawStructured = false;
+  let sawStructured = true;
   for (const line of stdout.split("\n")) {
     const parsed = parseLine(line);
killedBy: parseStreamJson: events returns the raw stdout when no JSON event is present (fallback)
statusReason: expected '' to be 'plain text output\nno json here\n' // Object.is equality

[Killed] BlockStatement
src/runner/helpers.ts:101:42
 export function parseStreamJson(stdout: string): ParsedTurn {
   let acc = ZERO_TURN;
   let sawStructured = false;
-  for (const line of stdout.split("\n")) {
-    const parsed = parseLine(line);
-    if (typeof parsed !== "object" || parsed === null) continue;
-    sawStructured = true;
-    const obj = parsed as StreamJsonEvent;
-    acc = applyEvent(acc, obj);
-    acc = aggregateUsage(acc, obj.usage);
-  }
+  for (const line of stdout.split("\n")) {}
   return sawStructured ? acc : { ...acc, response: stdout };
 }
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '{"type":"assistant","content":"Hello …' to be 'Hello world.' // Object.is equality

[Killed] EqualityOperator
src/runner/helpers.ts:103:9
   let sawStructured = false;
   for (const line of stdout.split("\n")) {
     const parsed = parseLine(line);
-    if (typeof parsed !== "object" || parsed === null) continue;
+    if (typeof parsed === "object" || parsed === null) continue;
     sawStructured = true;
     const obj = parsed as StreamJsonEvent;
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '{"type":"assistant","content":"Hello …' to be 'Hello world.' // Object.is equality

[Killed] LogicalOperator
src/runner/helpers.ts:103:9
   let sawStructured = false;
   for (const line of stdout.split("\n")) {
     const parsed = parseLine(line);
-    if (typeof parsed !== "object" || parsed === null) continue;
+    if (typeof parsed !== "object" && parsed === null) continue;
     sawStructured = true;
     const obj = parsed as StreamJsonEvent;
killedBy: parseStreamJson: events returns the raw stdout when no JSON event is present (fallback)
statusReason: Cannot read properties of null (reading 'type')

[Killed] BooleanLiteral
src/runner/helpers.ts:104:21
   for (const line of stdout.split("\n")) {
     const parsed = parseLine(line);
     if (typeof parsed !== "object" || parsed === null) continue;
-    sawStructured = true;
+    sawStructured = false;
     const obj = parsed as StreamJsonEvent;
     acc = applyEvent(acc, obj);
killedBy: parseStreamJson: events concatenates multiple assistant content events
statusReason: expected '{"type":"assistant","content":"Hello …' to be 'Hello world.' // Object.is equality

[Survived] ArrowFunction
src/runner/helpers.ts:135:12
 ): Effect.Effect<void, never, never> {
   return Effect.tryPromise({
     try: () => readdir(currentDir, { withFileTypes: true }),
-    catch: () => [],
+    catch: () => undefined,
   }).pipe(
     Effect.catchAll(() => Effect.succeed([])),

[Killed] ConditionalExpression
src/runner/helpers.ts:143:15
         entries,
         (entry) => {
           const absolutePath = path.join(currentDir, entry.name);
-          if (entry.isDirectory()) {
+          if (true) {
             return walkInto(root, absolutePath, output);
           }
killedBy: walkWorkspace collects flat files keyed by their relative path
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/helpers.ts:143:36
         entries,
         (entry) => {
           const absolutePath = path.join(currentDir, entry.name);
-          if (entry.isDirectory()) {
-            return walkInto(root, absolutePath, output);
-          }
+          if (entry.isDirectory()) {}
           if (!entry.isFile()) {
             return Effect.void;
killedBy: walkWorkspace recurses into subdirectories with relative path keys
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/runner/helpers.ts:146:15
           if (entry.isDirectory()) {
             return walkInto(root, absolutePath, output);
           }
-          if (!entry.isFile()) {
+          if (entry.isFile()) {
             return Effect.void;
           }
killedBy: walkWorkspace collects flat files keyed by their relative path
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/runner/helpers.ts:146:15
           if (entry.isDirectory()) {
             return walkInto(root, absolutePath, output);
           }
-          if (!entry.isFile()) {
+          if (true) {
             return Effect.void;
           }
killedBy: walkWorkspace collects flat files keyed by their relative path
statusReason: StrykerJS: Unknown test failure

[Survived] ArrowFunction
src/runner/helpers.ts:151:20
           }
           return Effect.tryPromise({
             try: () => readFile(absolutePath, "utf8"),
-            catch: () => null,
+            catch: () => undefined,
           }).pipe(
             Effect.match({

[Killed] BlockStatement
src/runner/helpers.ts:155:54
           }).pipe(
             Effect.match({
               onFailure: () => undefined,
-              onSuccess: (content: string | null) => {
-                if (content !== null) {
-                  output.set(path.relative(root, absolutePath), content);
-                }
-              },
+              onSuccess: (content: string | null) => {},
             }),
           );
killedBy: walkWorkspace collects flat files keyed by their relative path
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/runner/helpers.ts:156:39
             Effect.match({
               onFailure: () => undefined,
               onSuccess: (content: string | null) => {
-                if (content !== null) {
-                  output.set(path.relative(root, absolutePath), content);
-                }
+                if (content !== null) {}
               },
             }),
killedBy: walkWorkspace collects flat files keyed by their relative path
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/runner/helpers.ts:163:20
             }),
           );
         },
-        { discard: true },
+        { discard: false },
       ),
     ),

[Killed] BlockStatement
src/runner/helpers.ts:182:50
 ): WorkspaceDiff {
   const changed: WorkspaceFileChange[] = [];
   const seen = new Set<string>();
-  for (const [relativePath, before] of baseline) {
-    seen.add(relativePath);
-    const after = current.get(relativePath);
-    if (after === undefined) {
-      changed.push({ path: relativePath, before, after: null });
-    } else if (after !== before) {
-      changed.push({ path: relativePath, before, after });
-    }
-  }
+  for (const [relativePath, before] of baseline) {}
   for (const [relativePath, after] of current) {
     if (!seen.has(relativePath)) {
killedBy: computeDiff returns no changes when baseline equals current
statusReason: expected [ …(2) ] to deeply equal []

[Killed] BlockStatement
src/runner/helpers.ts:185:30
   for (const [relativePath, before] of baseline) {
     seen.add(relativePath);
     const after = current.get(relativePath);
-    if (after === undefined) {
-      changed.push({ path: relativePath, before, after: null });
-    } else if (after !== before) {
+    if (after === undefined) {} else if (after !== before) {
       changed.push({ path: relativePath, before, after });
     }
killedBy: computeDiff classifies a removed file (in baseline, not in current)
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/runner/helpers.ts:187:16
     const after = current.get(relativePath);
     if (after === undefined) {
       changed.push({ path: relativePath, before, after: null });
-    } else if (after !== before) {
+    } else if (after === before) {
       changed.push({ path: relativePath, before, after });
     }
killedBy: computeDiff returns no changes when baseline equals current
statusReason: expected [ …(2) ] to deeply equal []

[Killed] ConditionalExpression
src/runner/helpers.ts:187:16
     const after = current.get(relativePath);
     if (after === undefined) {
       changed.push({ path: relativePath, before, after: null });
-    } else if (after !== before) {
+    } else if (true) {
       changed.push({ path: relativePath, before, after });
     }
killedBy: computeDiff returns no changes when baseline equals current
statusReason: expected [ …(2) ] to deeply equal []

[Killed] BlockStatement
src/runner/helpers.ts:191:48
       changed.push({ path: relativePath, before, after });
     }
   }
-  for (const [relativePath, after] of current) {
-    if (!seen.has(relativePath)) {
-      changed.push({ path: relativePath, before: null, after });
-    }
-  }
+  for (const [relativePath, after] of current) {}
   return { changed };
 }
killedBy: computeDiff classifies an added file (not in baseline, in current)
statusReason: expected [] to deeply equal [ { path: 'x.txt', …(2) } ]

[Killed] BooleanLiteral
src/runner/helpers.ts:192:9
     }
   }
   for (const [relativePath, after] of current) {
-    if (!seen.has(relativePath)) {
+    if (seen.has(relativePath)) {
       changed.push({ path: relativePath, before: null, after });
     }
killedBy: computeDiff returns no changes when baseline equals current
statusReason: expected [ …(2) ] to deeply equal []

[Killed] BlockStatement
src/runner/helpers.ts:192:34
     }
   }
   for (const [relativePath, after] of current) {
-    if (!seen.has(relativePath)) {
-      changed.push({ path: relativePath, before: null, after });
-    }
+    if (!seen.has(relativePath)) {}
   }
   return { changed };
killedBy: computeDiff classifies an added file (not in baseline, in current)
statusReason: expected [] to deeply equal [ { path: 'x.txt', …(2) } ]
