[Killed] ConditionalExpression
src/app/cli.ts:59:7
   emitPromptfoo: string | undefined,
 ): ReadonlyArray<ObservabilityEmitter> {
   const emitters: ObservabilityEmitter[] = [];
-  if (emitBraintrust) {
+  if (true) {
     const apiKey = process.env["BRAINTRUST_API_KEY"];
     const project = process.env["BRAINTRUST_PROJECT"] ?? "cc-judge";
killedBy: runCommand buildObservability emitter composition (mock capture) emitBraintrust=false → emitters array has no braintrust entry
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/cli.ts:59:23
   emitPromptfoo: string | undefined,
 ): ReadonlyArray<ObservabilityEmitter> {
   const emitters: ObservabilityEmitter[] = [];
-  if (emitBraintrust) {
-    const apiKey = process.env["BRAINTRUST_API_KEY"];
-    const project = process.env["BRAINTRUST_PROJECT"] ?? "cc-judge";
-    if (apiKey !== undefined && apiKey.length > 0) {
-      emitters.push(new BraintrustEmitter({ apiKey, project }));
-    }
-  }
+  if (emitBraintrust) {}
   if (emitPromptfoo !== undefined) {
     emitters.push(new PromptfooEmitter({ outputPath: emitPromptfoo }));
killedBy: runCommand buildObservability emitter composition (mock capture) emitBraintrust=true + valid BRAINTRUST_API_KEY → emitters array includes braintrust
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:62:33
   if (emitBraintrust) {
     const apiKey = process.env["BRAINTRUST_API_KEY"];
     const project = process.env["BRAINTRUST_PROJECT"] ?? "cc-judge";
-    if (apiKey !== undefined && apiKey.length > 0) {
+    if (apiKey !== undefined && true) {
       emitters.push(new BraintrustEmitter({ apiKey, project }));
     }
killedBy: runCommand buildObservability emitter composition (mock capture) emitBraintrust=true + BRAINTRUST_API_KEY empty string → emitters has no braintrust
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/cli.ts:62:33
   if (emitBraintrust) {
     const apiKey = process.env["BRAINTRUST_API_KEY"];
     const project = process.env["BRAINTRUST_PROJECT"] ?? "cc-judge";
-    if (apiKey !== undefined && apiKey.length > 0) {
+    if (apiKey !== undefined && apiKey.length <= 0) {
       emitters.push(new BraintrustEmitter({ apiKey, project }));
     }
killedBy: runCommand buildObservability emitter composition (mock capture) emitBraintrust=true + valid BRAINTRUST_API_KEY → emitters array includes braintrust
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/cli.ts:66:36
       emitters.push(new BraintrustEmitter({ apiKey, project }));
     }
   }
-  if (emitPromptfoo !== undefined) {
-    emitters.push(new PromptfooEmitter({ outputPath: emitPromptfoo }));
-  }
+  if (emitPromptfoo !== undefined) {}
   return emitters;
 }
killedBy: runCommand buildObservability emitter composition (mock capture) emitPromptfoo set → emitters array includes promptfoo
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/cli.ts:73:38
 }
 
 function buildRunner(args: RunCliArgs): Effect.Effect<AgentRunner, RunnerResolutionError, never> {
-  if (args.runtime === "subprocess") {
-    if (args.bin === undefined) {
-      return Effect.fail(
-        new RunnerResolutionError({ cause: { _tag: "InvalidRuntime", value: "subprocess: missing --bin" } }),
-      );
-    }
-    return Effect.succeed(new SubprocessRunner({ bin: args.bin }));
-  }
+  if (args.runtime === "subprocess") {}
   if (args.image === undefined) {
     return Effect.fail(
killedBy: runCommand option passthroughs (via stub runner + empty filter) scenarioIds set → runScenarios called → summary.total 0 → exit 0
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/cli.ts:73:7
 }
 
 function buildRunner(args: RunCliArgs): Effect.Effect<AgentRunner, RunnerResolutionError, never> {
-  if (args.runtime === "subprocess") {
+  if (args.runtime !== "subprocess") {
     if (args.bin === undefined) {
       return Effect.fail(
killedBy: runCommand option passthroughs (via stub runner + empty filter) scenarioIds set → runScenarios called → summary.total 0 → exit 0
statusReason: StrykerJS: Unknown test failure

[Survived] ObjectLiteral
src/app/cli.ts:105:45
       return 2 as CliExitCode;
     }
     const runner = runnerRes.right;
-    const judge = new AnthropicJudgeBackend({ model: args.judge });
+    const judge = new AnthropicJudgeBackend({});
     const emitters = buildObservability(args.emitBraintrust, args.emitPromptfoo);
     const runRes = yield* Effect.either(

[Killed] ObjectLiteral
src/app/cli.ts:108:31
     const judge = new AnthropicJudgeBackend({ model: args.judge });
     const emitters = buildObservability(args.emitBraintrust, args.emitPromptfoo);
     const runRes = yield* Effect.either(
-      runScenarios(scenarios, {
-        runner,
-        judge,
-        resultsDir: args.results,
-        runsPerScenario: args.runs,
-        concurrency: args.concurrency,
-        emitters,
-        logLevel: args.logLevel,
-        ...(args.scenarioIds !== undefined ? { scenarioIdFilter: args.scenarioIds } : {}),
-        ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
-        ...(args.githubCommentArtifactUrl !== undefined
-          ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
-          : {}),
-        ...(args.totalTimeoutMs !== undefined ? { totalTimeoutMs: args.totalTimeoutMs } : {}),
-      }),
+      runScenarios(scenarios, {}),
     );
     if (runRes._tag === "Left") {
killedBy: runCommand passes optional opts to runScenarios (mock capture) scenarioIds are spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:116:13
         concurrency: args.concurrency,
         emitters,
         logLevel: args.logLevel,
-        ...(args.scenarioIds !== undefined ? { scenarioIdFilter: args.scenarioIds } : {}),
+        ...(false ? { scenarioIdFilter: args.scenarioIds } : {}),
         ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
         ...(args.githubCommentArtifactUrl !== undefined
killedBy: runCommand passes optional opts to runScenarios (mock capture) scenarioIds are spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/cli.ts:116:13
         concurrency: args.concurrency,
         emitters,
         logLevel: args.logLevel,
-        ...(args.scenarioIds !== undefined ? { scenarioIdFilter: args.scenarioIds } : {}),
+        ...(args.scenarioIds === undefined ? { scenarioIdFilter: args.scenarioIds } : {}),
         ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
         ...(args.githubCommentArtifactUrl !== undefined
killedBy: runCommand passes optional opts to runScenarios (mock capture) scenarioIds are spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:117:13
         emitters,
         logLevel: args.logLevel,
         ...(args.scenarioIds !== undefined ? { scenarioIdFilter: args.scenarioIds } : {}),
-        ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
+        ...(false ? { githubComment: args.githubComment } : {}),
         ...(args.githubCommentArtifactUrl !== undefined
           ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
killedBy: runCommand passes optional opts to runScenarios (mock capture) githubComment is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/cli.ts:117:13
         emitters,
         logLevel: args.logLevel,
         ...(args.scenarioIds !== undefined ? { scenarioIdFilter: args.scenarioIds } : {}),
-        ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
+        ...(args.githubComment === undefined ? { githubComment: args.githubComment } : {}),
         ...(args.githubCommentArtifactUrl !== undefined
           ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
killedBy: runCommand passes optional opts to runScenarios (mock capture) githubComment is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/cli.ts:118:13
         logLevel: args.logLevel,
         ...(args.scenarioIds !== undefined ? { scenarioIdFilter: args.scenarioIds } : {}),
         ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
-        ...(args.githubCommentArtifactUrl !== undefined
+        ...(args.githubCommentArtifactUrl === undefined
           ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
           : {}),
killedBy: runCommand passes optional opts to runScenarios (mock capture) githubCommentArtifactUrl is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:118:13
         logLevel: args.logLevel,
         ...(args.scenarioIds !== undefined ? { scenarioIdFilter: args.scenarioIds } : {}),
         ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
-        ...(args.githubCommentArtifactUrl !== undefined
+        ...(false
           ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
           : {}),
killedBy: runCommand passes optional opts to runScenarios (mock capture) githubCommentArtifactUrl is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] ObjectLiteral
src/app/cli.ts:119:13
         ...(args.scenarioIds !== undefined ? { scenarioIdFilter: args.scenarioIds } : {}),
         ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
         ...(args.githubCommentArtifactUrl !== undefined
-          ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
+          ? {}
           : {}),
         ...(args.totalTimeoutMs !== undefined ? { totalTimeoutMs: args.totalTimeoutMs } : {}),
killedBy: runCommand passes optional opts to runScenarios (mock capture) githubCommentArtifactUrl is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:121:13
         ...(args.githubCommentArtifactUrl !== undefined
           ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
           : {}),
-        ...(args.totalTimeoutMs !== undefined ? { totalTimeoutMs: args.totalTimeoutMs } : {}),
+        ...(false ? { totalTimeoutMs: args.totalTimeoutMs } : {}),
       }),
     );
killedBy: runCommand passes optional opts to runScenarios (mock capture) totalTimeoutMs is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/cli.ts:121:13
         ...(args.githubCommentArtifactUrl !== undefined
           ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
           : {}),
-        ...(args.totalTimeoutMs !== undefined ? { totalTimeoutMs: args.totalTimeoutMs } : {}),
+        ...(args.totalTimeoutMs === undefined ? { totalTimeoutMs: args.totalTimeoutMs } : {}),
       }),
     );
killedBy: runCommand passes optional opts to runScenarios (mock capture) totalTimeoutMs is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/app/cli.ts:130:7
     }
     const report = runRes.right;
     process.stdout.write(
-      `cc-judge: ${String(report.summary.passed)}/${String(report.summary.total)} passed\n`,
+      ``,
     );
     return (report.summary.failed === 0 ? 0 : 1) as CliExitCode;
killedBy: runCommand option passthroughs (via stub runner + empty filter) stdout summary line written after successful run
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/cli.ts:140:9
   return Effect.gen(function* () {
     const adapter = getTraceAdapter(args.traceFormat);
     const files = resolveTraceFiles(args.tracesPath);
-    if (files.length === 0) {
+    if (files.length !== 0) {
       process.stderr.write(`cc-judge: no trace files matched ${args.tracesPath}\n`);
       return 2 as CliExitCode;
killedBy: scoreCommand option passthroughs and boundary conditions exits 2 when trace file content is invalid JSON (decode fails → traces empty)
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/app/cli.ts:140:9
   return Effect.gen(function* () {
     const adapter = getTraceAdapter(args.traceFormat);
     const files = resolveTraceFiles(args.tracesPath);
-    if (files.length === 0) {
+    if (false) {
       process.stderr.write(`cc-judge: no trace files matched ${args.tracesPath}\n`);
       return 2 as CliExitCode;

[NoCoverage] StringLiteral
src/app/cli.ts:141:28
     const adapter = getTraceAdapter(args.traceFormat);
     const files = resolveTraceFiles(args.tracesPath);
     if (files.length === 0) {
-      process.stderr.write(`cc-judge: no trace files matched ${args.tracesPath}\n`);
+      process.stderr.write(``);
       return 2 as CliExitCode;
     }

[Killed] BlockStatement
src/app/cli.ts:145:28
       return 2 as CliExitCode;
     }
     const traces: Trace[] = [];
-    for (const f of files) {
-      const source = readFileSync(f, "utf8");
-      const decoded = yield* Effect.either(adapter.decode(source, f));
-      if (decoded._tag === "Left") {
-        process.stderr.write(
-          `cc-judge: trace decode failed for ${f}: ${decoded.left.cause._tag}\n`,
-        );
-        continue;
-      }
-      traces.push(decoded.right);
-    }
+    for (const f of files) {}
     if (traces.length === 0) return 2 as CliExitCode;
     const judge = new AnthropicJudgeBackend({ model: args.judge });
killedBy: scoreCommand option passthroughs and boundary conditions exits 2 when trace file content is invalid JSON (decode fails → traces empty)
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/app/cli.ts:150:11
       const decoded = yield* Effect.either(adapter.decode(source, f));
       if (decoded._tag === "Left") {
         process.stderr.write(
-          `cc-judge: trace decode failed for ${f}: ${decoded.left.cause._tag}\n`,
+          ``,
         );
         continue;
killedBy: scoreCommand option passthroughs and boundary conditions exits 2 when trace file content is invalid JSON (decode fails → traces empty)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:156:9
       }
       traces.push(decoded.right);
     }
-    if (traces.length === 0) return 2 as CliExitCode;
+    if (true) return 2 as CliExitCode;
     const judge = new AnthropicJudgeBackend({ model: args.judge });
     const emitters = buildObservability(args.emitBraintrust, args.emitPromptfoo);
killedBy: scoreCommand passes optional opts to scoreTraces (mock capture) githubComment is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:156:9
       }
       traces.push(decoded.right);
     }
-    if (traces.length === 0) return 2 as CliExitCode;
+    if (false) return 2 as CliExitCode;
     const judge = new AnthropicJudgeBackend({ model: args.judge });
     const emitters = buildObservability(args.emitBraintrust, args.emitPromptfoo);
killedBy: scoreCommand exits 2 when trace file decode fails with malformed content
statusReason: StrykerJS: Unknown test failure

[Killed] ObjectLiteral
src/app/cli.ts:159:47
     if (traces.length === 0) return 2 as CliExitCode;
     const judge = new AnthropicJudgeBackend({ model: args.judge });
     const emitters = buildObservability(args.emitBraintrust, args.emitPromptfoo);
-    const report = yield* scoreTraces(traces, {
-      judge,
-      resultsDir: args.results,
-      concurrency: args.concurrency,
-      emitters,
-      logLevel: args.logLevel,
-      traceFormat: args.traceFormat,
-      ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
-      ...(args.githubCommentArtifactUrl !== undefined
-        ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
-        : {}),
-      ...(args.totalTimeoutMs !== undefined ? { totalTimeoutMs: args.totalTimeoutMs } : {}),
-    });
+    const report = yield* scoreTraces(traces, {});
     process.stdout.write(
       `cc-judge: ${String(report.summary.passed)}/${String(report.summary.total)} passed\n`,
killedBy: scoreCommand passes optional opts to scoreTraces (mock capture) githubComment is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:166:11
       emitters,
       logLevel: args.logLevel,
       traceFormat: args.traceFormat,
-      ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
+      ...(false ? { githubComment: args.githubComment } : {}),
       ...(args.githubCommentArtifactUrl !== undefined
         ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
killedBy: scoreCommand passes optional opts to scoreTraces (mock capture) githubComment is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/cli.ts:166:11
       emitters,
       logLevel: args.logLevel,
       traceFormat: args.traceFormat,
-      ...(args.githubComment !== undefined ? { githubComment: args.githubComment } : {}),
+      ...(args.githubComment === undefined ? { githubComment: args.githubComment } : {}),
       ...(args.githubCommentArtifactUrl !== undefined
         ? { githubCommentArtifactUrl: args.githubCommentArtifactUrl }
killedBy: scoreCommand passes optional opts to scoreTraces (mock capture) githubComment is spread into opts when defined
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/app/cli.ts:184:10
   // reuse its underlying glob library by going via node:fs for a single
   // file — traces are JSON not TS, so we don't import them.
   // For v1 we accept a single file path. Expansion deferred.
-  return [pathOrGlob];
+  return [];
 }
 
killedBy: scoreCommand option passthroughs and boundary conditions exits 2 when trace file content is invalid JSON (decode fails → traces empty)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:201:19
 export function parseRunArgs(raw: unknown): RunCliArgs {
   const r = asObject(raw);
   const scenarioPath = typeof r["scenario"] === "string" ? r["scenario"] : "";
-  const runtime = r["runtime"] === "subprocess" ? "subprocess" : "docker";
+  const runtime = true ? "subprocess" : "docker";
   const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || r["logLevel"] === "warn" || r["logLevel"] === "error")
     ? r["logLevel"]
killedBy: parseRunArgs supplies defaults for every optional field when raw is empty
statusReason: expected 'subprocess' to be 'docker' // Object.is equality

[Killed] EqualityOperator
src/app/cli.ts:201:19
 export function parseRunArgs(raw: unknown): RunCliArgs {
   const r = asObject(raw);
   const scenarioPath = typeof r["scenario"] === "string" ? r["scenario"] : "";
-  const runtime = r["runtime"] === "subprocess" ? "subprocess" : "docker";
+  const runtime = r["runtime"] !== "subprocess" ? "subprocess" : "docker";
   const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || r["logLevel"] === "warn" || r["logLevel"] === "error")
     ? r["logLevel"]
killedBy: parseRunArgs supplies defaults for every optional field when raw is empty
statusReason: expected 'subprocess' to be 'docker' // Object.is equality

[Killed] ConditionalExpression
src/app/cli.ts:202:106
   const r = asObject(raw);
   const scenarioPath = typeof r["scenario"] === "string" ? r["scenario"] : "";
   const runtime = r["runtime"] === "subprocess" ? "subprocess" : "docker";
-  const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || r["logLevel"] === "warn" || r["logLevel"] === "error")
+  const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || r["logLevel"] === "warn" || false)
     ? r["logLevel"]
     : "info";
killedBy: parseRunArgs accepts each valid logLevel value (debug/info/warn/error)
statusReason: expected 'info' to be 'error' // Object.is equality

[Killed] ConditionalExpression
src/app/cli.ts:202:78
   const r = asObject(raw);
   const scenarioPath = typeof r["scenario"] === "string" ? r["scenario"] : "";
   const runtime = r["runtime"] === "subprocess" ? "subprocess" : "docker";
-  const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || r["logLevel"] === "warn" || r["logLevel"] === "error")
+  const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || false || r["logLevel"] === "error")
     ? r["logLevel"]
     : "info";
killedBy: parseRunArgs accepts each valid logLevel value (debug/info/warn/error)
statusReason: expected 'info' to be 'warn' // Object.is equality

[Killed] ObjectLiteral
src/app/cli.ts:209:40
     scenarioPath,
     runtime,
     ...(typeof r["image"] === "string" ? { image: r["image"] } : {}),
-    ...(typeof r["bin"] === "string" ? { bin: r["bin"] } : {}),
+    ...(typeof r["bin"] === "string" ? {} : {}),
     judge: typeof r["judge"] === "string" ? r["judge"] : "claude-opus-4-7",
     judgeBackend: typeof r["judgeBackend"] === "string" ? r["judgeBackend"] : "anthropic",
killedBy: parseRunArgs passes through string scenario + image + bin when provided
statusReason: expected undefined to be '/usr/bin/claude' // Object.is equality

[Killed] ObjectLiteral
src/app/cli.ts:213:43
     judge: typeof r["judge"] === "string" ? r["judge"] : "claude-opus-4-7",
     judgeBackend: typeof r["judgeBackend"] === "string" ? r["judgeBackend"] : "anthropic",
     runs: typeof r["runs"] === "number" ? r["runs"] : 1,
-    ...(Array.isArray(r["scenarioIds"]) ? { scenarioIds: r["scenarioIds"] as ReadonlyArray<string> } : {}),
+    ...(Array.isArray(r["scenarioIds"]) ? {} : {}),
     results: typeof r["results"] === "string" ? r["results"] : "./eval-results",
     ...(typeof r["githubComment"] === "number" ? { githubComment: r["githubComment"] } : {}),
killedBy: parseRunArgs passes through string scenario + image + bin when provided
statusReason: expected undefined to deeply equal [ 'a', 'b' ]

[Killed] StringLiteral
src/app/cli.ts:214:64
     judgeBackend: typeof r["judgeBackend"] === "string" ? r["judgeBackend"] : "anthropic",
     runs: typeof r["runs"] === "number" ? r["runs"] : 1,
     ...(Array.isArray(r["scenarioIds"]) ? { scenarioIds: r["scenarioIds"] as ReadonlyArray<string> } : {}),
-    results: typeof r["results"] === "string" ? r["results"] : "./eval-results",
+    results: typeof r["results"] === "string" ? r["results"] : "",
     ...(typeof r["githubComment"] === "number" ? { githubComment: r["githubComment"] } : {}),
     ...(typeof r["githubCommentArtifactUrl"] === "string"
killedBy: parseRunArgs supplies defaults for every optional field when raw is empty
statusReason: expected '' to be './eval-results' // Object.is equality

[Killed] ObjectLiteral
src/app/cli.ts:217:9
     results: typeof r["results"] === "string" ? r["results"] : "./eval-results",
     ...(typeof r["githubComment"] === "number" ? { githubComment: r["githubComment"] } : {}),
     ...(typeof r["githubCommentArtifactUrl"] === "string"
-      ? { githubCommentArtifactUrl: r["githubCommentArtifactUrl"] }
+      ? {}
       : {}),
     concurrency: typeof r["concurrency"] === "number" ? r["concurrency"] : 1,
killedBy: parseRunArgs passes through string scenario + image + bin when provided
statusReason: expected undefined to be 'https://example/art' // Object.is equality

[Killed] ObjectLiteral
src/app/cli.ts:221:51
       : {}),
     concurrency: typeof r["concurrency"] === "number" ? r["concurrency"] : 1,
     logLevel,
-    ...(typeof r["totalTimeoutMs"] === "number" ? { totalTimeoutMs: r["totalTimeoutMs"] } : {}),
+    ...(typeof r["totalTimeoutMs"] === "number" ? {} : {}),
     emitBraintrust: r["emitBraintrust"] === true,
     ...(typeof r["emitPromptfoo"] === "string" ? { emitPromptfoo: r["emitPromptfoo"] } : {}),
killedBy: parseRunArgs passes through string scenario + image + bin when provided
statusReason: expected undefined to be 60000 // Object.is equality

[Killed] ConditionalExpression
src/app/cli.ts:222:21
     concurrency: typeof r["concurrency"] === "number" ? r["concurrency"] : 1,
     logLevel,
     ...(typeof r["totalTimeoutMs"] === "number" ? { totalTimeoutMs: r["totalTimeoutMs"] } : {}),
-    emitBraintrust: r["emitBraintrust"] === true,
+    emitBraintrust: true,
     ...(typeof r["emitPromptfoo"] === "string" ? { emitPromptfoo: r["emitPromptfoo"] } : {}),
   };
killedBy: parseRunArgs supplies defaults for every optional field when raw is empty
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/app/cli.ts:222:21
     concurrency: typeof r["concurrency"] === "number" ? r["concurrency"] : 1,
     logLevel,
     ...(typeof r["totalTimeoutMs"] === "number" ? { totalTimeoutMs: r["totalTimeoutMs"] } : {}),
-    emitBraintrust: r["emitBraintrust"] === true,
+    emitBraintrust: false,
     ...(typeof r["emitPromptfoo"] === "string" ? { emitPromptfoo: r["emitPromptfoo"] } : {}),
   };
killedBy: parseRunArgs passes through string scenario + image + bin when provided
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/app/cli.ts:229:23
 
 export function parseScoreArgs(raw: unknown): ScoreCliArgs {
   const r = asObject(raw);
-  const traceFormat = r["traceFormat"] === "otel" ? "otel" : "canonical";
+  const traceFormat = true ? "otel" : "canonical";
   const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || r["logLevel"] === "warn" || r["logLevel"] === "error")
     ? r["logLevel"]
killedBy: parseScoreArgs supplies defaults for every optional field when raw is empty
statusReason: expected 'otel' to be 'canonical' // Object.is equality

[Killed] ConditionalExpression
src/app/cli.ts:229:23
 
 export function parseScoreArgs(raw: unknown): ScoreCliArgs {
   const r = asObject(raw);
-  const traceFormat = r["traceFormat"] === "otel" ? "otel" : "canonical";
+  const traceFormat = false ? "otel" : "canonical";
   const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || r["logLevel"] === "warn" || r["logLevel"] === "error")
     ? r["logLevel"]
killedBy: parseScoreArgs normalizes traceFormat to canonical when value is not `otel`
statusReason: expected 'canonical' to be 'otel' // Object.is equality

[Killed] ConditionalExpression
src/app/cli.ts:230:106
 export function parseScoreArgs(raw: unknown): ScoreCliArgs {
   const r = asObject(raw);
   const traceFormat = r["traceFormat"] === "otel" ? "otel" : "canonical";
-  const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || r["logLevel"] === "warn" || r["logLevel"] === "error")
+  const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || r["logLevel"] === "warn" || false)
     ? r["logLevel"]
     : "info";
killedBy: parseScoreArgs logLevel each position in OR chain accepts logLevel=error (fourth position in OR chain)
statusReason: expected 'info' to be 'error' // Object.is equality

[Killed] ConditionalExpression
src/app/cli.ts:230:78
 export function parseScoreArgs(raw: unknown): ScoreCliArgs {
   const r = asObject(raw);
   const traceFormat = r["traceFormat"] === "otel" ? "otel" : "canonical";
-  const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || r["logLevel"] === "warn" || r["logLevel"] === "error")
+  const logLevel = (r["logLevel"] === "debug" || r["logLevel"] === "info" || false || r["logLevel"] === "error")
     ? r["logLevel"]
     : "info";
killedBy: parseScoreArgs passes through every valid field when raw is fully specified
statusReason: expected 'info' to be 'warn' // Object.is equality

[Killed] StringLiteral
src/app/cli.ts:234:65
     ? r["logLevel"]
     : "info";
   return {
-    tracesPath: typeof r["traces"] === "string" ? r["traces"] : "",
+    tracesPath: typeof r["traces"] === "string" ? r["traces"] : "Stryker was here!",
     traceFormat: traceFormat as TraceFormat,
     judge: typeof r["judge"] === "string" ? r["judge"] : "claude-opus-4-7",
killedBy: parseScoreArgs supplies defaults for every optional field when raw is empty
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] EqualityOperator
src/app/cli.ts:246:21
     concurrency: typeof r["concurrency"] === "number" ? r["concurrency"] : 1,
     logLevel,
     ...(typeof r["totalTimeoutMs"] === "number" ? { totalTimeoutMs: r["totalTimeoutMs"] } : {}),
-    emitBraintrust: r["emitBraintrust"] === true,
+    emitBraintrust: r["emitBraintrust"] !== true,
     ...(typeof r["emitPromptfoo"] === "string" ? { emitPromptfoo: r["emitPromptfoo"] } : {}),
   };
killedBy: parseScoreArgs supplies defaults for every optional field when raw is empty
statusReason: expected true to be false // Object.is equality

[Survived] MethodExpression
src/app/cli.ts:253:26
 
 export function main(argv: ReadonlyArray<string>): Effect.Effect<CliExitCode, never, never> {
   return Effect.suspend(() => {
-    const parsed = yargs(argv.slice())
+    const parsed = yargs(argv)
       .scriptName("cc-judge")
       .command("run <scenario>", "Run scenarios", (y) =>

[Survived] StringLiteral
src/app/cli.ts:254:19
 export function main(argv: ReadonlyArray<string>): Effect.Effect<CliExitCode, never, never> {
   return Effect.suspend(() => {
     const parsed = yargs(argv.slice())
-      .scriptName("cc-judge")
+      .scriptName("")
       .command("run <scenario>", "Run scenarios", (y) =>
         y
