[Killed] ArrowFunction
src/app/cli.ts:255:51
   return Effect.suspend(() => {
     const parsed = yargs(argv.slice())
       .scriptName("cc-judge")
-      .command("run <scenario>", "Run scenarios", (y) =>
-        y
-          .positional("scenario", { type: "string", demandOption: true })
-          .option("runtime", { choices: ["docker", "subprocess"] as const, default: "docker" })
-          .option("image", { type: "string" })
-          .option("bin", { type: "string" })
-          .option("judge", { type: "string", default: "claude-opus-4-7" })
-          .option("judge-backend", { type: "string", default: "anthropic" })
-          .option("runs", { type: "number", default: 1 })
-          .option("scenario-ids", { type: "array", string: true })
-          .option("results", { type: "string", default: "./eval-results" })
-          .option("github-comment", { type: "number" })
-          .option("github-comment-artifact-url", { type: "string" })
-          .option("concurrency", { type: "number", default: 1 })
-          .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
-          .option("total-timeout-ms", { type: "number" })
-          .option("emit-braintrust", { type: "boolean", default: false })
-          .option("emit-promptfoo", { type: "string" }),
+      .command("run <scenario>", "Run scenarios", () => undefined,
       )
       .command("score <traces>", "Score traces", (y) =>
killedBy: main (yargs dispatch) dispatches `run` subcommand to runCommand (exits via runner-resolution path)
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/app/cli.ts:255:16
   return Effect.suspend(() => {
     const parsed = yargs(argv.slice())
       .scriptName("cc-judge")
-      .command("run <scenario>", "Run scenarios", (y) =>
+      .command("", "Run scenarios", (y) =>
         y
           .positional("scenario", { type: "string", demandOption: true })
killedBy: main (yargs dispatch) dispatches `run` subcommand to runCommand (exits via runner-resolution path)
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/app/cli.ts:257:67
       .scriptName("cc-judge")
       .command("run <scenario>", "Run scenarios", (y) =>
         y
-          .positional("scenario", { type: "string", demandOption: true })
+          .positional("scenario", { type: "string", demandOption: false })
           .option("runtime", { choices: ["docker", "subprocess"] as const, default: "docker" })
           .option("image", { type: "string" })

[Killed] StringLiteral
src/app/cli.ts:258:85
       .command("run <scenario>", "Run scenarios", (y) =>
         y
           .positional("scenario", { type: "string", demandOption: true })
-          .option("runtime", { choices: ["docker", "subprocess"] as const, default: "docker" })
+          .option("runtime", { choices: ["docker", "subprocess"] as const, default: "" })
           .option("image", { type: "string" })
           .option("bin", { type: "string" })
killedBy: main (yargs) command dispatch edge cases run command is dispatched (case `run` literal)
statusReason: StrykerJS: Unknown test failure

[Survived] ObjectLiteral
src/app/cli.ts:258:30
       .command("run <scenario>", "Run scenarios", (y) =>
         y
           .positional("scenario", { type: "string", demandOption: true })
-          .option("runtime", { choices: ["docker", "subprocess"] as const, default: "docker" })
+          .option("runtime", {})
           .option("image", { type: "string" })
           .option("bin", { type: "string" })

[Survived] ObjectLiteral
src/app/cli.ts:260:26
           .positional("scenario", { type: "string", demandOption: true })
           .option("runtime", { choices: ["docker", "subprocess"] as const, default: "docker" })
           .option("image", { type: "string" })
-          .option("bin", { type: "string" })
+          .option("bin", {})
           .option("judge", { type: "string", default: "claude-opus-4-7" })
           .option("judge-backend", { type: "string", default: "anthropic" })

[Killed] StringLiteral
src/app/cli.ts:261:19
           .option("runtime", { choices: ["docker", "subprocess"] as const, default: "docker" })
           .option("image", { type: "string" })
           .option("bin", { type: "string" })
-          .option("judge", { type: "string", default: "claude-opus-4-7" })
+          .option("", { type: "string", default: "claude-opus-4-7" })
           .option("judge-backend", { type: "string", default: "anthropic" })
           .option("runs", { type: "number", default: 1 })
killedBy: main (yargs dispatch) main with explicit --judge model passes it through to parseRunArgs
statusReason: StrykerJS: Unknown test failure

[Survived] StringLiteral
src/app/cli.ts:262:63
           .option("image", { type: "string" })
           .option("bin", { type: "string" })
           .option("judge", { type: "string", default: "claude-opus-4-7" })
-          .option("judge-backend", { type: "string", default: "anthropic" })
+          .option("judge-backend", { type: "string", default: "" })
           .option("runs", { type: "number", default: 1 })
           .option("scenario-ids", { type: "array", string: true })

[Killed] StringLiteral
src/app/cli.ts:263:19
           .option("bin", { type: "string" })
           .option("judge", { type: "string", default: "claude-opus-4-7" })
           .option("judge-backend", { type: "string", default: "anthropic" })
-          .option("runs", { type: "number", default: 1 })
+          .option("", { type: "number", default: 1 })
           .option("scenario-ids", { type: "array", string: true })
           .option("results", { type: "string", default: "./eval-results" })
killedBy: main (yargs) option names and defaults --runs default 1 (option resolves with number default)
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/app/cli.ts:264:60
           .option("judge", { type: "string", default: "claude-opus-4-7" })
           .option("judge-backend", { type: "string", default: "anthropic" })
           .option("runs", { type: "number", default: 1 })
-          .option("scenario-ids", { type: "array", string: true })
+          .option("scenario-ids", { type: "array", string: false })
           .option("results", { type: "string", default: "./eval-results" })
           .option("github-comment", { type: "number" })

[Killed] StringLiteral
src/app/cli.ts:264:19
           .option("judge", { type: "string", default: "claude-opus-4-7" })
           .option("judge-backend", { type: "string", default: "anthropic" })
           .option("runs", { type: "number", default: 1 })
-          .option("scenario-ids", { type: "array", string: true })
+          .option("", { type: "array", string: true })
           .option("results", { type: "string", default: "./eval-results" })
           .option("github-comment", { type: "number" })
killedBy: main (yargs) option names and defaults --scenario-ids filters scenarios (run subcommand)
statusReason: StrykerJS: Unknown test failure

[Survived] StringLiteral
src/app/cli.ts:265:57
           .option("judge-backend", { type: "string", default: "anthropic" })
           .option("runs", { type: "number", default: 1 })
           .option("scenario-ids", { type: "array", string: true })
-          .option("results", { type: "string", default: "./eval-results" })
+          .option("results", { type: "string", default: "" })
           .option("github-comment", { type: "number" })
           .option("github-comment-artifact-url", { type: "string" })

[Killed] StringLiteral
src/app/cli.ts:267:19
           .option("scenario-ids", { type: "array", string: true })
           .option("results", { type: "string", default: "./eval-results" })
           .option("github-comment", { type: "number" })
-          .option("github-comment-artifact-url", { type: "string" })
+          .option("", { type: "string" })
           .option("concurrency", { type: "number", default: 1 })
           .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
killedBy: main (yargs) option names and defaults --github-comment-artifact-url passed to run subcommand
statusReason: StrykerJS: Unknown test failure

[Survived] ObjectLiteral
src/app/cli.ts:268:34
           .option("results", { type: "string", default: "./eval-results" })
           .option("github-comment", { type: "number" })
           .option("github-comment-artifact-url", { type: "string" })
-          .option("concurrency", { type: "number", default: 1 })
+          .option("concurrency", {})
           .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
           .option("total-timeout-ms", { type: "number" })

[Killed] StringLiteral
src/app/cli.ts:269:19
           .option("github-comment", { type: "number" })
           .option("github-comment-artifact-url", { type: "string" })
           .option("concurrency", { type: "number", default: 1 })
-          .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
+          .option("", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
           .option("total-timeout-ms", { type: "number" })
           .option("emit-braintrust", { type: "boolean", default: false })
killedBy: main (yargs dispatch) dispatches `run` subcommand to runCommand (exits via runner-resolution path)
statusReason: StrykerJS: Unknown test failure

[Survived] StringLiteral
src/app/cli.ts:269:97
           .option("github-comment", { type: "number" })
           .option("github-comment-artifact-url", { type: "string" })
           .option("concurrency", { type: "number", default: 1 })
-          .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
+          .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "" })
           .option("total-timeout-ms", { type: "number" })
           .option("emit-braintrust", { type: "boolean", default: false })

[Killed] StringLiteral
src/app/cli.ts:270:19
           .option("github-comment-artifact-url", { type: "string" })
           .option("concurrency", { type: "number", default: 1 })
           .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
-          .option("total-timeout-ms", { type: "number" })
+          .option("", { type: "number" })
           .option("emit-braintrust", { type: "boolean", default: false })
           .option("emit-promptfoo", { type: "string" }),
killedBy: main (yargs) option names and defaults --total-timeout-ms passed to run subcommand
statusReason: StrykerJS: Unknown test failure

[Survived] ObjectLiteral
src/app/cli.ts:270:39
           .option("github-comment-artifact-url", { type: "string" })
           .option("concurrency", { type: "number", default: 1 })
           .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
-          .option("total-timeout-ms", { type: "number" })
+          .option("total-timeout-ms", {})
           .option("emit-braintrust", { type: "boolean", default: false })
           .option("emit-promptfoo", { type: "string" }),

[Survived] BooleanLiteral
src/app/cli.ts:271:66
           .option("concurrency", { type: "number", default: 1 })
           .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
           .option("total-timeout-ms", { type: "number" })
-          .option("emit-braintrust", { type: "boolean", default: false })
+          .option("emit-braintrust", { type: "boolean", default: true })
           .option("emit-promptfoo", { type: "string" }),
       )

[Killed] ArrowFunction
src/app/cli.ts:274:50
           .option("emit-braintrust", { type: "boolean", default: false })
           .option("emit-promptfoo", { type: "string" }),
       )
-      .command("score <traces>", "Score traces", (y) =>
-        y
-          .positional("traces", { type: "string", demandOption: true })
-          .option("trace-format", { choices: ["canonical", "otel"] as const, default: "canonical" })
-          .option("judge", { type: "string", default: "claude-opus-4-7" })
-          .option("judge-backend", { type: "string", default: "anthropic" })
-          .option("results", { type: "string", default: "./eval-results" })
-          .option("github-comment", { type: "number" })
-          .option("github-comment-artifact-url", { type: "string" })
-          .option("concurrency", { type: "number", default: 1 })
-          .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
-          .option("total-timeout-ms", { type: "number" })
-          .option("emit-braintrust", { type: "boolean", default: false })
-          .option("emit-promptfoo", { type: "string" }),
+      .command("score <traces>", "Score traces", () => undefined,
       )
       .demandCommand(1)
killedBy: main (yargs dispatch) dispatches `score` subcommand with malformed trace → exit 2
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/app/cli.ts:276:65
       )
       .command("score <traces>", "Score traces", (y) =>
         y
-          .positional("traces", { type: "string", demandOption: true })
+          .positional("traces", { type: "string", demandOption: false })
           .option("trace-format", { choices: ["canonical", "otel"] as const, default: "canonical" })
           .option("judge", { type: "string", default: "claude-opus-4-7" })

[Survived] StringLiteral
src/app/cli.ts:276:23
       )
       .command("score <traces>", "Score traces", (y) =>
         y
-          .positional("traces", { type: "string", demandOption: true })
+          .positional("", { type: "string", demandOption: true })
           .option("trace-format", { choices: ["canonical", "otel"] as const, default: "canonical" })
           .option("judge", { type: "string", default: "claude-opus-4-7" })

[Killed] StringLiteral
src/app/cli.ts:277:87
       .command("score <traces>", "Score traces", (y) =>
         y
           .positional("traces", { type: "string", demandOption: true })
-          .option("trace-format", { choices: ["canonical", "otel"] as const, default: "canonical" })
+          .option("trace-format", { choices: ["canonical", "otel"] as const, default: "" })
           .option("judge", { type: "string", default: "claude-opus-4-7" })
           .option("judge-backend", { type: "string", default: "anthropic" })
killedBy: main (yargs) option names and defaults score subcommand: --total-timeout-ms option name resolves
statusReason: StrykerJS: Unknown test failure

[Survived] ObjectLiteral
src/app/cli.ts:278:28
         y
           .positional("traces", { type: "string", demandOption: true })
           .option("trace-format", { choices: ["canonical", "otel"] as const, default: "canonical" })
-          .option("judge", { type: "string", default: "claude-opus-4-7" })
+          .option("judge", {})
           .option("judge-backend", { type: "string", default: "anthropic" })
           .option("results", { type: "string", default: "./eval-results" })

[Killed] StringLiteral
src/app/cli.ts:279:19
           .positional("traces", { type: "string", demandOption: true })
           .option("trace-format", { choices: ["canonical", "otel"] as const, default: "canonical" })
           .option("judge", { type: "string", default: "claude-opus-4-7" })
-          .option("judge-backend", { type: "string", default: "anthropic" })
+          .option("", { type: "string", default: "anthropic" })
           .option("results", { type: "string", default: "./eval-results" })
           .option("github-comment", { type: "number" })
killedBy: main (yargs) option names and defaults score subcommand: --judge-backend option name resolves
statusReason: StrykerJS: Unknown test failure

[Survived] StringLiteral
src/app/cli.ts:286:19
           .option("concurrency", { type: "number", default: 1 })
           .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
           .option("total-timeout-ms", { type: "number" })
-          .option("emit-braintrust", { type: "boolean", default: false })
+          .option("", { type: "boolean", default: false })
           .option("emit-promptfoo", { type: "string" }),
       )

[Killed] StringLiteral
src/app/cli.ts:287:19
           .option("log-level", { choices: ["debug", "info", "warn", "error"] as const, default: "info" })
           .option("total-timeout-ms", { type: "number" })
           .option("emit-braintrust", { type: "boolean", default: false })
-          .option("emit-promptfoo", { type: "string" }),
+          .option("", { type: "string" }),
       )
       .demandCommand(1)
killedBy: main (yargs) option names and defaults score subcommand: --emit-promptfoo option name resolves
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:294:21
       .help()
       .parseSync();
 
-    const command = Array.isArray(parsed._) && parsed._.length > 0 ? String(parsed._[0]) : "";
+    const command = false ? String(parsed._[0]) : "";
     switch (command) {
       case "run":
killedBy: main (yargs) option names and defaults --scenario-ids filters scenarios (run subcommand)
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/cli.ts:294:48
       .help()
       .parseSync();
 
-    const command = Array.isArray(parsed._) && parsed._.length > 0 ? String(parsed._[0]) : "";
+    const command = Array.isArray(parsed._) && parsed._.length <= 0 ? String(parsed._[0]) : "";
     switch (command) {
       case "run":
killedBy: main (yargs) option names and defaults --scenario-ids filters scenarios (run subcommand)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:296:7
 
     const command = Array.isArray(parsed._) && parsed._.length > 0 ? String(parsed._[0]) : "";
     switch (command) {
-      case "run":
-        return runCommand(parseRunArgs(parsed));
+      case "run":
       case "score":
         return scoreCommand(parseScoreArgs(parsed));
killedBy: main (yargs dispatch) dispatches `run` subcommand to runCommand (exits via runner-resolution path)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/cli.ts:298:7
     switch (command) {
       case "run":
         return runCommand(parseRunArgs(parsed));
-      case "score":
-        return scoreCommand(parseScoreArgs(parsed));
+      case "score":
       default:
         process.stderr.write(`cc-judge: unknown command\n`);
killedBy: main (yargs) command dispatch edge cases score command is dispatched (case `score` literal)
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/app/cli.ts:298:12
     switch (command) {
       case "run":
         return runCommand(parseRunArgs(parsed));
-      case "score":
+      case "":
         return scoreCommand(parseScoreArgs(parsed));
       default:
killedBy: main (yargs) command dispatch edge cases score command is dispatched (case `score` literal)
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/app/cli.ts:307:39
   });
 }
 
-export function cliEntrypoint(): void {
-  const program = main(hideBin(process.argv)).pipe(
-    Effect.tap((code) => Effect.sync(() => process.exit(code))),
-    Effect.catchAllCause((cause) =>
-      Effect.sync(() => {
-        process.stderr.write(`cc-judge: fatal: ${String(cause)}\n`);
-        process.exit(2);
-      }),
-    ),
-  );
-  Effect.runFork(program);
-}
+export function cliEntrypoint(): void {}
 

[NoCoverage] ArrowFunction
src/app/cli.ts:309:38
 
 export function cliEntrypoint(): void {
   const program = main(hideBin(process.argv)).pipe(
-    Effect.tap((code) => Effect.sync(() => process.exit(code))),
+    Effect.tap((code) => Effect.sync(() => undefined)),
     Effect.catchAllCause((cause) =>
       Effect.sync(() => {

[NoCoverage] ArrowFunction
src/app/cli.ts:309:16
 
 export function cliEntrypoint(): void {
   const program = main(hideBin(process.argv)).pipe(
-    Effect.tap((code) => Effect.sync(() => process.exit(code))),
+    Effect.tap(() => undefined),
     Effect.catchAllCause((cause) =>
       Effect.sync(() => {

[NoCoverage] BlockStatement
src/app/cli.ts:311:25
   const program = main(hideBin(process.argv)).pipe(
     Effect.tap((code) => Effect.sync(() => process.exit(code))),
     Effect.catchAllCause((cause) =>
-      Effect.sync(() => {
-        process.stderr.write(`cc-judge: fatal: ${String(cause)}\n`);
-        process.exit(2);
-      }),
+      Effect.sync(() => {}),
     ),
   );

[NoCoverage] StringLiteral
src/app/cli.ts:312:30
     Effect.tap((code) => Effect.sync(() => process.exit(code))),
     Effect.catchAllCause((cause) =>
       Effect.sync(() => {
-        process.stderr.write(`cc-judge: fatal: ${String(cause)}\n`);
+        process.stderr.write(``);
         process.exit(2);
       }),
