[Killed] BlockStatement
src/app/pipeline.ts:38:33
   let changed = 0;
   let added = 0;
   let removed = 0;
-  for (const c of diff.changed) {
-    if (c.before === null && c.after !== null) added += 1;
-    else if (c.before !== null && c.after === null) removed += 1;
-    else changed += 1;
-  }
+  for (const c of diff.changed) {}
   return { changed, added, removed };
 }
killedBy: scoreTraces carries workspaceDiff through when trace provides one
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/app/pipeline.ts:39:48
   let added = 0;
   let removed = 0;
   for (const c of diff.changed) {
-    if (c.before === null && c.after !== null) added += 1;
+    if (c.before === null && c.after !== null) added -= 1;
     else if (c.before !== null && c.after === null) removed += 1;
     else changed += 1;
killedBy: scoreTraces carries workspaceDiff through when trace provides one
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:39:9
   let added = 0;
   let removed = 0;
   for (const c of diff.changed) {
-    if (c.before === null && c.after !== null) added += 1;
+    if (false) added += 1;
     else if (c.before !== null && c.after === null) removed += 1;
     else changed += 1;
killedBy: scoreTraces carries workspaceDiff through when trace provides one
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:40:14
   let removed = 0;
   for (const c of diff.changed) {
     if (c.before === null && c.after !== null) added += 1;
-    else if (c.before !== null && c.after === null) removed += 1;
+    else if (c.before === null && c.after === null) removed += 1;
     else changed += 1;
   }
killedBy: scoreTraces carries workspaceDiff through when trace provides one
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:40:14
   let removed = 0;
   for (const c of diff.changed) {
     if (c.before === null && c.after !== null) added += 1;
-    else if (c.before !== null && c.after === null) removed += 1;
+    else if (true) removed += 1;
     else changed += 1;
   }
killedBy: scoreTraces carries workspaceDiff through when trace provides one
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/app/pipeline.ts:41:10
   for (const c of diff.changed) {
     if (c.before === null && c.after !== null) added += 1;
     else if (c.before !== null && c.after === null) removed += 1;
-    else changed += 1;
+    else changed -= 1;
   }
   return { changed, added, removed };
killedBy: scoreTraces carries workspaceDiff through when trace provides one
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/pipeline.ts:58:26
   let outputTokens = 0;
   let cacheReadTokens = 0;
   let cacheWriteTokens = 0;
-  for (const t of turns) {
-    toolCallCount += t.toolCallCount;
-    inputTokens += t.inputTokens;
-    outputTokens += t.outputTokens;
-    cacheReadTokens += t.cacheReadTokens;
-    cacheWriteTokens += t.cacheWriteTokens;
-  }
+  for (const t of turns) {}
   return { toolCallCount, inputTokens, outputTokens, cacheReadTokens, cacheWriteTokens };
 }
killedBy: runScenarios edge cases (pipeline hardening) aggregates turn tokens and tool calls into RunRecord
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/app/pipeline.ts:59:5
   let cacheReadTokens = 0;
   let cacheWriteTokens = 0;
   for (const t of turns) {
-    toolCallCount += t.toolCallCount;
+    toolCallCount -= t.toolCallCount;
     inputTokens += t.inputTokens;
     outputTokens += t.outputTokens;
killedBy: runScenarios edge cases (pipeline hardening) aggregates turn tokens and tool calls into RunRecord
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/app/pipeline.ts:60:5
   let cacheWriteTokens = 0;
   for (const t of turns) {
     toolCallCount += t.toolCallCount;
-    inputTokens += t.inputTokens;
+    inputTokens -= t.inputTokens;
     outputTokens += t.outputTokens;
     cacheReadTokens += t.cacheReadTokens;
killedBy: runScenarios edge cases (pipeline hardening) aggregates turn tokens and tool calls into RunRecord
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/app/pipeline.ts:61:5
   for (const t of turns) {
     toolCallCount += t.toolCallCount;
     inputTokens += t.inputTokens;
-    outputTokens += t.outputTokens;
+    outputTokens -= t.outputTokens;
     cacheReadTokens += t.cacheReadTokens;
     cacheWriteTokens += t.cacheWriteTokens;
killedBy: runScenarios edge cases (pipeline hardening) aggregates turn tokens and tool calls into RunRecord
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/app/pipeline.ts:62:5
     toolCallCount += t.toolCallCount;
     inputTokens += t.inputTokens;
     outputTokens += t.outputTokens;
-    cacheReadTokens += t.cacheReadTokens;
+    cacheReadTokens -= t.cacheReadTokens;
     cacheWriteTokens += t.cacheWriteTokens;
   }
killedBy: runScenarios edge cases (pipeline hardening) aggregates turn tokens and tool calls into RunRecord
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/app/pipeline.ts:63:5
     inputTokens += t.inputTokens;
     outputTokens += t.outputTokens;
     cacheReadTokens += t.cacheReadTokens;
-    cacheWriteTokens += t.cacheWriteTokens;
+    cacheWriteTokens -= t.cacheWriteTokens;
   }
   return { toolCallCount, inputTokens, outputTokens, cacheReadTokens, cacheWriteTokens };
killedBy: runScenarios edge cases (pipeline hardening) aggregates turn tokens and tool calls into RunRecord
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/app/pipeline.ts:70:11
 
 function criticalJudgeFromError(message: string): JudgeResult {
   return {
-    pass: false,
+    pass: true,
     reason: `pipeline error: ${message}`,
     issues: [{ issue: message, severity: "critical" }],
killedBy: runScenarios edge cases (pipeline hardening) folds runner.start failure into critical JudgeResult without throwing
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/app/pipeline.ts:129:91
   never,
   never
 > {
-  const prompts: ReadonlyArray<string> = [scenario.setupPrompt, ...(scenario.followUps ?? [])];
+  const prompts: ReadonlyArray<string> = [scenario.setupPrompt, ...(scenario.followUps ?? ["Stryker was here"])];
   return Effect.gen(function* () {
     const turns: Turn[] = [];
killedBy: runScenarios edge cases (pipeline hardening) aggregates turn tokens and tool calls into RunRecord
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/pipeline.ts:133:35
   return Effect.gen(function* () {
     const turns: Turn[] = [];
     let error: string | null = null;
-    for (const prompt of prompts) {
-      const attempt = yield* Effect.either(runner.turn(handle, prompt, { timeoutMs }));
-      if (attempt._tag === "Left") {
-        error = `agent turn timed out after ${String(timeoutMs)}ms (turn ${String(attempt.left.turnIndex)})`;
-        break;
-      }
-      turns.push(attempt.right);
-    }
+    for (const prompt of prompts) {}
     return { turns: turns as ReadonlyArray<Turn>, error };
   });
killedBy: runScenarios edge cases (pipeline hardening) aggregates turn tokens and tool calls into RunRecord
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/app/pipeline.ts:136:17
     for (const prompt of prompts) {
       const attempt = yield* Effect.either(runner.turn(handle, prompt, { timeoutMs }));
       if (attempt._tag === "Left") {
-        error = `agent turn timed out after ${String(timeoutMs)}ms (turn ${String(attempt.left.turnIndex)})`;
+        error = ``;
         break;
       }
killedBy: runScenarios edge cases (pipeline hardening) folds turn timeout into critical JudgeResult
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/app/pipeline.ts:161:19
     const startMs = Date.now();
     const startRes = yield* Effect.either(runner.start(scenario));
     if (startRes._tag === "Left") {
-      const msg = `agent start failed: ${startRes.left.cause._tag}`;
+      const msg = ``;
       const record = buildRecord({
         source: "scenario",
killedBy: runScenarios edge cases (pipeline hardening) folds runner.start failure into critical JudgeResult without throwing
statusReason: StrykerJS: Unknown test failure

[Killed] ArithmeticOperator
src/app/pipeline.ts:169:20
         modelName,
         judgeModel,
         startedAt,
-        latencyMs: Date.now() - startMs,
+        latencyMs: Date.now() + startMs,
         judge: criticalJudgeFromError(msg),
         turns: [],
killedBy: ArithmeticOperator: latencyMs = Date.now() - startMs (not +) runner.start failure path computes latencyMs as subtraction
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/app/pipeline.ts:175:73
         transcriptPath: "",
       });
       yield* emitter.emitRun(record);
-      yield* Effect.forEach(obs, (e) => e.onRun({ record }), { discard: true });
+      yield* Effect.forEach(obs, (e) => e.onRun({ record }), { discard: false });
       return record;
     }

[Survived] ObjectLiteral
src/app/pipeline.ts:200:60
       transcriptPath: handle.workspaceDir,
     });
     yield* emitter.emitRun(record);
-    yield* Effect.forEach(obs, (e) => e.onRun({ record }), { discard: true });
+    yield* Effect.forEach(obs, (e) => e.onRun({ record }), {});
     return record;
   });

[Killed] BlockStatement
src/app/pipeline.ts:208:25
 function buildReport(runs: ReadonlyArray<RunRecord>, artifactsDir: string | undefined): Report {
   let passed = 0;
   let latencyTotal = 0;
-  for (const r of runs) {
-    if (r.pass) passed += 1;
-    latencyTotal += r.latencyMs;
-  }
+  for (const r of runs) {}
   const total = runs.length;
   return {
killedBy: runScenarios produces a Report with pass counts for a happy-path runner+judge
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/app/pipeline.ts:209:17
   let passed = 0;
   let latencyTotal = 0;
   for (const r of runs) {
-    if (r.pass) passed += 1;
+    if (r.pass) passed -= 1;
     latencyTotal += r.latencyMs;
   }
killedBy: runScenarios produces a Report with pass counts for a happy-path runner+judge
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:209:9
   let passed = 0;
   let latencyTotal = 0;
   for (const r of runs) {
-    if (r.pass) passed += 1;
+    if (true) passed += 1;
     latencyTotal += r.latencyMs;
   }
killedBy: runScenarios reports failure when judge fails
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/app/pipeline.ts:210:5
   let latencyTotal = 0;
   for (const r of runs) {
     if (r.pass) passed += 1;
-    latencyTotal += r.latencyMs;
+    latencyTotal -= r.latencyMs;
   }
   const total = runs.length;
killedBy: buildReport arithmetic invariants avgLatencyMs is non-zero when runs have positive latency
statusReason: StrykerJS: Unknown test failure

[Killed] ArithmeticOperator
src/app/pipeline.ts:218:15
     summary: {
       total,
       passed,
-      failed: total - passed,
+      failed: total + passed,
       avgLatencyMs: total === 0 ? 0 : latencyTotal / total,
     },
killedBy: buildReport arithmetic invariants passed + failed = total (algebraic invariant)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:219:21
       total,
       passed,
       failed: total - passed,
-      avgLatencyMs: total === 0 ? 0 : latencyTotal / total,
+      avgLatencyMs: false ? 0 : latencyTotal / total,
     },
     ...(artifactsDir !== undefined ? { artifactsDir } : {}),
killedBy: runScenarios edge cases (pipeline hardening) yields avgLatencyMs=0 when no scenarios selected by filter
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:219:21
       total,
       passed,
       failed: total - passed,
-      avgLatencyMs: total === 0 ? 0 : latencyTotal / total,
+      avgLatencyMs: true ? 0 : latencyTotal / total,
     },
     ...(artifactsDir !== undefined ? { artifactsDir } : {}),
killedBy: buildReport arithmetic invariants avgLatencyMs is non-zero when runs have positive latency
statusReason: StrykerJS: Unknown test failure

[Killed] ObjectLiteral
src/app/pipeline.ts:221:38
       failed: total - passed,
       avgLatencyMs: total === 0 ? 0 : latencyTotal / total,
     },
-    ...(artifactsDir !== undefined ? { artifactsDir } : {}),
+    ...(artifactsDir !== undefined ? {} : {}),
   };
 }
killedBy: buildReport arithmetic invariants artifactsDir appears in report when resultsDir is set
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/pipeline.ts:227:61
 
 function resolveRunner(opts: RunOpts): Effect.Effect<AgentRunner, RunnerResolutionError, never> {
   if (opts.runner !== undefined) return Effect.succeed(opts.runner);
-  if (process.env["CC_JUDGE_SUBPROCESS_BIN"] !== undefined) {
-    return Effect.succeed(new SubprocessRunner({ bin: process.env["CC_JUDGE_SUBPROCESS_BIN"] }));
-  }
+  if (process.env["CC_JUDGE_SUBPROCESS_BIN"] !== undefined) {}
   const image = process.env["CC_JUDGE_DOCKER_IMAGE"];
   if (image === undefined) {
killedBy: runScenarios edge cases (pipeline hardening) resolves SubprocessRunner from CC_JUDGE_SUBPROCESS_BIN env var
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:247:11
     const resultsDir = opts.resultsDir ?? "./eval-results";
     const emitter = makeReportEmitter({
       resultsDir,
-      ...(opts.githubComment !== undefined ? { githubComment: opts.githubComment } : {}),
+      ...(false ? { githubComment: opts.githubComment } : {}),
       ...(opts.githubCommentArtifactUrl !== undefined
         ? { githubCommentArtifactUrl: opts.githubCommentArtifactUrl }
killedBy: ConditionalExpression: githubComment spread into makeReportEmitter opts runScenarios passes githubComment to emitter when set
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:247:11
     const resultsDir = opts.resultsDir ?? "./eval-results";
     const emitter = makeReportEmitter({
       resultsDir,
-      ...(opts.githubComment !== undefined ? { githubComment: opts.githubComment } : {}),
+      ...(opts.githubComment === undefined ? { githubComment: opts.githubComment } : {}),
       ...(opts.githubCommentArtifactUrl !== undefined
         ? { githubCommentArtifactUrl: opts.githubCommentArtifactUrl }
killedBy: ConditionalExpression: githubComment spread into makeReportEmitter opts runScenarios passes githubComment to emitter when set
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:248:11
     const emitter = makeReportEmitter({
       resultsDir,
       ...(opts.githubComment !== undefined ? { githubComment: opts.githubComment } : {}),
-      ...(opts.githubCommentArtifactUrl !== undefined
+      ...(opts.githubCommentArtifactUrl === undefined
         ? { githubCommentArtifactUrl: opts.githubCommentArtifactUrl }
         : {}),
killedBy: ConditionalExpression: githubComment spread into makeReportEmitter opts runScenarios passes githubCommentArtifactUrl to emitter when set
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:248:11
     const emitter = makeReportEmitter({
       resultsDir,
       ...(opts.githubComment !== undefined ? { githubComment: opts.githubComment } : {}),
-      ...(opts.githubCommentArtifactUrl !== undefined
+      ...(false
         ? { githubCommentArtifactUrl: opts.githubCommentArtifactUrl }
         : {}),
killedBy: ConditionalExpression: githubComment spread into makeReportEmitter opts runScenarios passes githubCommentArtifactUrl to emitter when set
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:254:23
     });
     const obs = opts.emitters ?? [];
     const runsPer = opts.runsPerScenario ?? DEFAULT_RUNS_PER_SCENARIO;
-    const modelName = runner.kind === "docker" ? "claude-agent-sdk/docker" : "claude-agent-sdk/subprocess";
+    const modelName = runner.kind !== "docker" ? "claude-agent-sdk/docker" : "claude-agent-sdk/subprocess";
     const judgeModel = judge.name;
 
killedBy: runScenarios edge cases (pipeline hardening) tags modelName with runner.kind (subprocess vs docker)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:254:23
     });
     const obs = opts.emitters ?? [];
     const runsPer = opts.runsPerScenario ?? DEFAULT_RUNS_PER_SCENARIO;
-    const modelName = runner.kind === "docker" ? "claude-agent-sdk/docker" : "claude-agent-sdk/subprocess";
+    const modelName = true ? "claude-agent-sdk/docker" : "claude-agent-sdk/subprocess";
     const judgeModel = judge.name;
 
killedBy: runScenarios edge cases (pipeline hardening) tags modelName with runner.kind (subprocess vs docker)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:258:46
     const judgeModel = judge.name;
 
     const filter = opts.scenarioIdFilter;
-    const selected = filter !== undefined && filter.length > 0
+    const selected = filter !== undefined && true
       ? scenarios.filter((s) => filter.includes(s.id))
       : scenarios;
killedBy: runScenarios filter edge cases empty scenarioIdFilter array keeps all scenarios
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:258:46
     const judgeModel = judge.name;
 
     const filter = opts.scenarioIdFilter;
-    const selected = filter !== undefined && filter.length > 0
+    const selected = filter !== undefined && filter.length >= 0
       ? scenarios.filter((s) => filter.includes(s.id))
       : scenarios;
killedBy: runScenarios filter edge cases empty scenarioIdFilter array keeps all scenarios
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/app/pipeline.ts:259:9
 
     const filter = opts.scenarioIdFilter;
     const selected = filter !== undefined && filter.length > 0
-      ? scenarios.filter((s) => filter.includes(s.id))
+      ? scenarios
       : scenarios;
 
killedBy: runScenarios edge cases (pipeline hardening) yields avgLatencyMs=0 when no scenarios selected by filter
statusReason: StrykerJS: Unknown test failure

[Killed] ArrowFunction
src/app/pipeline.ts:259:26
 
     const filter = opts.scenarioIdFilter;
     const selected = filter !== undefined && filter.length > 0
-      ? scenarios.filter((s) => filter.includes(s.id))
+      ? scenarios.filter(() => undefined)
       : scenarios;
 
killedBy: runScenarios edge cases (pipeline hardening) applies scenarioIdFilter inclusively (keeps listed ids)
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/app/pipeline.ts:263:31
       : scenarios;
 
     const jobs: Array<{ readonly scenario: Scenario; readonly runNumber: RunNumberType }> = [];
-    for (const s of selected) {
-      for (let i = 1; i <= runsPer; i += 1) jobs.push({ scenario: s, runNumber: RunNumber(i) });
-    }
+    for (const s of selected) {}
 
     const concurrency = Math.max(1, opts.concurrency ?? DEFAULT_CONCURRENCY);
killedBy: runScenarios produces a Report with pass counts for a happy-path runner+judge
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:264:23
 
     const jobs: Array<{ readonly scenario: Scenario; readonly runNumber: RunNumberType }> = [];
     for (const s of selected) {
-      for (let i = 1; i <= runsPer; i += 1) jobs.push({ scenario: s, runNumber: RunNumber(i) });
+      for (let i = 1; i < runsPer; i += 1) jobs.push({ scenario: s, runNumber: RunNumber(i) });
     }
 
killedBy: runScenarios produces a Report with pass counts for a happy-path runner+judge
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:264:23
 
     const jobs: Array<{ readonly scenario: Scenario; readonly runNumber: RunNumberType }> = [];
     for (const s of selected) {
-      for (let i = 1; i <= runsPer; i += 1) jobs.push({ scenario: s, runNumber: RunNumber(i) });
+      for (let i = 1; i > runsPer; i += 1) jobs.push({ scenario: s, runNumber: RunNumber(i) });
     }
 
killedBy: runScenarios produces a Report with pass counts for a happy-path runner+judge
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/app/pipeline.ts:267:25
       for (let i = 1; i <= runsPer; i += 1) jobs.push({ scenario: s, runNumber: RunNumber(i) });
     }
 
-    const concurrency = Math.max(1, opts.concurrency ?? DEFAULT_CONCURRENCY);
+    const concurrency = Math.min(1, opts.concurrency ?? DEFAULT_CONCURRENCY);
     const records = yield* Effect.forEach(
       jobs,
killedBy: MethodExpression: Math.max(1, concurrency) not Math.min runScenarios uses concurrency=2 when opts.concurrency=2 (not clamped to 1)
statusReason: StrykerJS: Unknown test failure

[Survived] BooleanLiteral
src/app/pipeline.ts:286:74
     );
     const report = buildReport(records, resultsDir);
     yield* emitter.emitReport(report);
-    yield* Effect.forEach(obs, (e) => e.onReport({ report }), { discard: true });
+    yield* Effect.forEach(obs, (e) => e.onReport({ report }), { discard: false });
     if (opts.githubComment !== undefined) {
       yield* emitter.publishGithubComment(report).pipe(

[Survived] ObjectLiteral
src/app/pipeline.ts:286:63
     );
     const report = buildReport(records, resultsDir);
     yield* emitter.emitReport(report);
-    yield* Effect.forEach(obs, (e) => e.onReport({ report }), { discard: true });
+    yield* Effect.forEach(obs, (e) => e.onReport({ report }), {});
     if (opts.githubComment !== undefined) {
       yield* emitter.publishGithubComment(report).pipe(

[Killed] EqualityOperator
src/app/pipeline.ts:287:9
     const report = buildReport(records, resultsDir);
     yield* emitter.emitReport(report);
     yield* Effect.forEach(obs, (e) => e.onReport({ report }), { discard: true });
-    if (opts.githubComment !== undefined) {
+    if (opts.githubComment === undefined) {
       yield* emitter.publishGithubComment(report).pipe(
         Effect.catchAll(() => Effect.void),
killedBy: ConditionalExpression: githubComment if-block executes when set runScenarios calls publishGithubComment when githubComment is set
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:287:9
     const report = buildReport(records, resultsDir);
     yield* emitter.emitReport(report);
     yield* Effect.forEach(obs, (e) => e.onReport({ report }), { discard: true });
-    if (opts.githubComment !== undefined) {
+    if (true) {
       yield* emitter.publishGithubComment(report).pipe(
         Effect.catchAll(() => Effect.void),
killedBy: ConditionalExpression: githubComment if-block executes when set runScenarios does not call publishGithubComment when githubComment is undefined
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/app/pipeline.ts:306:43
 ): Effect.Effect<Report, never, never> {
   return Effect.gen(function* () {
     const judge = opts.judge ?? new AnthropicJudgeBackend();
-    const resultsDir = opts.resultsDir ?? "./eval-results";
+    const resultsDir = opts.resultsDir ?? "";
     const emitter = makeReportEmitter({
       resultsDir,
killedBy: StringLiteral: default resultsDir is './eval-results' scoreTraces passes './eval-results' as resultsDir when omitted
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/app/pipeline.ts:315:25
         : {}),
     });
     const obs = opts.emitters ?? [];
-    const concurrency = Math.max(1, opts.concurrency ?? DEFAULT_CONCURRENCY);
+    const concurrency = Math.min(1, opts.concurrency ?? DEFAULT_CONCURRENCY);
 
     const records = yield* Effect.forEach(
killedBy: MethodExpression: Math.max(1, concurrency) not Math.min scoreTraces uses concurrency=2 when opts.concurrency=2 (not clamped to 1)
statusReason: StrykerJS: Unknown test failure

[Killed] ObjectLiteral
src/app/pipeline.ts:320:7
     const records = yield* Effect.forEach(
       traces,
       (trace) => scoreOneTrace(trace, judge, emitter, obs, opts.abortSignal),
-      { concurrency },
+      {},
     );
     const report = buildReport(records, resultsDir);
killedBy: MethodExpression: Math.max(1, concurrency) not Math.min scoreTraces uses concurrency=2 when opts.concurrency=2 (not clamped to 1)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:337:18
     id: trace.scenarioId ?? scenarioIdFromTraceId(trace.traceId),
     name: trace.name,
     description: "",
-    setupPrompt: trace.turns.length > 0 ? (trace.turns[0]?.prompt ?? "") : "",
+    setupPrompt: false ? (trace.turns[0]?.prompt ?? "") : "",
     expectedBehavior: trace.expectedBehavior,
     validationChecks: trace.validationChecks,
killedBy: scoreOneTrace record field invariants setupPrompt is first turn prompt when turns.length > 0
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:337:18
     id: trace.scenarioId ?? scenarioIdFromTraceId(trace.traceId),
     name: trace.name,
     description: "",
-    setupPrompt: trace.turns.length > 0 ? (trace.turns[0]?.prompt ?? "") : "",
+    setupPrompt: trace.turns.length <= 0 ? (trace.turns[0]?.prompt ?? "") : "",
     expectedBehavior: trace.expectedBehavior,
     validationChecks: trace.validationChecks,
killedBy: scoreOneTrace record field invariants setupPrompt is first turn prompt when turns.length > 0
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/app/pipeline.ts:357:11
     const judgeResult = yield* judge.judge({
       scenario,
       turns: trace.turns,
-      ...(trace.workspaceDiff !== undefined ? { workspaceDiff: trace.workspaceDiff } : {}),
+      ...(trace.workspaceDiff === undefined ? { workspaceDiff: trace.workspaceDiff } : {}),
       ...(abortSignal !== undefined ? { abortSignal } : {}),
     });
killedBy: scoreOneTrace record field invariants workspaceDiff is passed to judge when trace provides one
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/app/pipeline.ts:357:11
     const judgeResult = yield* judge.judge({
       scenario,
       turns: trace.turns,
-      ...(trace.workspaceDiff !== undefined ? { workspaceDiff: trace.workspaceDiff } : {}),
+      ...(false ? { workspaceDiff: trace.workspaceDiff } : {}),
       ...(abortSignal !== undefined ? { abortSignal } : {}),
     });
killedBy: scoreOneTrace record field invariants workspaceDiff is passed to judge when trace provides one
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/app/pipeline.ts:364:18
       source: "trace",
       scenarioId: scenario.id,
       runNumber: RunNumber(1),
-      modelName: "trace",
+      modelName: "",
       judgeModel: judge.name,
       startedAt,
killedBy: scoreOneTrace record field invariants record.modelName is 'trace' (not empty string)
statusReason: StrykerJS: Unknown test failure
