[Killed] BooleanLiteral
src/core/scenario.ts:35:116
 
 const globEff = (pattern: string, cwd?: string): Effect.Effect<ReadonlyArray<string>, LoadError, never> =>
   Effect.tryPromise({
-    try: () => doGlob(pattern, cwd !== undefined ? { cwd, absolute: true, nodir: true } : { absolute: true, nodir: true }),
+    try: () => doGlob(pattern, cwd !== undefined ? { cwd, absolute: true, nodir: true } : { absolute: true, nodir: false }),
     catch: (err) => parseFailure(pattern, err),
   }).pipe(Effect.map((m) => m.slice().sort()));
killedBy: scenarioLoader — globEff else branch (kills L35:91, L35:103, L35:116) glob pattern does not attempt to load directories as files (nodir:true required)
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/core/scenario.ts:35:69
 
 const globEff = (pattern: string, cwd?: string): Effect.Effect<ReadonlyArray<string>, LoadError, never> =>
   Effect.tryPromise({
-    try: () => doGlob(pattern, cwd !== undefined ? { cwd, absolute: true, nodir: true } : { absolute: true, nodir: true }),
+    try: () => doGlob(pattern, cwd !== undefined ? { cwd, absolute: false, nodir: true } : { absolute: true, nodir: true }),
     catch: (err) => parseFailure(pattern, err),
   }).pipe(Effect.map((m) => m.slice().sort()));
killedBy: scenarioLoader properties Prop3 collision detection: two files with the same id yield a tagged DuplicateId error
statusReason: Property failed after 1 tests
{ seed: -726680095, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/core/scenario.ts:37:29
   Effect.tryPromise({
     try: () => doGlob(pattern, cwd !== undefined ? { cwd, absolute: true, nodir: true } : { absolute: true, nodir: true }),
     catch: (err) => parseFailure(pattern, err),
-  }).pipe(Effect.map((m) => m.slice().sort()));
+  }).pipe(Effect.map((m) => m.slice()));
 
 const statEff = (abs: string): Effect.Effect<{ readonly isDirectory: boolean } | null, never, never> =>
killedBy: scenarioLoader — glob options and sort stability directory load returns scenarios in deterministic sorted path order
statusReason: StrykerJS: Unknown test failure

[Survived] MethodExpression
src/core/scenario.ts:37:29
   Effect.tryPromise({
     try: () => doGlob(pattern, cwd !== undefined ? { cwd, absolute: true, nodir: true } : { absolute: true, nodir: true }),
     catch: (err) => parseFailure(pattern, err),
-  }).pipe(Effect.map((m) => m.slice().sort()));
+  }).pipe(Effect.map((m) => m.sort()));
 
 const statEff = (abs: string): Effect.Effect<{ readonly isDirectory: boolean } | null, never, never> =>

[Killed] ConditionalExpression
src/core/scenario.ts:50:9
 
 const resolvePaths = (pathOrGlob: string): Effect.Effect<ReadonlyArray<string>, LoadError, never> =>
   Effect.gen(function* () {
-    if (isGlobPattern(pathOrGlob)) {
+    if (false) {
       return yield* globEff(pathOrGlob);
     }
killedBy: scenarioLoader — glob options and sort stability glob with no cwd returns absolute paths
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/core/scenario.ts:50:36
 
 const resolvePaths = (pathOrGlob: string): Effect.Effect<ReadonlyArray<string>, LoadError, never> =>
   Effect.gen(function* () {
-    if (isGlobPattern(pathOrGlob)) {
-      return yield* globEff(pathOrGlob);
-    }
+    if (isGlobPattern(pathOrGlob)) {}
     const abs = path.resolve(pathOrGlob);
     const st = yield* statEff(abs);
killedBy: scenarioLoader — glob options and sort stability glob with no cwd returns absolute paths
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:56:9
     const abs = path.resolve(pathOrGlob);
     const st = yield* statEff(abs);
     if (st === null) return [];
-    if (st.isDirectory) {
+    if (false) {
       return yield* globEff("**/*.{ts,mts,js,mjs,yaml,yml}", abs);
     }
killedBy: scenarioLoader.loadFromPath loads a directory of YAML scenarios and enforces unique ids
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/core/scenario.ts:56:25
     const abs = path.resolve(pathOrGlob);
     const st = yield* statEff(abs);
     if (st === null) return [];
-    if (st.isDirectory) {
-      return yield* globEff("**/*.{ts,mts,js,mjs,yaml,yml}", abs);
-    }
+    if (st.isDirectory) {}
     return [abs];
   });
killedBy: scenarioLoader.loadFromPath loads a directory of YAML scenarios and enforces unique ids
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/core/scenario.ts:57:29
     const st = yield* statEff(abs);
     if (st === null) return [];
     if (st.isDirectory) {
-      return yield* globEff("**/*.{ts,mts,js,mjs,yaml,yml}", abs);
+      return yield* globEff("", abs);
     }
     return [abs];
killedBy: scenarioLoader.loadFromPath loads a directory of YAML scenarios and enforces unique ids
statusReason: StrykerJS: Unknown test failure

[NoCoverage] EqualityOperator
src/core/scenario.ts:67:57
     try: () => readFile(abs, "utf8"),
     catch: (err) =>
       new LoadError({
-        cause: err instanceof Error && "code" in err && (err as { code?: string }).code === "ENOENT"
+        cause: err instanceof Error && "code" in err && (err as {
+  code?: string;
+}).code !== "ENOENT"
           ? { _tag: "FileNotFound", path: abs }
           : { _tag: "ParseFailure", path: abs, message: err instanceof Error ? err.message : String(err) },

[NoCoverage] ConditionalExpression
src/core/scenario.ts:67:57
     try: () => readFile(abs, "utf8"),
     catch: (err) =>
       new LoadError({
-        cause: err instanceof Error && "code" in err && (err as { code?: string }).code === "ENOENT"
+        cause: err instanceof Error && "code" in err && true
           ? { _tag: "FileNotFound", path: abs }
           : { _tag: "ParseFailure", path: abs, message: err instanceof Error ? err.message : String(err) },

[Killed] BlockStatement
src/core/scenario.ts:85:61
 
 function validateYamlValue(parsed: unknown, originPath: string): Effect.Effect<Scenario, LoadError, never> {
   const errs: string[] = [];
-  for (const e of Value.Errors(ScenarioYamlSchema, parsed)) {
-    errs.push(`${e.path} ${e.message}`);
-  }
+  for (const e of Value.Errors(ScenarioYamlSchema, parsed)) {}
   if (errs.length > 0) {
     return Effect.fail(
killedBy: scenarioLoader.loadFromYaml rejects YAML missing required fields
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/core/scenario.ts:88:7
   for (const e of Value.Errors(ScenarioYamlSchema, parsed)) {
     errs.push(`${e.path} ${e.message}`);
   }
-  if (errs.length > 0) {
+  if (errs.length <= 0) {
     return Effect.fail(
       new LoadError({ cause: { _tag: "SchemaInvalid", path: originPath, errors: errs } }),
killedBy: scenarioLoader.loadFromYaml decodes a valid YAML scenario
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/core/scenario.ts:88:24
   for (const e of Value.Errors(ScenarioYamlSchema, parsed)) {
     errs.push(`${e.path} ${e.message}`);
   }
-  if (errs.length > 0) {
-    return Effect.fail(
-      new LoadError({ cause: { _tag: "SchemaInvalid", path: originPath, errors: errs } }),
-    );
-  }
+  if (errs.length > 0) {}
   const decoded = Value.Decode(ScenarioYamlSchema, parsed);
   const scenario: Scenario = {
killedBy: scenarioLoader properties Prop2 WORKSPACE_PATH_PATTERN invariant: any decoded workspace path is scenario-relative
statusReason: Property failed after 2 tests
{ seed: -461292595, path: "1:0:0:0", endOnFailure: true }
Counterexample: ["C:\\windows\\a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/scenario.ts:116:11
 function importTsScenario(abs: string): Effect.Effect<Scenario, LoadError, never> {
   return importEff(abs).pipe(
     Effect.flatMap((mod) => {
-      if (typeof mod !== "object" || mod === null) {
+      if (true) {
         return Effect.fail(
           new LoadError({
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/core/scenario.ts:116:11
 function importTsScenario(abs: string): Effect.Effect<Scenario, LoadError, never> {
   return importEff(abs).pipe(
     Effect.flatMap((mod) => {
-      if (typeof mod !== "object" || mod === null) {
+      if (typeof mod === "object" || mod === null) {
         return Effect.fail(
           new LoadError({
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[NoCoverage] StringLiteral
src/core/scenario.ts:119:64
       if (typeof mod !== "object" || mod === null) {
         return Effect.fail(
           new LoadError({
-            cause: { _tag: "ParseFailure", path: abs, message: "module has no exports" },
+            cause: { _tag: "ParseFailure", path: abs, message: "" },
           }),
         );

[Killed] LogicalOperator
src/core/scenario.ts:124:25
         );
       }
       const modObj = mod as { readonly default?: unknown; readonly scenario?: unknown };
-      const candidate = modObj.default ?? modObj.scenario;
+      const candidate = modObj.default && modObj.scenario;
       if (candidate === undefined || candidate === null) {
         return Effect.fail(
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/core/scenario.ts:125:11
       }
       const modObj = mod as { readonly default?: unknown; readonly scenario?: unknown };
       const candidate = modObj.default ?? modObj.scenario;
-      if (candidate === undefined || candidate === null) {
+      if (candidate === undefined && candidate === null) {
         return Effect.fail(
           new LoadError({
killedBy: scenarioLoader.loadFromPath rejects TS module with no exports (empty module)
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/core/scenario.ts:125:38
       }
       const modObj = mod as { readonly default?: unknown; readonly scenario?: unknown };
       const candidate = modObj.default ?? modObj.scenario;
-      if (candidate === undefined || candidate === null) {
+      if (candidate === undefined || candidate !== null) {
         return Effect.fail(
           new LoadError({
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/core/scenario.ts:131:24
             cause: {
               _tag: "ParseFailure",
               path: abs,
-              message: "TS scenario module must export `default` or `scenario`",
+              message: "",
             },
           }),
killedBy: scenarioLoader.loadFromPath rejects TS module with no exports (empty module)
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/core/scenario.ts:142:29
 }
 
 function normalizeTsScenario(candidate: unknown, originPath: string): Effect.Effect<Scenario, LoadError, never> {
-  if (candidate === null || typeof candidate !== "object") {
+  if (candidate === null || typeof candidate === "object") {
     return Effect.fail(
       new LoadError({
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:142:29
 }
 
 function normalizeTsScenario(candidate: unknown, originPath: string): Effect.Effect<Scenario, LoadError, never> {
-  if (candidate === null || typeof candidate !== "object") {
+  if (candidate === null || false) {
     return Effect.fail(
       new LoadError({
killedBy: scenarioLoader.loadFromPath rejects TS scenario whose export is not an object
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/core/scenario.ts:153:23
   const passCheck = raw.deterministicPassCheck;
   const failCheck = raw.deterministicFailCheck;
 
-  const passCheckOk = passCheck === undefined || typeof passCheck === "function";
+  const passCheckOk = passCheck === undefined && typeof passCheck === "function";
   const failCheckOk = failCheck === undefined || typeof failCheck === "function";
   if (!passCheckOk || !failCheckOk) {
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/core/scenario.ts:153:50
   const passCheck = raw.deterministicPassCheck;
   const failCheck = raw.deterministicFailCheck;
 
-  const passCheckOk = passCheck === undefined || typeof passCheck === "function";
+  const passCheckOk = passCheck === undefined || typeof passCheck !== "function";
   const failCheckOk = failCheck === undefined || typeof failCheck === "function";
   if (!passCheckOk || !failCheckOk) {
killedBy: scenarioLoader.loadFromPath carries through function-valued deterministicPassCheck/failCheck fields
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:154:23
   const failCheck = raw.deterministicFailCheck;
 
   const passCheckOk = passCheck === undefined || typeof passCheck === "function";
-  const failCheckOk = failCheck === undefined || typeof failCheck === "function";
+  const failCheckOk = true;
   if (!passCheckOk || !failCheckOk) {
     return Effect.fail(
killedBy: scenarioLoader.loadFromPath rejects TS scenario with non-function deterministicFailCheck
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/core/scenario.ts:154:23
   const failCheck = raw.deterministicFailCheck;
 
   const passCheckOk = passCheck === undefined || typeof passCheck === "function";
-  const failCheckOk = failCheck === undefined || typeof failCheck === "function";
+  const failCheckOk = failCheck === undefined && typeof failCheck === "function";
   if (!passCheckOk || !failCheckOk) {
     return Effect.fail(
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/core/scenario.ts:155:7
 
   const passCheckOk = passCheck === undefined || typeof passCheck === "function";
   const failCheckOk = failCheck === undefined || typeof failCheck === "function";
-  if (!passCheckOk || !failCheckOk) {
+  if (passCheckOk || !failCheckOk) {
     return Effect.fail(
       new LoadError({
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/core/scenario.ts:155:23
 
   const passCheckOk = passCheck === undefined || typeof passCheck === "function";
   const failCheckOk = failCheck === undefined || typeof failCheck === "function";
-  if (!passCheckOk || !failCheckOk) {
+  if (!passCheckOk || failCheckOk) {
     return Effect.fail(
       new LoadError({
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/core/scenario.ts:169:45
 
   // Strip function-valued fields before schema validation (TypeBox rejects functions).
   const rest: Record<string, unknown> = {};
-  for (const [k, v] of Object.entries(raw)) {
-    if (k !== "deterministicPassCheck" && k !== "deterministicFailCheck") {
-      rest[k] = v;
-    }
-  }
+  for (const [k, v] of Object.entries(raw)) {}
 
   const errs: string[] = [];
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:170:9
   // Strip function-valued fields before schema validation (TypeBox rejects functions).
   const rest: Record<string, unknown> = {};
   for (const [k, v] of Object.entries(raw)) {
-    if (k !== "deterministicPassCheck" && k !== "deterministicFailCheck") {
+    if (false) {
       rest[k] = v;
     }
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/core/scenario.ts:170:75
   // Strip function-valued fields before schema validation (TypeBox rejects functions).
   const rest: Record<string, unknown> = {};
   for (const [k, v] of Object.entries(raw)) {
-    if (k !== "deterministicPassCheck" && k !== "deterministicFailCheck") {
-      rest[k] = v;
-    }
+    if (k !== "deterministicPassCheck" && k !== "deterministicFailCheck") {}
   }
 
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/core/scenario.ts:175:26
     }
   }
 
-  const errs: string[] = [];
+  const errs: string[] = ["Stryker was here"];
   for (const e of Value.Errors(ScenarioYamlSchema, rest)) {
     errs.push(`${e.path} ${e.message}`);
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/core/scenario.ts:176:59
   }
 
   const errs: string[] = [];
-  for (const e of Value.Errors(ScenarioYamlSchema, rest)) {
-    errs.push(`${e.path} ${e.message}`);
-  }
+  for (const e of Value.Errors(ScenarioYamlSchema, rest)) {}
   if (errs.length > 0) {
     return Effect.fail(new LoadError({ cause: { _tag: "SchemaInvalid", path: originPath, errors: errs } }));
killedBy: scenarioLoader.loadFromPath rejects TS scenario with invalid non-check field (verifies key filter boundary)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:179:7
   for (const e of Value.Errors(ScenarioYamlSchema, rest)) {
     errs.push(`${e.path} ${e.message}`);
   }
-  if (errs.length > 0) {
+  if (false) {
     return Effect.fail(new LoadError({ cause: { _tag: "SchemaInvalid", path: originPath, errors: errs } }));
   }
killedBy: scenarioLoader.loadFromPath rejects TS scenario with invalid non-check field (verifies key filter boundary)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:187:30
   type PassCheck = NonNullable<Scenario["deterministicPassCheck"]>;
   type FailCheck = NonNullable<Scenario["deterministicFailCheck"]>;
   const base: Scenario = { ...decoded, id: ScenarioId(decoded.id) };
-  const withPass: Scenario = passCheck !== undefined
+  const withPass: Scenario = false
     ? { ...base, deterministicPassCheck: passCheck as PassCheck }
     : base;
killedBy: scenarioLoader.loadFromPath carries through function-valued deterministicPassCheck/failCheck fields
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:187:30
   type PassCheck = NonNullable<Scenario["deterministicPassCheck"]>;
   type FailCheck = NonNullable<Scenario["deterministicFailCheck"]>;
   const base: Scenario = { ...decoded, id: ScenarioId(decoded.id) };
-  const withPass: Scenario = passCheck !== undefined
+  const withPass: Scenario = true
     ? { ...base, deterministicPassCheck: passCheck as PassCheck }
     : base;
killedBy: scenarioLoader — passCheck/failCheck property absence (kills L187, L190) scenario without checks does not have deterministicPassCheck property on the object
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:190:30
   const withPass: Scenario = passCheck !== undefined
     ? { ...base, deterministicPassCheck: passCheck as PassCheck }
     : base;
-  const withFail: Scenario = failCheck !== undefined
+  const withFail: Scenario = false
     ? { ...withPass, deterministicFailCheck: failCheck as FailCheck }
     : withPass;
killedBy: scenarioLoader.loadFromPath carries through function-valued deterministicPassCheck/failCheck fields
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:190:30
   const withPass: Scenario = passCheck !== undefined
     ? { ...base, deterministicPassCheck: passCheck as PassCheck }
     : base;
-  const withFail: Scenario = failCheck !== undefined
+  const withFail: Scenario = true
     ? { ...withPass, deterministicFailCheck: failCheck as FailCheck }
     : withPass;
killedBy: scenarioLoader — passCheck/failCheck property absence (kills L187, L190) scenario without checks does not have deterministicPassCheck property on the object
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/core/scenario.ts:197:15
 }
 
 function loadOne(abs: string): Effect.Effect<Scenario, LoadError, never> {
-  const ext = path.extname(abs).toLowerCase();
+  const ext = path.extname(abs).toUpperCase();
   if (YAML_EXT.has(ext)) {
     return readFileEff(abs).pipe(Effect.flatMap((src) => decodeYaml(src, abs)));
killedBy: scenarioLoader properties Prop3 collision detection: two files with the same id yield a tagged DuplicateId error
statusReason: Property failed after 1 tests
{ seed: 1223062149, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/scenario.ts:198:7
 
 function loadOne(abs: string): Effect.Effect<Scenario, LoadError, never> {
   const ext = path.extname(abs).toLowerCase();
-  if (YAML_EXT.has(ext)) {
+  if (true) {
     return readFileEff(abs).pipe(Effect.flatMap((src) => decodeYaml(src, abs)));
   }
killedBy: scenarioLoader.loadFromPath rejects files with unsupported extensions
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:198:7
 
 function loadOne(abs: string): Effect.Effect<Scenario, LoadError, never> {
   const ext = path.extname(abs).toLowerCase();
-  if (YAML_EXT.has(ext)) {
+  if (false) {
     return readFileEff(abs).pipe(Effect.flatMap((src) => decodeYaml(src, abs)));
   }
killedBy: scenarioLoader properties Prop3 collision detection: two files with the same id yield a tagged DuplicateId error
statusReason: Property failed after 1 tests
{ seed: -1625965787, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/scenario.ts:201:7
   if (YAML_EXT.has(ext)) {
     return readFileEff(abs).pipe(Effect.flatMap((src) => decodeYaml(src, abs)));
   }
-  if (TS_EXT.has(ext)) {
+  if (false) {
     return importTsScenario(abs);
   }
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/core/scenario.ts:201:24
   if (YAML_EXT.has(ext)) {
     return readFileEff(abs).pipe(Effect.flatMap((src) => decodeYaml(src, abs)));
   }
-  if (TS_EXT.has(ext)) {
-    return importTsScenario(abs);
-  }
+  if (TS_EXT.has(ext)) {}
   return Effect.fail(
     new LoadError({
killedBy: scenarioLoader.loadFromPath loads a TS scenario via default export
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/core/scenario.ts:219:44
   scenarios: ReadonlyArray<readonly [string, Scenario]>,
 ): Effect.Effect<ReadonlyArray<Scenario>, LoadError, never> {
   const seen = new Map<string, string>();
-  for (const [sourcePath, s] of scenarios) {
-    const prior = seen.get(s.id);
-    if (prior !== undefined) {
-      return Effect.fail(
-        new LoadError({
-          cause: { _tag: "DuplicateId", id: s.id, paths: [prior, sourcePath] as const },
-        }),
-      );
-    }
-    seen.set(s.id, sourcePath);
-  }
+  for (const [sourcePath, s] of scenarios) {}
   return Effect.succeed(scenarios.map(([, s]) => s));
 }
killedBy: scenarioLoader properties Prop3 collision detection: two files with the same id yield a tagged DuplicateId error
statusReason: Property failed after 1 tests
{ seed: 958684187, path: "0:0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/core/scenario.ts:221:30
   const seen = new Map<string, string>();
   for (const [sourcePath, s] of scenarios) {
     const prior = seen.get(s.id);
-    if (prior !== undefined) {
-      return Effect.fail(
-        new LoadError({
-          cause: { _tag: "DuplicateId", id: s.id, paths: [prior, sourcePath] as const },
-        }),
-      );
-    }
+    if (prior !== undefined) {}
     seen.set(s.id, sourcePath);
   }
killedBy: scenarioLoader properties Prop3 collision detection: two files with the same id yield a tagged DuplicateId error
statusReason: Property failed after 1 tests
{ seed: -195383398, path: "0:0", endOnFailure: true }
Counterexample: ["a"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/scenario.ts:237:13
   loadFromPath(pathOrGlob) {
     return resolvePaths(pathOrGlob).pipe(
       Effect.flatMap((paths) => {
-        if (paths.length === 0) {
+        if (true) {
           return isGlobPattern(pathOrGlob)
             ? Effect.fail(new LoadError({ cause: { _tag: "GlobNoMatches", pattern: pathOrGlob } }))
killedBy: scenarioLoader.loadFromPath loads a directory of YAML scenarios and enforces unique ids
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/core/scenario.ts:237:13
   loadFromPath(pathOrGlob) {
     return resolvePaths(pathOrGlob).pipe(
       Effect.flatMap((paths) => {
-        if (paths.length === 0) {
+        if (false) {
           return isGlobPattern(pathOrGlob)
             ? Effect.fail(new LoadError({ cause: { _tag: "GlobNoMatches", pattern: pathOrGlob } }))
killedBy: scenarioLoader.loadFromPath fails with GlobNoMatches on an empty pattern
statusReason: StrykerJS: Unknown test failure
