[NoCoverage] ArrayDeclaration
src/core/schema.ts:282:25
 
 // Helper: format TypeBox error list into short messages for the SchemaInvalid error cause.
 export function formatSchemaErrors(errors: Iterable<{ path: string; message: string }>): ReadonlyArray<string> {
-  const out: string[] = [];
+  const out: string[] = ["Stryker was here"];
   for (const e of errors) out.push(`${e.path} ${e.message}`);
   return out;

[NoCoverage] StringLiteral
src/core/schema.ts:283:36
 // Helper: format TypeBox error list into short messages for the SchemaInvalid error cause.
 export function formatSchemaErrors(errors: Iterable<{ path: string; message: string }>): ReadonlyArray<string> {
   const out: string[] = [];
-  for (const e of errors) out.push(`${e.path} ${e.message}`);
+  for (const e of errors) out.push(``);
   return out;
 }
