[Killed] StringLiteral
src/emit/observability.ts:35:19
 }
 
 export class BraintrustEmitter implements ObservabilityEmitter {
-  readonly name = "braintrust";
+  readonly name = "";
   readonly #opts: BraintrustEmitterOpts;
   #logger: BraintrustLogger<true> | null = null;
killedBy: runCommand buildObservability emitter composition (mock capture) emitBraintrust=true + valid BRAINTRUST_API_KEY → emitters array includes braintrust
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/emit/observability.ts:53:30
   }
 
   onRun(event: ObservabilityEvent): Effect.Effect<void, never, never> {
-    return Effect.sync(() => {
-      try {
-        const logger = this.#ensureLogger();
-        logger.log({
-          input: { scenarioId: event.record.scenarioId, source: event.record.source },
-          output: { pass: event.record.pass, reason: event.record.reason },
-          scores: { pass: event.record.pass ? 1 : 0 },
-          metadata: {
-            runNumber: event.record.runNumber,
-            modelName: event.record.modelName,
-            judgeModel: event.record.judgeModel,
-            latencyMs: event.record.latencyMs,
-            retryCount: event.record.retryCount,
-            toolCallCount: event.record.toolCallCount,
-            inputTokens: event.record.inputTokens,
-            outputTokens: event.record.outputTokens,
-            overallSeverity: event.record.overallSeverity ?? "none",
-          },
-        });
-      } catch (err) {
-        void err;
-        // Invariant #12: observability never affects verdict. Drop and move on.
-      }
-    });
+    return Effect.sync(() => {});
   }
 

[NoCoverage] BlockStatement
src/emit/observability.ts:54:11
 
   onRun(event: ObservabilityEvent): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
-      try {
-        const logger = this.#ensureLogger();
-        logger.log({
-          input: { scenarioId: event.record.scenarioId, source: event.record.source },
-          output: { pass: event.record.pass, reason: event.record.reason },
-          scores: { pass: event.record.pass ? 1 : 0 },
-          metadata: {
-            runNumber: event.record.runNumber,
-            modelName: event.record.modelName,
-            judgeModel: event.record.judgeModel,
-            latencyMs: event.record.latencyMs,
-            retryCount: event.record.retryCount,
-            toolCallCount: event.record.toolCallCount,
-            inputTokens: event.record.inputTokens,
-            outputTokens: event.record.outputTokens,
-            overallSeverity: event.record.overallSeverity ?? "none",
-          },
-        });
-      } catch (err) {
+      try {} catch (err) {
         void err;
         // Invariant #12: observability never affects verdict. Drop and move on.

[NoCoverage] ObjectLiteral
src/emit/observability.ts:56:20
     return Effect.sync(() => {
       try {
         const logger = this.#ensureLogger();
-        logger.log({
-          input: { scenarioId: event.record.scenarioId, source: event.record.source },
-          output: { pass: event.record.pass, reason: event.record.reason },
-          scores: { pass: event.record.pass ? 1 : 0 },
-          metadata: {
-            runNumber: event.record.runNumber,
-            modelName: event.record.modelName,
-            judgeModel: event.record.judgeModel,
-            latencyMs: event.record.latencyMs,
-            retryCount: event.record.retryCount,
-            toolCallCount: event.record.toolCallCount,
-            inputTokens: event.record.inputTokens,
-            outputTokens: event.record.outputTokens,
-            overallSeverity: event.record.overallSeverity ?? "none",
-          },
-        });
+        logger.log({});
       } catch (err) {
         void err;

[NoCoverage] LogicalOperator
src/emit/observability.ts:69:30
             toolCallCount: event.record.toolCallCount,
             inputTokens: event.record.inputTokens,
             outputTokens: event.record.outputTokens,
-            overallSeverity: event.record.overallSeverity ?? "none",
+            overallSeverity: event.record.overallSeverity && "none",
           },
         });

[NoCoverage] StringLiteral
src/emit/observability.ts:69:62
             toolCallCount: event.record.toolCallCount,
             inputTokens: event.record.inputTokens,
             outputTokens: event.record.outputTokens,
-            overallSeverity: event.record.overallSeverity ?? "none",
+            overallSeverity: event.record.overallSeverity ?? "",
           },
         });

[NoCoverage] BlockStatement
src/emit/observability.ts:72:21
             overallSeverity: event.record.overallSeverity ?? "none",
           },
         });
-      } catch (err) {
-        void err;
-        // Invariant #12: observability never affects verdict. Drop and move on.
-      }
+      } catch (err) {}
     });
   }

[Survived] ArrowFunction
src/emit/observability.ts:83:14
     void _event;
     return Effect.tryPromise({
       try: () => this.#flushLogger(),
-      catch: () => null,
+      catch: () => undefined,
     }).pipe(
       Effect.catchAll(() => Effect.void),

[Killed] BlockStatement
src/emit/observability.ts:119:30
   }
 
   onReport(event: ObservabilityReport): Effect.Effect<void, never, never> {
-    return Effect.sync(() => {
-      try {
-        const payload = toPromptfooResults(event.report);
-        const abs = path.resolve(this.#outputPath);
-        mkdirSync(path.dirname(abs), { recursive: true });
-        writeFileSync(abs, JSON.stringify(payload, null, 2), "utf8");
-      } catch (err) {
-        void err;
-        // Invariant #12.
-      }
-    });
+    return Effect.sync(() => {});
   }
 }
killedBy: PromptfooEmitter onReport writes a promptfoo-v3 JSON file with per-run rows and aggregated stats
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/observability.ts:120:11
 
   onReport(event: ObservabilityReport): Effect.Effect<void, never, never> {
     return Effect.sync(() => {
-      try {
-        const payload = toPromptfooResults(event.report);
-        const abs = path.resolve(this.#outputPath);
-        mkdirSync(path.dirname(abs), { recursive: true });
-        writeFileSync(abs, JSON.stringify(payload, null, 2), "utf8");
-      } catch (err) {
+      try {} catch (err) {
         void err;
         // Invariant #12.
killedBy: PromptfooEmitter onReport writes a promptfoo-v3 JSON file with per-run rows and aggregated stats
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/emit/observability.ts:123:51
       try {
         const payload = toPromptfooResults(event.report);
         const abs = path.resolve(this.#outputPath);
-        mkdirSync(path.dirname(abs), { recursive: true });
+        mkdirSync(path.dirname(abs), { recursive: false });
         writeFileSync(abs, JSON.stringify(payload, null, 2), "utf8");
       } catch (err) {
killedBy: PromptfooEmitter onReport with empty report still writes a valid envelope
statusReason: StrykerJS: Unknown test failure

[Killed] ObjectLiteral
src/emit/observability.ts:123:38
       try {
         const payload = toPromptfooResults(event.report);
         const abs = path.resolve(this.#outputPath);
-        mkdirSync(path.dirname(abs), { recursive: true });
+        mkdirSync(path.dirname(abs), {});
         writeFileSync(abs, JSON.stringify(payload, null, 2), "utf8");
       } catch (err) {
killedBy: PromptfooEmitter onReport with empty report still writes a valid envelope
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/emit/observability.ts:125:21
         const abs = path.resolve(this.#outputPath);
         mkdirSync(path.dirname(abs), { recursive: true });
         writeFileSync(abs, JSON.stringify(payload, null, 2), "utf8");
-      } catch (err) {
-        void err;
-        // Invariant #12.
-      }
+      } catch (err) {}
     });
   }

[Survived] ObjectLiteral
src/emit/observability.ts:176:11
       },
     },
     gradingResult: { pass: r.pass, score: r.pass ? 1 : 0, reason: r.reason },
-    vars: {
-      scenarioId: r.scenarioId,
-      runNumber: r.runNumber,
-      source: r.source,
-    },
+    vars: {},
   }));
   let totalPrompt = 0;

[Killed] BlockStatement
src/emit/observability.ts:184:32
   }));
   let totalPrompt = 0;
   let totalCompletion = 0;
-  for (const r of report.runs) {
-    totalPrompt += r.inputTokens;
-    totalCompletion += r.outputTokens;
-  }
+  for (const r of report.runs) {}
   return {
     version: 3,
killedBy: PromptfooEmitter onReport writes a promptfoo-v3 JSON file with per-run rows and aggregated stats
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/emit/observability.ts:185:5
   let totalPrompt = 0;
   let totalCompletion = 0;
   for (const r of report.runs) {
-    totalPrompt += r.inputTokens;
+    totalPrompt -= r.inputTokens;
     totalCompletion += r.outputTokens;
   }
killedBy: PromptfooEmitter onReport writes a promptfoo-v3 JSON file with per-run rows and aggregated stats
statusReason: StrykerJS: Unknown test failure

[Killed] AssignmentOperator
src/emit/observability.ts:186:5
   let totalCompletion = 0;
   for (const r of report.runs) {
     totalPrompt += r.inputTokens;
-    totalCompletion += r.outputTokens;
+    totalCompletion -= r.outputTokens;
   }
   return {
killedBy: PromptfooEmitter onReport writes a promptfoo-v3 JSON file with per-run rows and aggregated stats
statusReason: StrykerJS: Unknown test failure

[Killed] ArithmeticOperator
src/emit/observability.ts:198:18
         successes: report.summary.passed,
         failures: report.summary.failed,
         tokenUsage: {
-          total: totalPrompt + totalCompletion,
+          total: totalPrompt - totalCompletion,
           prompt: totalPrompt,
           completion: totalCompletion,
killedBy: PromptfooEmitter onReport writes a promptfoo-v3 JSON file with per-run rows and aggregated stats
statusReason: StrykerJS: Unknown test failure
