[Killed] BlockStatement
src/emit/report.ts:30:39
 
 const GITHUB_COMMENT_BODY_LIMIT = 65_000;
 
-function ensureDir(dir: string): void {
-  mkdirSync(dir, { recursive: true });
-}
+function ensureDir(dir: string): void {}
 
 function runFilename(record: RunRecord): string {
killedBy: ReportEmitter writes results.jsonl + summary.md + details/*.yaml
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/emit/report.ts:31:31
 const GITHUB_COMMENT_BODY_LIMIT = 65_000;
 
 function ensureDir(dir: string): void {
-  mkdirSync(dir, { recursive: true });
+  mkdirSync(dir, { recursive: false });
 }
 
killedBy: ReportEmitter writes results.jsonl + summary.md + details/*.yaml
statusReason: StrykerJS: Unknown test failure

[Killed] Regex
src/emit/report.ts:35:44
 }
 
 function runFilename(record: RunRecord): string {
-  const safeId = record.scenarioId.replace(/[^A-Za-z0-9_-]/gu, "_");
+  const safeId = record.scenarioId.replace(/[A-Za-z0-9_-]/gu, "_");
   return `${safeId}.${String(record.runNumber)}.yaml`;
 }
killedBy: ReportEmitter writes results.jsonl + summary.md + details/*.yaml
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/report.ts:42:14
 function renderSummary(report: Report): string {
   const { summary } = report;
   const lines: string[] = [];
-  lines.push("# cc-judge report");
+  lines.push("");
   lines.push("");
   lines.push(`- total: ${String(summary.total)}`);
killedBy: ReportEmitter summary contains document header and full statistics block
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/emit/report.ts:48:7
   lines.push(`- passed: ${String(summary.passed)}`);
   lines.push(`- failed: ${String(summary.failed)}`);
   lines.push(`- avg latency: ${summary.avgLatencyMs.toFixed(0)}ms`);
-  if (report.artifactsDir !== undefined) {
+  if (report.artifactsDir === undefined) {
     lines.push(`- artifacts: ${report.artifactsDir}`);
   }
killedBy: ReportEmitter summary contains document header and full statistics block
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/report.ts:48:7
   lines.push(`- passed: ${String(summary.passed)}`);
   lines.push(`- failed: ${String(summary.failed)}`);
   lines.push(`- avg latency: ${summary.avgLatencyMs.toFixed(0)}ms`);
-  if (report.artifactsDir !== undefined) {
+  if (false) {
     lines.push(`- artifacts: ${report.artifactsDir}`);
   }
killedBy: ReportEmitter summary contains document header and full statistics block
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/report.ts:49:16
   lines.push(`- failed: ${String(summary.failed)}`);
   lines.push(`- avg latency: ${summary.avgLatencyMs.toFixed(0)}ms`);
   if (report.artifactsDir !== undefined) {
-    lines.push(`- artifacts: ${report.artifactsDir}`);
+    lines.push(``);
   }
   lines.push("");
killedBy: ReportEmitter summary contains document header and full statistics block
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/report.ts:51:14
   if (report.artifactsDir !== undefined) {
     lines.push(`- artifacts: ${report.artifactsDir}`);
   }
-  lines.push("");
+  lines.push("Stryker was here!");
   lines.push("## Runs");
   lines.push("");
killedBy: ReportEmitter summary uses newline as section separator (not empty string)
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/report.ts:54:14
   lines.push("");
   lines.push("## Runs");
   lines.push("");
-  lines.push("| scenario | run | verdict | severity | latency | retries |");
+  lines.push("");
   lines.push("| --- | --- | --- | --- | --- | --- |");
   for (const r of report.runs) {
killedBy: ReportEmitter summary includes runs section header and table header row
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/report.ts:56:32
   lines.push("");
   lines.push("| scenario | run | verdict | severity | latency | retries |");
   lines.push("| --- | --- | --- | --- | --- | --- |");
-  for (const r of report.runs) {
-    const verdict = r.pass ? "PASS" : "FAIL";
-    const severity = r.overallSeverity ?? "-";
-    lines.push(
-      `| ${r.scenarioId} | ${String(r.runNumber)} | ${verdict} | ${severity} | ${String(r.latencyMs)}ms | ${String(r.retryCount)} |`,
-    );
-  }
+  for (const r of report.runs) {}
   lines.push("");
   lines.push("## Failures");
killedBy: ReportEmitter summary table row shows PASS verdict and dash for null overallSeverity
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/emit/report.ts:58:22
   lines.push("| --- | --- | --- | --- | --- | --- |");
   for (const r of report.runs) {
     const verdict = r.pass ? "PASS" : "FAIL";
-    const severity = r.overallSeverity ?? "-";
+    const severity = r.overallSeverity && "-";
     lines.push(
       `| ${r.scenarioId} | ${String(r.runNumber)} | ${verdict} | ${severity} | ${String(r.latencyMs)}ms | ${String(r.retryCount)} |`,
killedBy: ReportEmitter summary table row shows PASS verdict and dash for null overallSeverity
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/report.ts:65:14
   }
   lines.push("");
   lines.push("## Failures");
-  lines.push("");
+  lines.push("Stryker was here!");
   const failures = report.runs.filter((r) => !r.pass);
   if (failures.length === 0) {
killedBy: ReportEmitter summary uses newline as section separator (not empty string)
statusReason: StrykerJS: Unknown test failure

[Killed] ArrowFunction
src/emit/report.ts:66:39
   lines.push("");
   lines.push("## Failures");
   lines.push("");
-  const failures = report.runs.filter((r) => !r.pass);
+  const failures = report.runs.filter(() => undefined);
   if (failures.length === 0) {
     lines.push("None.");
killedBy: ReportEmitter summary failure block includes heading, reason line, and issue list
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/emit/report.ts:66:20
   lines.push("");
   lines.push("## Failures");
   lines.push("");
-  const failures = report.runs.filter((r) => !r.pass);
+  const failures = report.runs;
   if (failures.length === 0) {
     lines.push("None.");
killedBy: ReportEmitter summary failures section shows no-failures marker when all runs pass
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/report.ts:67:30
   lines.push("## Failures");
   lines.push("");
   const failures = report.runs.filter((r) => !r.pass);
-  if (failures.length === 0) {
-    lines.push("None.");
-  } else {
+  if (failures.length === 0) {} else {
     for (const r of failures) {
       lines.push(`### ${r.scenarioId} #${String(r.runNumber)}`);
killedBy: ReportEmitter summary failures section shows no-failures marker when all runs pass
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/report.ts:67:7
   lines.push("## Failures");
   lines.push("");
   const failures = report.runs.filter((r) => !r.pass);
-  if (failures.length === 0) {
+  if (false) {
     lines.push("None.");
   } else {
killedBy: ReportEmitter summary failures section shows no-failures marker when all runs pass
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/report.ts:68:16
   lines.push("");
   const failures = report.runs.filter((r) => !r.pass);
   if (failures.length === 0) {
-    lines.push("None.");
+    lines.push("");
   } else {
     for (const r of failures) {
killedBy: ReportEmitter summary failures section shows no-failures marker when all runs pass
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/report.ts:69:10
   const failures = report.runs.filter((r) => !r.pass);
   if (failures.length === 0) {
     lines.push("None.");
-  } else {
-    for (const r of failures) {
-      lines.push(`### ${r.scenarioId} #${String(r.runNumber)}`);
-      lines.push(`- reason: ${r.reason}`);
-      if (r.issues.length > 0) {
-        lines.push("- issues:");
-        for (const i of r.issues) {
-          lines.push(`  - [${i.severity}] ${i.issue}`);
-        }
-      }
-      lines.push("");
-    }
-  }
+  } else {}
   return lines.join("\n");
 }
killedBy: ReportEmitter summary failure block includes heading, reason line, and issue list
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/report.ts:70:31
   if (failures.length === 0) {
     lines.push("None.");
   } else {
-    for (const r of failures) {
-      lines.push(`### ${r.scenarioId} #${String(r.runNumber)}`);
-      lines.push(`- reason: ${r.reason}`);
-      if (r.issues.length > 0) {
-        lines.push("- issues:");
-        for (const i of r.issues) {
-          lines.push(`  - [${i.severity}] ${i.issue}`);
-        }
-      }
-      lines.push("");
-    }
+    for (const r of failures) {}
   }
   return lines.join("\n");
killedBy: ReportEmitter summary failure block includes heading, reason line, and issue list
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/report.ts:72:18
   } else {
     for (const r of failures) {
       lines.push(`### ${r.scenarioId} #${String(r.runNumber)}`);
-      lines.push(`- reason: ${r.reason}`);
+      lines.push(``);
       if (r.issues.length > 0) {
         lines.push("- issues:");
killedBy: ReportEmitter summary failure block includes heading, reason line, and issue list
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/report.ts:73:32
     for (const r of failures) {
       lines.push(`### ${r.scenarioId} #${String(r.runNumber)}`);
       lines.push(`- reason: ${r.reason}`);
-      if (r.issues.length > 0) {
-        lines.push("- issues:");
-        for (const i of r.issues) {
-          lines.push(`  - [${i.severity}] ${i.issue}`);
-        }
-      }
+      if (r.issues.length > 0) {}
       lines.push("");
     }
killedBy: ReportEmitter summary failure block includes heading, reason line, and issue list
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/report.ts:73:11
     for (const r of failures) {
       lines.push(`### ${r.scenarioId} #${String(r.runNumber)}`);
       lines.push(`- reason: ${r.reason}`);
-      if (r.issues.length > 0) {
+      if (false) {
         lines.push("- issues:");
         for (const i of r.issues) {
killedBy: ReportEmitter summary failure block includes heading, reason line, and issue list
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/report.ts:74:20
       lines.push(`### ${r.scenarioId} #${String(r.runNumber)}`);
       lines.push(`- reason: ${r.reason}`);
       if (r.issues.length > 0) {
-        lines.push("- issues:");
+        lines.push("");
         for (const i of r.issues) {
           lines.push(`  - [${i.severity}] ${i.issue}`);
killedBy: ReportEmitter summary failure block includes heading, reason line, and issue list
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/report.ts:75:35
       lines.push(`- reason: ${r.reason}`);
       if (r.issues.length > 0) {
         lines.push("- issues:");
-        for (const i of r.issues) {
-          lines.push(`  - [${i.severity}] ${i.issue}`);
-        }
+        for (const i of r.issues) {}
       }
       lines.push("");
killedBy: ReportEmitter summary failure block includes heading, reason line, and issue list
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/emit/report.ts:86:7
 }
 
 function truncateForGitHub(body: string, artifactUrl: string | undefined): string {
-  if (body.length <= GITHUB_COMMENT_BODY_LIMIT) return body;
+  if (true) return body;
   const prefix = body.slice(0, GITHUB_COMMENT_BODY_LIMIT - 500);
   const suffix = artifactUrl !== undefined

[Survived] EqualityOperator
src/emit/report.ts:86:7
 }
 
 function truncateForGitHub(body: string, artifactUrl: string | undefined): string {
-  if (body.length <= GITHUB_COMMENT_BODY_LIMIT) return body;
+  if (body.length < GITHUB_COMMENT_BODY_LIMIT) return body;
   const prefix = body.slice(0, GITHUB_COMMENT_BODY_LIMIT - 500);
   const suffix = artifactUrl !== undefined

[Survived] ArithmeticOperator
src/emit/report.ts:87:32
 
 function truncateForGitHub(body: string, artifactUrl: string | undefined): string {
   if (body.length <= GITHUB_COMMENT_BODY_LIMIT) return body;
-  const prefix = body.slice(0, GITHUB_COMMENT_BODY_LIMIT - 500);
+  const prefix = body.slice(0, GITHUB_COMMENT_BODY_LIMIT + 500);
   const suffix = artifactUrl !== undefined
     ? `\n\n…truncated. Full report: ${artifactUrl}`

[Survived] MethodExpression
src/emit/report.ts:87:18
 
 function truncateForGitHub(body: string, artifactUrl: string | undefined): string {
   if (body.length <= GITHUB_COMMENT_BODY_LIMIT) return body;
-  const prefix = body.slice(0, GITHUB_COMMENT_BODY_LIMIT - 500);
+  const prefix = body;
   const suffix = artifactUrl !== undefined
     ? `\n\n…truncated. Full report: ${artifactUrl}`

[Survived] ConditionalExpression
src/emit/report.ts:88:18
 function truncateForGitHub(body: string, artifactUrl: string | undefined): string {
   if (body.length <= GITHUB_COMMENT_BODY_LIMIT) return body;
   const prefix = body.slice(0, GITHUB_COMMENT_BODY_LIMIT - 500);
-  const suffix = artifactUrl !== undefined
+  const suffix = false
     ? `\n\n…truncated. Full report: ${artifactUrl}`
     : "\n\n…truncated (raise --github-comment-artifact-url to link the full report).";

[Survived] ConditionalExpression
src/emit/report.ts:88:18
 function truncateForGitHub(body: string, artifactUrl: string | undefined): string {
   if (body.length <= GITHUB_COMMENT_BODY_LIMIT) return body;
   const prefix = body.slice(0, GITHUB_COMMENT_BODY_LIMIT - 500);
-  const suffix = artifactUrl !== undefined
+  const suffix = true
     ? `\n\n…truncated. Full report: ${artifactUrl}`
     : "\n\n…truncated (raise --github-comment-artifact-url to link the full report).";

[Killed] StringLiteral
src/emit/report.ts:96:18
 
 function ghAvailable(): boolean {
   try {
-    execFileSync("gh", ["--version"], { stdio: "ignore" });
+    execFileSync("", ["--version"], { stdio: "ignore" });
     return true;
   } catch (err) {
killedBy: ReportEmitter publishGithubComment fails with GhCliFailed when gh cli is available but pr does not exist
statusReason: StrykerJS: Unknown test failure

[Survived] ObjectLiteral
src/emit/report.ts:96:39
 
 function ghAvailable(): boolean {
   try {
-    execFileSync("gh", ["--version"], { stdio: "ignore" });
+    execFileSync("gh", ["--version"], {});
     return true;
   } catch (err) {

[Killed] BooleanLiteral
src/emit/report.ts:97:12
 function ghAvailable(): boolean {
   try {
     execFileSync("gh", ["--version"], { stdio: "ignore" });
-    return true;
+    return false;
   } catch (err) {
     void err;
killedBy: ReportEmitter publishGithubComment fails with GhCliFailed when gh cli is available but pr does not exist
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BooleanLiteral
src/emit/report.ts:100:12
     return true;
   } catch (err) {
     void err;
-    return false;
+    return true;
   }
 }

[Killed] ConditionalExpression
src/emit/report.ts:106:9
 
 function postGithubComment(prNumber: number, body: string): Effect.Effect<void, PublishError, never> {
   return Effect.suspend(() => {
-    if (!ghAvailable()) {
+    if (true) {
       return Effect.fail(new PublishError({ cause: { _tag: "GhCliMissing" } }));
     }
killedBy: ReportEmitter publishGithubComment fails with GhCliFailed when gh cli is available but pr does not exist
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/emit/report.ts:106:9
 
 function postGithubComment(prNumber: number, body: string): Effect.Effect<void, PublishError, never> {
   return Effect.suspend(() => {
-    if (!ghAvailable()) {
+    if (ghAvailable()) {
       return Effect.fail(new PublishError({ cause: { _tag: "GhCliMissing" } }));
     }
killedBy: ReportEmitter publishGithubComment fails with GhCliFailed when gh cli is available but pr does not exist
statusReason: StrykerJS: Unknown test failure

[Timeout] BlockStatement
src/emit/report.ts:124:49
 }
 
 function runGh(prNumber: number, body: string) {
-  return new Promise<void>((resolve, reject) => {
-    try {
-      execFileSync("gh", ["pr", "comment", String(prNumber), "--body-file", "-"], {
-        input: body,
-        stdio: ["pipe", "ignore", "pipe"],
-      });
-      resolve();
-    } catch (err) {
-      reject(err instanceof Error ? err : new Error(String(err)));
-    }
-  });
+  return new Promise<void>((resolve, reject) => {});
 }
 

[Timeout] BlockStatement
src/emit/report.ts:125:9
 
 function runGh(prNumber: number, body: string) {
   return new Promise<void>((resolve, reject) => {
-    try {
-      execFileSync("gh", ["pr", "comment", String(prNumber), "--body-file", "-"], {
-        input: body,
-        stdio: ["pipe", "ignore", "pipe"],
-      });
-      resolve();
-    } catch (err) {
+    try {} catch (err) {
       reject(err instanceof Error ? err : new Error(String(err)));
     }

[Survived] ObjectLiteral
src/emit/report.ts:126:83
 function runGh(prNumber: number, body: string) {
   return new Promise<void>((resolve, reject) => {
     try {
-      execFileSync("gh", ["pr", "comment", String(prNumber), "--body-file", "-"], {
-        input: body,
-        stdio: ["pipe", "ignore", "pipe"],
-      });
+      execFileSync("gh", ["pr", "comment", String(prNumber), "--body-file", "-"], {});
       resolve();
     } catch (err) {

[Survived] StringLiteral
src/emit/report.ts:126:77
 function runGh(prNumber: number, body: string) {
   return new Promise<void>((resolve, reject) => {
     try {
-      execFileSync("gh", ["pr", "comment", String(prNumber), "--body-file", "-"], {
+      execFileSync("gh", ["pr", "comment", String(prNumber), "--body-file", ""], {
         input: body,
         stdio: ["pipe", "ignore", "pipe"],

[Survived] ArrayDeclaration
src/emit/report.ts:128:16
     try {
       execFileSync("gh", ["pr", "comment", String(prNumber), "--body-file", "-"], {
         input: body,
-        stdio: ["pipe", "ignore", "pipe"],
+        stdio: [],
       });
       resolve();

[Timeout] BlockStatement
src/emit/report.ts:131:19
         stdio: ["pipe", "ignore", "pipe"],
       });
       resolve();
-    } catch (err) {
-      reject(err instanceof Error ? err : new Error(String(err)));
-    }
+    } catch (err) {}
   });
 }

[Killed] BlockStatement
src/emit/report.ts:145:32
 
   return {
     emitRun(record) {
-      return Effect.sync(() => {
-        try {
-          ensureDir(detailsDir);
-          appendFileSync(jsonlPath, `${JSON.stringify(record)}\n`, "utf8");
-          const yamlPath = path.join(detailsDir, runFilename(record));
-          writeFileSync(yamlPath, YAML.stringify(record), "utf8");
-        } catch (err) {
-          void err;
-          // Emission is non-verdict. Drop and move on (invariant #12).
-        }
-      });
+      return Effect.sync(() => {});
     },
 
killedBy: ReportEmitter emitRun appends json lines to jsonl with trailing newline separator
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/report.ts:146:13
   return {
     emitRun(record) {
       return Effect.sync(() => {
-        try {
-          ensureDir(detailsDir);
-          appendFileSync(jsonlPath, `${JSON.stringify(record)}\n`, "utf8");
-          const yamlPath = path.join(detailsDir, runFilename(record));
-          writeFileSync(yamlPath, YAML.stringify(record), "utf8");
-        } catch (err) {
+        try {} catch (err) {
           void err;
           // Emission is non-verdict. Drop and move on (invariant #12).
killedBy: ReportEmitter emitRun appends json lines to jsonl with trailing newline separator
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/emit/report.ts:151:23
           appendFileSync(jsonlPath, `${JSON.stringify(record)}\n`, "utf8");
           const yamlPath = path.join(detailsDir, runFilename(record));
           writeFileSync(yamlPath, YAML.stringify(record), "utf8");
-        } catch (err) {
-          void err;
-          // Emission is non-verdict. Drop and move on (invariant #12).
-        }
+        } catch (err) {}
       });
     },

[Killed] BlockStatement
src/emit/report.ts:159:32
     },
 
     emitReport(report) {
-      return Effect.sync(() => {
-        try {
-          ensureDir(resultsDir);
-          // Rewrite results.jsonl from the finalized record list. The streaming
-          // emitRun path is best-effort; the report is the canonical form.
-          if (existsSync(jsonlPath)) unlinkSync(jsonlPath);
-          const jsonl = report.runs.map((r) => JSON.stringify(r)).join("\n");
-          writeFileSync(jsonlPath, jsonl.length > 0 ? `${jsonl}\n` : "", "utf8");
-          writeFileSync(summaryPath, renderSummary(report), "utf8");
-          ensureDir(detailsDir);
-          for (const r of report.runs) {
-            writeFileSync(path.join(detailsDir, runFilename(r)), YAML.stringify(r), "utf8");
-          }
-        } catch (err) {
-          void err;
-          // See emitRun comment. Verdict data is already in Report; disk is secondary.
-        }
-      });
+      return Effect.sync(() => {});
     },
 
killedBy: ReportEmitter writes results.jsonl + summary.md + details/*.yaml
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/report.ts:160:13
 
     emitReport(report) {
       return Effect.sync(() => {
-        try {
-          ensureDir(resultsDir);
-          // Rewrite results.jsonl from the finalized record list. The streaming
-          // emitRun path is best-effort; the report is the canonical form.
-          if (existsSync(jsonlPath)) unlinkSync(jsonlPath);
-          const jsonl = report.runs.map((r) => JSON.stringify(r)).join("\n");
-          writeFileSync(jsonlPath, jsonl.length > 0 ? `${jsonl}\n` : "", "utf8");
-          writeFileSync(summaryPath, renderSummary(report), "utf8");
-          ensureDir(detailsDir);
-          for (const r of report.runs) {
-            writeFileSync(path.join(detailsDir, runFilename(r)), YAML.stringify(r), "utf8");
-          }
-        } catch (err) {
+        try {} catch (err) {
           void err;
           // See emitRun comment. Verdict data is already in Report; disk is secondary.
killedBy: ReportEmitter writes results.jsonl + summary.md + details/*.yaml
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/report.ts:164:15
           ensureDir(resultsDir);
           // Rewrite results.jsonl from the finalized record list. The streaming
           // emitRun path is best-effort; the report is the canonical form.
-          if (existsSync(jsonlPath)) unlinkSync(jsonlPath);
+          if (true) unlinkSync(jsonlPath);
           const jsonl = report.runs.map((r) => JSON.stringify(r)).join("\n");
           writeFileSync(jsonlPath, jsonl.length > 0 ? `${jsonl}\n` : "", "utf8");
killedBy: ReportEmitter readRunsJsonl round-trips
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/emit/report.ts:164:15
           ensureDir(resultsDir);
           // Rewrite results.jsonl from the finalized record list. The streaming
           // emitRun path is best-effort; the report is the canonical form.
-          if (existsSync(jsonlPath)) unlinkSync(jsonlPath);
+          if (false) unlinkSync(jsonlPath);
           const jsonl = report.runs.map((r) => JSON.stringify(r)).join("\n");
           writeFileSync(jsonlPath, jsonl.length > 0 ? `${jsonl}\n` : "", "utf8");

[Killed] ArrowFunction
src/emit/report.ts:165:41
           // Rewrite results.jsonl from the finalized record list. The streaming
           // emitRun path is best-effort; the report is the canonical form.
           if (existsSync(jsonlPath)) unlinkSync(jsonlPath);
-          const jsonl = report.runs.map((r) => JSON.stringify(r)).join("\n");
+          const jsonl = report.runs.map(() => undefined).join("\n");
           writeFileSync(jsonlPath, jsonl.length > 0 ? `${jsonl}\n` : "", "utf8");
           writeFileSync(summaryPath, renderSummary(report), "utf8");
killedBy: ReportEmitter writes results.jsonl + summary.md + details/*.yaml
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/emit/report.ts:166:36
           // emitRun path is best-effort; the report is the canonical form.
           if (existsSync(jsonlPath)) unlinkSync(jsonlPath);
           const jsonl = report.runs.map((r) => JSON.stringify(r)).join("\n");
-          writeFileSync(jsonlPath, jsonl.length > 0 ? `${jsonl}\n` : "", "utf8");
+          writeFileSync(jsonlPath, jsonl.length >= 0 ? `${jsonl}\n` : "", "utf8");
           writeFileSync(summaryPath, renderSummary(report), "utf8");
           ensureDir(detailsDir);
killedBy: ReportEmitter emitReport writes empty string to jsonl for zero runs
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/report.ts:166:36
           // emitRun path is best-effort; the report is the canonical form.
           if (existsSync(jsonlPath)) unlinkSync(jsonlPath);
           const jsonl = report.runs.map((r) => JSON.stringify(r)).join("\n");
-          writeFileSync(jsonlPath, jsonl.length > 0 ? `${jsonl}\n` : "", "utf8");
+          writeFileSync(jsonlPath, false ? `${jsonl}\n` : "", "utf8");
           writeFileSync(summaryPath, renderSummary(report), "utf8");
           ensureDir(detailsDir);
killedBy: ReportEmitter writes results.jsonl + summary.md + details/*.yaml
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/report.ts:169:40
           writeFileSync(jsonlPath, jsonl.length > 0 ? `${jsonl}\n` : "", "utf8");
           writeFileSync(summaryPath, renderSummary(report), "utf8");
           ensureDir(detailsDir);
-          for (const r of report.runs) {
-            writeFileSync(path.join(detailsDir, runFilename(r)), YAML.stringify(r), "utf8");
-          }
+          for (const r of report.runs) {}
         } catch (err) {
           void err;
killedBy: ReportEmitter emitReport writes yaml detail files for every run in report
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/emit/report.ts:172:23
           for (const r of report.runs) {
             writeFileSync(path.join(detailsDir, runFilename(r)), YAML.stringify(r), "utf8");
           }
-        } catch (err) {
-          void err;
-          // See emitRun comment. Verdict data is already in Report; disk is secondary.
-        }
+        } catch (err) {}
       });
     },

[Killed] BooleanLiteral
src/emit/report.ts:192:7
 // to resume from partial output when run with --continue.
 export function readRunsJsonl(resultsDir: string): ReadonlyArray<RunRecord> {
   const jsonlPath = path.join(path.resolve(resultsDir), "results.jsonl");
-  if (!existsSync(jsonlPath)) return [];
+  if (existsSync(jsonlPath)) return [];
   const raw = readFileSync(jsonlPath, "utf8");
   const out: RunRecord[] = [];
killedBy: ReportEmitter readRunsJsonl round-trips
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/report.ts:192:7
 // to resume from partial output when run with --continue.
 export function readRunsJsonl(resultsDir: string): ReadonlyArray<RunRecord> {
   const jsonlPath = path.join(path.resolve(resultsDir), "results.jsonl");
-  if (!existsSync(jsonlPath)) return [];
+  if (false) return [];
   const raw = readFileSync(jsonlPath, "utf8");
   const out: RunRecord[] = [];
killedBy: readRunsJsonl returns empty array for a non-existent path
statusReason: ENOENT: no such file or directory, open '/definitely/nonexistent/path-abc-xyz-9999/results.jsonl'

[Killed] BlockStatement
src/emit/report.ts:195:39
   if (!existsSync(jsonlPath)) return [];
   const raw = readFileSync(jsonlPath, "utf8");
   const out: RunRecord[] = [];
-  for (const line of raw.split("\n")) {
-    const trimmed = line.trim();
-    if (trimmed.length === 0) continue;
-    let parsed: unknown;
-    try {
-      parsed = JSON.parse(trimmed);
-    } catch (err) {
-      void err;
-      // Skip malformed line; inflight-crash recovery is best-effort.
-      continue;
-    }
-    if (!Value.Check(RunRecordSchema, parsed)) continue;
-    const decoded = Value.Decode(RunRecordSchema, parsed);
-    const { scenarioId: rawScenarioId, traceId: rawTraceId, runNumber: rawRunNumber, ...rest } = decoded;
-    const record: RunRecord = {
-      ...rest,
-      scenarioId: ScenarioId(rawScenarioId),
-      runNumber: RunNumber(rawRunNumber),
-      ...(rawTraceId !== undefined ? { traceId: TraceId(rawTraceId) } : {}),
-    };
-    out.push(record);
-  }
+  for (const line of raw.split("\n")) {}
   return out;
 }
killedBy: ReportEmitter readRunsJsonl round-trips
statusReason: StrykerJS: Unknown test failure

[Survived] MethodExpression
src/emit/report.ts:196:21
   const raw = readFileSync(jsonlPath, "utf8");
   const out: RunRecord[] = [];
   for (const line of raw.split("\n")) {
-    const trimmed = line.trim();
+    const trimmed = line;
     if (trimmed.length === 0) continue;
     let parsed: unknown;

[Killed] EqualityOperator
src/emit/report.ts:197:9
   const out: RunRecord[] = [];
   for (const line of raw.split("\n")) {
     const trimmed = line.trim();
-    if (trimmed.length === 0) continue;
+    if (trimmed.length !== 0) continue;
     let parsed: unknown;
     try {
killedBy: ReportEmitter readRunsJsonl round-trips
statusReason: StrykerJS: Unknown test failure

[Survived] ConditionalExpression
src/emit/report.ts:197:9
   const out: RunRecord[] = [];
   for (const line of raw.split("\n")) {
     const trimmed = line.trim();
-    if (trimmed.length === 0) continue;
+    if (false) continue;
     let parsed: unknown;
     try {
