[Killed] BlockStatement
src/emit/report.ts:199:9
     const trimmed = line.trim();
     if (trimmed.length === 0) continue;
     let parsed: unknown;
-    try {
-      parsed = JSON.parse(trimmed);
-    } catch (err) {
+    try {} catch (err) {
       void err;
       // Skip malformed line; inflight-crash recovery is best-effort.
killedBy: ReportEmitter readRunsJsonl round-trips
statusReason: StrykerJS: Unknown test failure

[Survived] BlockStatement
src/emit/report.ts:201:19
     let parsed: unknown;
     try {
       parsed = JSON.parse(trimmed);
-    } catch (err) {
-      void err;
-      // Skip malformed line; inflight-crash recovery is best-effort.
-      continue;
-    }
+    } catch (err) {}
     if (!Value.Check(RunRecordSchema, parsed)) continue;
     const decoded = Value.Decode(RunRecordSchema, parsed);

[Killed] BooleanLiteral
src/emit/report.ts:206:9
       // Skip malformed line; inflight-crash recovery is best-effort.
       continue;
     }
-    if (!Value.Check(RunRecordSchema, parsed)) continue;
+    if (Value.Check(RunRecordSchema, parsed)) continue;
     const decoded = Value.Decode(RunRecordSchema, parsed);
     const { scenarioId: rawScenarioId, traceId: rawTraceId, runNumber: rawRunNumber, ...rest } = decoded;
killedBy: ReportEmitter readRunsJsonl round-trips
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/report.ts:206:9
       // Skip malformed line; inflight-crash recovery is best-effort.
       continue;
     }
-    if (!Value.Check(RunRecordSchema, parsed)) continue;
+    if (false) continue;
     const decoded = Value.Decode(RunRecordSchema, parsed);
     const { scenarioId: rawScenarioId, traceId: rawTraceId, runNumber: rawRunNumber, ...rest } = decoded;
killedBy: readRunsJsonl skips records that fail schema validation
statusReason: Unable to decode value as it does not match the expected schema
