[Survived] MethodExpression
src/emit/trace-adapter.ts:30:19
 // by extension; here we try JSON first then YAML.
 
 function parseEither(source: string): unknown {
-  const trimmed = source.trimStart();
+  const trimmed = source.trimEnd();
   if (trimmed.startsWith("{") || trimmed.startsWith("[")) {
     return JSON.parse(source);

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:31:7
 
 function parseEither(source: string): unknown {
   const trimmed = source.trimStart();
-  if (trimmed.startsWith("{") || trimmed.startsWith("[")) {
+  if (false) {
     return JSON.parse(source);
   }
killedBy: parseEither trimStart vs trimEnd discrimination JSON.parse is used for object source (not YAML.parse) — kills BlockStatement empty-body mutation
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:31:59
 
 function parseEither(source: string): unknown {
   const trimmed = source.trimStart();
-  if (trimmed.startsWith("{") || trimmed.startsWith("[")) {
-    return JSON.parse(source);
-  }
+  if (trimmed.startsWith("{") || trimmed.startsWith("[")) {}
   return YAML.parse(source);
 }
killedBy: parseEither trimStart vs trimEnd discrimination JSON.parse is used for object source (not YAML.parse) — kills BlockStatement empty-body mutation
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:40:9
 function decodeCanonical(source: string, originPath: string): Effect.Effect<Trace, TraceDecodeError, never> {
   return Effect.suspend(() => {
     let parsed: unknown;
-    try {
-      parsed = parseEither(source);
-    } catch (err) {
+    try {} catch (err) {
       return Effect.fail(
         new TraceDecodeError({
killedBy: canonicalTraceAdapter decodes a valid canonical JSON trace
statusReason: StrykerJS: Unknown test failure

[Survived] BlockStatement
src/emit/trace-adapter.ts:42:19
     let parsed: unknown;
     try {
       parsed = parseEither(source);
-    } catch (err) {
-      return Effect.fail(
-        new TraceDecodeError({
-          cause: {
-            _tag: "SchemaInvalid",
-            path: originPath,
-            errors: [err instanceof Error ? err.message : String(err)],
-          },
-        }),
-      );
-    }
+    } catch (err) {}
     const errs: string[] = [];
     for (const e of Value.Errors(TraceSchema, parsed)) {

[Killed] ArrayDeclaration
src/emit/trace-adapter.ts:48:21
           cause: {
             _tag: "SchemaInvalid",
             path: originPath,
-            errors: [err instanceof Error ? err.message : String(err)],
+            errors: [],
           },
         }),
killedBy: decodeCanonical parse-error message content surfaces parse error message in errors array when JSON is malformed
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/emit/trace-adapter.ts:53:28
         }),
       );
     }
-    const errs: string[] = [];
+    const errs: string[] = ["Stryker was here"];
     for (const e of Value.Errors(TraceSchema, parsed)) {
       errs.push(`${e.path} ${e.message}`);
killedBy: canonicalTraceAdapter decodes a valid canonical JSON trace
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:54:56
       );
     }
     const errs: string[] = [];
-    for (const e of Value.Errors(TraceSchema, parsed)) {
-      errs.push(`${e.path} ${e.message}`);
-    }
+    for (const e of Value.Errors(TraceSchema, parsed)) {}
     if (errs.length > 0) {
       return Effect.fail(
killedBy: canonicalTraceAdapter rejects invalid canonical payload
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:57:26
     for (const e of Value.Errors(TraceSchema, parsed)) {
       errs.push(`${e.path} ${e.message}`);
     }
-    if (errs.length > 0) {
-      return Effect.fail(
-        new TraceDecodeError({ cause: { _tag: "SchemaInvalid", path: originPath, errors: errs } }),
-      );
-    }
+    if (errs.length > 0) {}
     const decoded = Value.Decode(TraceSchema, parsed);
     const { scenarioId: rawScenarioId, traceId: rawTraceId, ...rest } = decoded;
killedBy: canonicalTraceAdapter rejects invalid canonical payload
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:103:27
 }
 
 function attrString(attrs: ReadonlyArray<OtelKeyValue>, key: string): string | undefined {
-  for (const kv of attrs) {
-    if (kv.key === key) {
-      const v = kv.value;
-      if (typeof v === "object" && v !== null) {
-        const inner: { stringValue?: unknown } = v;
-        if (typeof inner.stringValue === "string") return inner.stringValue;
-      }
-    }
-  }
+  for (const kv of attrs) {}
   return undefined;
 }
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/emit/trace-adapter.ts:104:9
 
 function attrString(attrs: ReadonlyArray<OtelKeyValue>, key: string): string | undefined {
   for (const kv of attrs) {
-    if (kv.key === key) {
+    if (kv.key !== key) {
       const v = kv.value;
       if (typeof v === "object" && v !== null) {
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:104:25
 
 function attrString(attrs: ReadonlyArray<OtelKeyValue>, key: string): string | undefined {
   for (const kv of attrs) {
-    if (kv.key === key) {
-      const v = kv.value;
-      if (typeof v === "object" && v !== null) {
-        const inner: { stringValue?: unknown } = v;
-        if (typeof inner.stringValue === "string") return inner.stringValue;
-      }
-    }
+    if (kv.key === key) {}
   }
   return undefined;
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:106:48
   for (const kv of attrs) {
     if (kv.key === key) {
       const v = kv.value;
-      if (typeof v === "object" && v !== null) {
-        const inner: { stringValue?: unknown } = v;
-        if (typeof inner.stringValue === "string") return inner.stringValue;
-      }
+      if (typeof v === "object" && v !== null) {}
     }
   }
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:116:27
 }
 
 function attrNumber(attrs: ReadonlyArray<OtelKeyValue>, key: string): number | undefined {
-  for (const kv of attrs) {
-    if (kv.key === key) {
-      const v = kv.value;
-      if (typeof v === "object" && v !== null) {
-        const inner: { intValue?: unknown; doubleValue?: unknown } = v;
-        if (typeof inner.intValue === "number") return inner.intValue;
-        if (typeof inner.intValue === "string") {
-          const n = Number(inner.intValue);
-          if (!Number.isNaN(n)) return n;
-        }
-        if (typeof inner.doubleValue === "number") return inner.doubleValue;
-      }
-    }
-  }
+  for (const kv of attrs) {}
   return undefined;
 }
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:117:9
 
 function attrNumber(attrs: ReadonlyArray<OtelKeyValue>, key: string): number | undefined {
   for (const kv of attrs) {
-    if (kv.key === key) {
+    if (true) {
       const v = kv.value;
       if (typeof v === "object" && v !== null) {
killedBy: otelTraceAdapter (additional coverage) coerces intValue numeric and doubleValue attributes
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:119:48
   for (const kv of attrs) {
     if (kv.key === key) {
       const v = kv.value;
-      if (typeof v === "object" && v !== null) {
-        const inner: { intValue?: unknown; doubleValue?: unknown } = v;
-        if (typeof inner.intValue === "number") return inner.intValue;
-        if (typeof inner.intValue === "string") {
-          const n = Number(inner.intValue);
-          if (!Number.isNaN(n)) return n;
-        }
-        if (typeof inner.doubleValue === "number") return inner.doubleValue;
-      }
+      if (typeof v === "object" && v !== null) {}
     }
   }
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:122:13
       if (typeof v === "object" && v !== null) {
         const inner: { intValue?: unknown; doubleValue?: unknown } = v;
         if (typeof inner.intValue === "number") return inner.intValue;
-        if (typeof inner.intValue === "string") {
+        if (false) {
           const n = Number(inner.intValue);
           if (!Number.isNaN(n)) return n;
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:122:49
       if (typeof v === "object" && v !== null) {
         const inner: { intValue?: unknown; doubleValue?: unknown } = v;
         if (typeof inner.intValue === "number") return inner.intValue;
-        if (typeof inner.intValue === "string") {
-          const n = Number(inner.intValue);
-          if (!Number.isNaN(n)) return n;
-        }
+        if (typeof inner.intValue === "string") {}
         if (typeof inner.doubleValue === "number") return inner.doubleValue;
       }
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:124:15
         if (typeof inner.intValue === "number") return inner.intValue;
         if (typeof inner.intValue === "string") {
           const n = Number(inner.intValue);
-          if (!Number.isNaN(n)) return n;
+          if (true) return n;
         }
         if (typeof inner.doubleValue === "number") return inner.doubleValue;
killedBy: attrNumber edge cases (otelTraceAdapter) intValue NaN string falls through to doubleValue
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
src/emit/trace-adapter.ts:124:15
         if (typeof inner.intValue === "number") return inner.intValue;
         if (typeof inner.intValue === "string") {
           const n = Number(inner.intValue);
-          if (!Number.isNaN(n)) return n;
+          if (Number.isNaN(n)) return n;
         }
         if (typeof inner.doubleValue === "number") return inner.doubleValue;
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:137:35
   const out: OtelSpan[] = [];
   const resourceSpans = env.resourceSpans;
   if (!Array.isArray(resourceSpans)) return out;
-  for (const rs of resourceSpans) {
-    if (typeof rs !== "object" || rs === null) continue;
-    const scopeSpans = (rs as { scopeSpans?: unknown }).scopeSpans;
-    if (!Array.isArray(scopeSpans)) continue;
-    for (const ss of scopeSpans) {
-      if (typeof ss !== "object" || ss === null) continue;
-      const spans = (ss as { spans?: unknown }).spans;
-      if (!Array.isArray(spans)) continue;
-      for (const s of spans) {
-        if (typeof s === "object" && s !== null) out.push(s);
-      }
-    }
-  }
+  for (const rs of resourceSpans) {}
   return out;
 }
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/emit/trace-adapter.ts:138:9
   const resourceSpans = env.resourceSpans;
   if (!Array.isArray(resourceSpans)) return out;
   for (const rs of resourceSpans) {
-    if (typeof rs !== "object" || rs === null) continue;
+    if (typeof rs !== "object" && rs === null) continue;
     const scopeSpans = (rs as { scopeSpans?: unknown }).scopeSpans;
     if (!Array.isArray(scopeSpans)) continue;
killedBy: spansFromEnvelope null-element filtering (otelTraceAdapter) skips null resourceSpans element (rs === null guard)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:138:9
   const resourceSpans = env.resourceSpans;
   if (!Array.isArray(resourceSpans)) return out;
   for (const rs of resourceSpans) {
-    if (typeof rs !== "object" || rs === null) continue;
+    if (false) continue;
     const scopeSpans = (rs as { scopeSpans?: unknown }).scopeSpans;
     if (!Array.isArray(scopeSpans)) continue;
killedBy: spansFromEnvelope null-element filtering (otelTraceAdapter) skips null resourceSpans element (rs === null guard)
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:141:34
     if (typeof rs !== "object" || rs === null) continue;
     const scopeSpans = (rs as { scopeSpans?: unknown }).scopeSpans;
     if (!Array.isArray(scopeSpans)) continue;
-    for (const ss of scopeSpans) {
-      if (typeof ss !== "object" || ss === null) continue;
-      const spans = (ss as { spans?: unknown }).spans;
-      if (!Array.isArray(spans)) continue;
-      for (const s of spans) {
-        if (typeof s === "object" && s !== null) out.push(s);
-      }
-    }
+    for (const ss of scopeSpans) {}
   }
   return out;
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/emit/trace-adapter.ts:142:11
     const scopeSpans = (rs as { scopeSpans?: unknown }).scopeSpans;
     if (!Array.isArray(scopeSpans)) continue;
     for (const ss of scopeSpans) {
-      if (typeof ss !== "object" || ss === null) continue;
+      if (typeof ss === "object" || ss === null) continue;
       const spans = (ss as { spans?: unknown }).spans;
       if (!Array.isArray(spans)) continue;
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:142:37
     const scopeSpans = (rs as { scopeSpans?: unknown }).scopeSpans;
     if (!Array.isArray(scopeSpans)) continue;
     for (const ss of scopeSpans) {
-      if (typeof ss !== "object" || ss === null) continue;
+      if (typeof ss !== "object" || false) continue;
       const spans = (ss as { spans?: unknown }).spans;
       if (!Array.isArray(spans)) continue;
killedBy: spansFromEnvelope null-element filtering (otelTraceAdapter) skips null scopeSpans element (ss === null guard)
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:145:30
       if (typeof ss !== "object" || ss === null) continue;
       const spans = (ss as { spans?: unknown }).spans;
       if (!Array.isArray(spans)) continue;
-      for (const s of spans) {
-        if (typeof s === "object" && s !== null) out.push(s);
-      }
+      for (const s of spans) {}
     }
   }
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:146:13
       const spans = (ss as { spans?: unknown }).spans;
       if (!Array.isArray(spans)) continue;
       for (const s of spans) {
-        if (typeof s === "object" && s !== null) out.push(s);
+        if (true) out.push(s);
       }
     }
killedBy: otelTraceAdapter (additional coverage) ignores spans that are not objects within a scopeSpans list
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:146:38
       const spans = (ss as { spans?: unknown }).spans;
       if (!Array.isArray(spans)) continue;
       for (const s of spans) {
-        if (typeof s === "object" && s !== null) out.push(s);
+        if (typeof s === "object" && true) out.push(s);
       }
     }
killedBy: otelTraceAdapter (additional coverage) ignores spans that are not objects within a scopeSpans list
statusReason: StrykerJS: Unknown test failure

[NoCoverage] ArrayDeclaration
src/emit/trace-adapter.ts:154:97
 }
 
 function toTurn(span: OtelSpan, index: number): Turn | null {
-  const attrs: ReadonlyArray<OtelKeyValue> = Array.isArray(span.attributes) ? span.attributes : [];
+  const attrs: ReadonlyArray<OtelKeyValue> = Array.isArray(span.attributes) ? span.attributes : ["Stryker was here"];
   const prompt = attrString(attrs, "gen_ai.prompt") ?? attrString(attrs, "input") ?? "";
   const response = attrString(attrs, "gen_ai.completion") ?? attrString(attrs, "output") ?? "";

[Killed] StringLiteral
src/emit/trace-adapter.ts:155:36
 
 function toTurn(span: OtelSpan, index: number): Turn | null {
   const attrs: ReadonlyArray<OtelKeyValue> = Array.isArray(span.attributes) ? span.attributes : [];
-  const prompt = attrString(attrs, "gen_ai.prompt") ?? attrString(attrs, "input") ?? "";
+  const prompt = attrString(attrs, "") ?? attrString(attrs, "input") ?? "";
   const response = attrString(attrs, "gen_ai.completion") ?? attrString(attrs, "output") ?? "";
   if (prompt === "" && response === "") return null;
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:157:7
   const attrs: ReadonlyArray<OtelKeyValue> = Array.isArray(span.attributes) ? span.attributes : [];
   const prompt = attrString(attrs, "gen_ai.prompt") ?? attrString(attrs, "input") ?? "";
   const response = attrString(attrs, "gen_ai.completion") ?? attrString(attrs, "output") ?? "";
-  if (prompt === "" && response === "") return null;
+  if (true) return null;
   const startNs = typeof span.startTimeUnixNano === "string" ? Number(span.startTimeUnixNano) : 0;
   const endNs = typeof span.endTimeUnixNano === "string" ? Number(span.endTimeUnixNano) : startNs;
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:157:7
   const attrs: ReadonlyArray<OtelKeyValue> = Array.isArray(span.attributes) ? span.attributes : [];
   const prompt = attrString(attrs, "gen_ai.prompt") ?? attrString(attrs, "input") ?? "";
   const response = attrString(attrs, "gen_ai.completion") ?? attrString(attrs, "output") ?? "";
-  if (prompt === "" && response === "") return null;
+  if (true && response === "") return null;
   const startNs = typeof span.startTimeUnixNano === "string" ? Number(span.startTimeUnixNano) : 0;
   const endNs = typeof span.endTimeUnixNano === "string" ? Number(span.endTimeUnixNano) : startNs;
killedBy: toTurn prompt/response short-circuit (otelTraceAdapter) span with only prompt (no response) is NOT filtered — kills || mutation
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:158:19
   const prompt = attrString(attrs, "gen_ai.prompt") ?? attrString(attrs, "input") ?? "";
   const response = attrString(attrs, "gen_ai.completion") ?? attrString(attrs, "output") ?? "";
   if (prompt === "" && response === "") return null;
-  const startNs = typeof span.startTimeUnixNano === "string" ? Number(span.startTimeUnixNano) : 0;
+  const startNs = true ? Number(span.startTimeUnixNano) : 0;
   const endNs = typeof span.endTimeUnixNano === "string" ? Number(span.endTimeUnixNano) : startNs;
   const latencyMs = Math.max(0, Math.round((endNs - startNs) / 1_000_000));
killedBy: otelTraceAdapter (additional coverage) latencyMs is 0 when startTimeUnixNano missing or not a string
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:158:19
   const prompt = attrString(attrs, "gen_ai.prompt") ?? attrString(attrs, "input") ?? "";
   const response = attrString(attrs, "gen_ai.completion") ?? attrString(attrs, "output") ?? "";
   if (prompt === "" && response === "") return null;
-  const startNs = typeof span.startTimeUnixNano === "string" ? Number(span.startTimeUnixNano) : 0;
+  const startNs = false ? Number(span.startTimeUnixNano) : 0;
   const endNs = typeof span.endTimeUnixNano === "string" ? Number(span.endTimeUnixNano) : startNs;
   const latencyMs = Math.max(0, Math.round((endNs - startNs) / 1_000_000));
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/emit/trace-adapter.ts:159:17
   const response = attrString(attrs, "gen_ai.completion") ?? attrString(attrs, "output") ?? "";
   if (prompt === "" && response === "") return null;
   const startNs = typeof span.startTimeUnixNano === "string" ? Number(span.startTimeUnixNano) : 0;
-  const endNs = typeof span.endTimeUnixNano === "string" ? Number(span.endTimeUnixNano) : startNs;
+  const endNs = typeof span.endTimeUnixNano !== "string" ? Number(span.endTimeUnixNano) : startNs;
   const latencyMs = Math.max(0, Math.round((endNs - startNs) / 1_000_000));
   return {
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:159:17
   const response = attrString(attrs, "gen_ai.completion") ?? attrString(attrs, "output") ?? "";
   if (prompt === "" && response === "") return null;
   const startNs = typeof span.startTimeUnixNano === "string" ? Number(span.startTimeUnixNano) : 0;
-  const endNs = typeof span.endTimeUnixNano === "string" ? Number(span.endTimeUnixNano) : startNs;
+  const endNs = false ? Number(span.endTimeUnixNano) : startNs;
   const latencyMs = Math.max(0, Math.round((endNs - startNs) / 1_000_000));
   return {
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ArithmeticOperator
src/emit/trace-adapter.ts:160:45
   if (prompt === "" && response === "") return null;
   const startNs = typeof span.startTimeUnixNano === "string" ? Number(span.startTimeUnixNano) : 0;
   const endNs = typeof span.endTimeUnixNano === "string" ? Number(span.endTimeUnixNano) : startNs;
-  const latencyMs = Math.max(0, Math.round((endNs - startNs) / 1_000_000));
+  const latencyMs = Math.max(0, Math.round((endNs + startNs) / 1_000_000));
   return {
     index,
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ArithmeticOperator
src/emit/trace-adapter.ts:160:44
   if (prompt === "" && response === "") return null;
   const startNs = typeof span.startTimeUnixNano === "string" ? Number(span.startTimeUnixNano) : 0;
   const endNs = typeof span.endTimeUnixNano === "string" ? Number(span.endTimeUnixNano) : startNs;
-  const latencyMs = Math.max(0, Math.round((endNs - startNs) / 1_000_000));
+  const latencyMs = Math.max(0, Math.round((endNs - startNs) * 1_000_000));
   return {
     index,
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:165:16
     index,
     prompt,
     response,
-    startedAt: startNs > 0 ? new Date(startNs / 1_000_000).toISOString() : new Date().toISOString(),
+    startedAt: true ? new Date(startNs / 1_000_000).toISOString() : new Date().toISOString(),
     latencyMs,
     toolCallCount: attrNumber(attrs, "gen_ai.tool_call_count") ?? 0,
killedBy: toTurn startedAt timestamp boundary (otelTraceAdapter) startNs = 0 produces a fallback ISO timestamp (kills >= 0 mutation)
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:165:16
     index,
     prompt,
     response,
-    startedAt: startNs > 0 ? new Date(startNs / 1_000_000).toISOString() : new Date().toISOString(),
+    startedAt: false ? new Date(startNs / 1_000_000).toISOString() : new Date().toISOString(),
     latencyMs,
     toolCallCount: attrNumber(attrs, "gen_ai.tool_call_count") ?? 0,
killedBy: toTurn startedAt timestamp boundary (otelTraceAdapter) positive startNs produces a correct ISO timestamp (kills false/true mutations)
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/trace-adapter.ts:167:38
     response,
     startedAt: startNs > 0 ? new Date(startNs / 1_000_000).toISOString() : new Date().toISOString(),
     latencyMs,
-    toolCallCount: attrNumber(attrs, "gen_ai.tool_call_count") ?? 0,
+    toolCallCount: attrNumber(attrs, "") ?? 0,
     inputTokens: attrNumber(attrs, "gen_ai.usage.input_tokens") ?? 0,
     outputTokens: attrNumber(attrs, "gen_ai.usage.output_tokens") ?? 0,
killedBy: otelTraceAdapter (additional coverage) coerces intValue numeric and doubleValue attributes
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/emit/trace-adapter.ts:169:37
     latencyMs,
     toolCallCount: attrNumber(attrs, "gen_ai.tool_call_count") ?? 0,
     inputTokens: attrNumber(attrs, "gen_ai.usage.input_tokens") ?? 0,
-    outputTokens: attrNumber(attrs, "gen_ai.usage.output_tokens") ?? 0,
+    outputTokens: attrNumber(attrs, "") ?? 0,
     cacheReadTokens: attrNumber(attrs, "gen_ai.usage.cache_read_input_tokens") ?? 0,
     cacheWriteTokens: attrNumber(attrs, "gen_ai.usage.cache_creation_input_tokens") ?? 0,
killedBy: otelTraceAdapter (additional coverage) coerces intValue numeric and doubleValue attributes
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:178:9
 function decodeOtel(source: string, originPath: string): Effect.Effect<Trace, TraceDecodeError, never> {
   return Effect.suspend(() => {
     let parsed: unknown;
-    try {
-      parsed = JSON.parse(source);
-    } catch (err) {
+    try {} catch (err) {
       return Effect.fail(
         new TraceDecodeError({
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:180:19
     let parsed: unknown;
     try {
       parsed = JSON.parse(source);
-    } catch (err) {
-      return Effect.fail(
-        new TraceDecodeError({
-          cause: {
-            _tag: "SchemaInvalid",
-            path: originPath,
-            errors: [err instanceof Error ? err.message : String(err)],
-          },
-        }),
-      );
-    }
+    } catch (err) {}
     if (typeof parsed !== "object" || parsed === null) {
       return Effect.fail(
killedBy: decodeOtel catch block preserves parse error semantics malformed JSON error message does NOT contain 'root is not an object'
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/emit/trace-adapter.ts:201:28
     const envelope: OtelEnvelope = parsed;
     const spans = spansFromEnvelope(envelope);
     const turns: Turn[] = [];
-    for (const s of spans) {
-      const t = toTurn(s, turns.length);
-      if (t !== null) turns.push(t);
-    }
+    for (const s of spans) {}
     if (turns.length === 0) {
       return Effect.fail(
killedBy: otelTraceAdapter extracts turns from gen_ai.* attributes
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:205:9
       const t = toTurn(s, turns.length);
       if (t !== null) turns.push(t);
     }
-    if (turns.length === 0) {
+    if (false) {
       return Effect.fail(
         new TraceDecodeError({
killedBy: main (yargs dispatch) main with score + otel trace-format dispatches via otel adapter
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/emit/trace-adapter.ts:205:9
       const t = toTurn(s, turns.length);
       if (t !== null) turns.push(t);
     }
-    if (turns.length === 0) {
+    if (turns.length !== 0) {
       return Effect.fail(
         new TraceDecodeError({
killedBy: main (yargs dispatch) main with score + otel trace-format dispatches via otel adapter
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/emit/trace-adapter.ts:208:69
     if (turns.length === 0) {
       return Effect.fail(
         new TraceDecodeError({
-          cause: { _tag: "SchemaInvalid", path: originPath, errors: ["no LLM spans found"] },
+          cause: { _tag: "SchemaInvalid", path: originPath, errors: [] },
         }),
       );
killedBy: decodeOtel no-LLM-spans error message empty resourceSpans yields SchemaInvalid with 'no LLM spans found' text
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/emit/trace-adapter.ts:217:25
       name: originPath,
       turns,
       expectedBehavior: "",
-      validationChecks: [],
+      validationChecks: ["Stryker was here"],
     };
     return Effect.succeed(trace);
killedBy: decodeOtel output Trace fixed fields successful decode produces empty validationChecks array
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/emit/trace-adapter.ts:230:5
 
 export function getTraceAdapter(format: TraceFormat): TraceAdapter {
   switch (format) {
-    case TRACE_FORMAT.Canonical:
-      return canonicalTraceAdapter;
+    case TRACE_FORMAT.Canonical:
     case TRACE_FORMAT.Otel:
       return otelTraceAdapter;
killedBy: getTraceAdapter dispatches by format
statusReason: expected 'otel' to be 'canonical' // Object.is equality
