[Killed] ConditionalExpression
src/judge/index.ts:53:29
 
 function renderDiff(diff: WorkspaceDiff | undefined): string {
-  if (diff === undefined || diff.changed.length === 0) return "(no workspace changes)";
+  if (diff === undefined || false) return "(no workspace changes)";
   const lines: string[] = [];
   for (const c of diff.changed) {
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `(no workspace changes)` when diff has empty changed array
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:53:29
 
 function renderDiff(diff: WorkspaceDiff | undefined): string {
-  if (diff === undefined || diff.changed.length === 0) return "(no workspace changes)";
+  if (diff === undefined || diff.changed.length !== 0) return "(no workspace changes)";
   const lines: string[] = [];
   for (const c of diff.changed) {
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `+ added` lines with byte count for before=null entries
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/judge/index.ts:54:27
 
 function renderDiff(diff: WorkspaceDiff | undefined): string {
   if (diff === undefined || diff.changed.length === 0) return "(no workspace changes)";
-  const lines: string[] = [];
+  const lines: string[] = ["Stryker was here"];
   for (const c of diff.changed) {
     if (c.before === null && c.after !== null) {
killedBy: AnthropicJudgeBackend renderPrompt blank line separators blank line appears between Transcript and Workspace diff sections
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:55:33
 function renderDiff(diff: WorkspaceDiff | undefined): string {
   if (diff === undefined || diff.changed.length === 0) return "(no workspace changes)";
   const lines: string[] = [];
-  for (const c of diff.changed) {
-    if (c.before === null && c.after !== null) {
-      lines.push(`+ added ${c.path} (${c.after.length} bytes)`);
-    } else if (c.before !== null && c.after === null) {
-      lines.push(`- removed ${c.path}`);
-    } else {
-      lines.push(`~ modified ${c.path}`);
-    }
-  }
+  for (const c of diff.changed) {}
   return lines.join("\n");
 }
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `+ added` lines with byte count for before=null entries
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:56:9
   if (diff === undefined || diff.changed.length === 0) return "(no workspace changes)";
   const lines: string[] = [];
   for (const c of diff.changed) {
-    if (c.before === null && c.after !== null) {
+    if (c.before !== null && c.after !== null) {
       lines.push(`+ added ${c.path} (${c.after.length} bytes)`);
     } else if (c.before !== null && c.after === null) {
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `+ added` lines with byte count for before=null entries
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:56:48
   if (diff === undefined || diff.changed.length === 0) return "(no workspace changes)";
   const lines: string[] = [];
   for (const c of diff.changed) {
-    if (c.before === null && c.after !== null) {
-      lines.push(`+ added ${c.path} (${c.after.length} bytes)`);
-    } else if (c.before !== null && c.after === null) {
+    if (c.before === null && c.after !== null) {} else if (c.before !== null && c.after === null) {
       lines.push(`- removed ${c.path}`);
     } else {
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `+ added` lines with byte count for before=null entries
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:58:55
   for (const c of diff.changed) {
     if (c.before === null && c.after !== null) {
       lines.push(`+ added ${c.path} (${c.after.length} bytes)`);
-    } else if (c.before !== null && c.after === null) {
-      lines.push(`- removed ${c.path}`);
-    } else {
+    } else if (c.before !== null && c.after === null) {} else {
       lines.push(`~ modified ${c.path}`);
     }
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `- removed` lines for after=null entries
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:58:16
   for (const c of diff.changed) {
     if (c.before === null && c.after !== null) {
       lines.push(`+ added ${c.path} (${c.after.length} bytes)`);
-    } else if (c.before !== null && c.after === null) {
+    } else if (false) {
       lines.push(`- removed ${c.path}`);
     } else {
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `- removed` lines for after=null entries
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:60:12
       lines.push(`+ added ${c.path} (${c.after.length} bytes)`);
     } else if (c.before !== null && c.after === null) {
       lines.push(`- removed ${c.path}`);
-    } else {
-      lines.push(`~ modified ${c.path}`);
-    }
+    } else {}
   }
   return lines.join("\n");
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `~ modified` for both-non-null entries
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:61:18
     } else if (c.before !== null && c.after === null) {
       lines.push(`- removed ${c.path}`);
     } else {
-      lines.push(`~ modified ${c.path}`);
+      lines.push(``);
     }
   }
killedBy: AnthropicJudgeBackend prompt content renderDiff emits `~ modified` for both-non-null entries
statusReason: StrykerJS: Unknown test failure

[Killed] ArrayDeclaration
src/judge/index.ts:68:27
 }
 
 function renderTurns(turns: ReadonlyArray<Turn>): string {
-  const parts: string[] = [];
+  const parts: string[] = ["Stryker was here"];
   for (const t of turns) {
     parts.push(`--- Turn ${t.index} ---`);
killedBy: AnthropicJudgeBackend renderDiff/renderTurns array initialization renderTurns output with 2 turns has exactly 6 lines per turn section
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:69:26
 
 function renderTurns(turns: ReadonlyArray<Turn>): string {
   const parts: string[] = [];
-  for (const t of turns) {
-    parts.push(`--- Turn ${t.index} ---`);
-    parts.push(`USER: ${t.prompt}`);
-    parts.push(`ASSISTANT: ${t.response}`);
-  }
+  for (const t of turns) {}
   return parts.join("\n");
 }
killedBy: AnthropicJudgeBackend prompt content renderTurns emits USER and ASSISTANT labels with turn index
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:72:16
   for (const t of turns) {
     parts.push(`--- Turn ${t.index} ---`);
     parts.push(`USER: ${t.prompt}`);
-    parts.push(`ASSISTANT: ${t.response}`);
+    parts.push(``);
   }
   return parts.join("\n");
killedBy: AnthropicJudgeBackend prompt content renderTurns emits USER and ASSISTANT labels with turn index
statusReason: StrykerJS: Unknown test failure

[Killed] ArithmeticOperator
src/judge/index.ts:79:54
 
 function renderPrompt(input: JudgeInput): string {
   const s = input.scenario;
-  const checks = s.validationChecks.map((c, i) => `${i + 1}. ${c}`).join("\n");
+  const checks = s.validationChecks.map((c, i) => `${i - 1}. ${c}`).join("\n");
   return [
     `# Scenario: ${s.name}`,
killedBy: AnthropicJudgeBackend prompt content renderPrompt includes scenario name, description, expectedBehavior, and validationChecks
statusReason: StrykerJS: Unknown test failure

[Killed] ArrowFunction
src/judge/index.ts:79:41
 
 function renderPrompt(input: JudgeInput): string {
   const s = input.scenario;
-  const checks = s.validationChecks.map((c, i) => `${i + 1}. ${c}`).join("\n");
+  const checks = s.validationChecks.map(() => undefined).join("\n");
   return [
     `# Scenario: ${s.name}`,
killedBy: AnthropicJudgeBackend prompt content renderPrompt includes scenario name, description, expectedBehavior, and validationChecks
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:81:5
   const s = input.scenario;
   const checks = s.validationChecks.map((c, i) => `${i + 1}. ${c}`).join("\n");
   return [
-    `# Scenario: ${s.name}`,
+    ``,
     `Description: ${s.description}`,
     `Expected behavior: ${s.expectedBehavior}`,
killedBy: AnthropicJudgeBackend prompt content renderPrompt includes scenario name, description, expectedBehavior, and validationChecks
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:82:5
   const checks = s.validationChecks.map((c, i) => `${i + 1}. ${c}`).join("\n");
   return [
     `# Scenario: ${s.name}`,
-    `Description: ${s.description}`,
+    ``,
     `Expected behavior: ${s.expectedBehavior}`,
     "",
killedBy: AnthropicJudgeBackend prompt content renderPrompt includes scenario name, description, expectedBehavior, and validationChecks
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/judge/index.ts:87:5
     "",
     "Validation checks (each must hold for pass=true):",
     checks,
-    "",
+    "Stryker was here!",
     "# Transcript",
     renderTurns(input.turns),
killedBy: AnthropicJudgeBackend renderPrompt section structure prompt sections are joined with newlines (not concatenated)
statusReason: StrykerJS: Unknown test failure

[Killed] MethodExpression
src/judge/index.ts:101:19
 function extractJsonText(text: string): string {
   // The prompt says no markdown fences, but models slip. Strip a leading
   // ```json / ``` fence pair if present. Never tries to repair the JSON body.
-  const trimmed = text.trim();
+  const trimmed = text;
   const fenceStart = /^```(?:json)?\s*/u;
   const fenceEnd = /\s*```\s*$/u;
killedBy: AnthropicJudgeBackend extractJsonText fence variations strips leading and trailing whitespace around fences
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] Regex
src/judge/index.ts:102:22
   // The prompt says no markdown fences, but models slip. Strip a leading
   // ```json / ``` fence pair if present. Never tries to repair the JSON body.
   const trimmed = text.trim();
-  const fenceStart = /^```(?:json)?\s*/u;
+  const fenceStart = /^```(?:json)?\s/u;
   const fenceEnd = /\s*```\s*$/u;
   return trimmed.replace(fenceStart, "").replace(fenceEnd, "").trim();

[Killed] Regex
src/judge/index.ts:103:20
   // ```json / ``` fence pair if present. Never tries to repair the JSON body.
   const trimmed = text.trim();
   const fenceStart = /^```(?:json)?\s*/u;
-  const fenceEnd = /\s*```\s*$/u;
+  const fenceEnd = /\s*```\s$/u;
   return trimmed.replace(fenceStart, "").replace(fenceEnd, "").trim();
 }
killedBy: AnthropicJudgeBackend strips markdown fences from text result before JSON.parse
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] Regex
src/judge/index.ts:103:20
   // ```json / ``` fence pair if present. Never tries to repair the JSON body.
   const trimmed = text.trim();
   const fenceStart = /^```(?:json)?\s*/u;
-  const fenceEnd = /\s*```\s*$/u;
+  const fenceEnd = /\s```\s*$/u;
   return trimmed.replace(fenceStart, "").replace(fenceEnd, "").trim();
 }

[Survived] MethodExpression
src/judge/index.ts:104:10
   const trimmed = text.trim();
   const fenceStart = /^```(?:json)?\s*/u;
   const fenceEnd = /\s*```\s*$/u;
-  return trimmed.replace(fenceStart, "").replace(fenceEnd, "").trim();
+  return trimmed.replace(fenceStart, "").replace(fenceEnd, "");
 }
 

[Killed] StringLiteral
src/judge/index.ts:121:14
 }
 
 function collectAssistantText(messages: ReadonlyArray<SDKMessage>): ParsedAssistantResult {
-  let text = "";
+  let text = "Stryker was here!";
   let structured: unknown = undefined;
   for (const m of messages) {
killedBy: AnthropicJudgeBackend assembles text from assistant message blocks when no result success message is present
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/judge/index.ts:123:29
 function collectAssistantText(messages: ReadonlyArray<SDKMessage>): ParsedAssistantResult {
   let text = "";
   let structured: unknown = undefined;
-  for (const m of messages) {
-    if (m.type === "result" && m.subtype === "success") {
-      text = m.result;
-      structured = m.structured_output;
-    } else if (m.type === "assistant") {
-      const content = m.message.content;
-      if (Array.isArray(content)) {
-        for (const block of content) {
-          if (
-            typeof block === "object" &&
-            block !== null &&
-            "type" in block &&
-            (block as { type: unknown }).type === "text" &&
-            "text" in block &&
-            typeof (block as { text: unknown }).text === "string"
-          ) {
-            text += (block as { text: string }).text;
-          }
-        }
-      }
-    }
-  }
+  for (const m of messages) {}
   return { text, structured };
 }
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/judge/index.ts:124:57
   let text = "";
   let structured: unknown = undefined;
   for (const m of messages) {
-    if (m.type === "result" && m.subtype === "success") {
-      text = m.result;
-      structured = m.structured_output;
-    } else if (m.type === "assistant") {
+    if (m.type === "result" && m.subtype === "success") {} else if (m.type === "assistant") {
       const content = m.message.content;
       if (Array.isArray(content)) {
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Timeout] BlockStatement
src/judge/index.ts:127:40
     if (m.type === "result" && m.subtype === "success") {
       text = m.result;
       structured = m.structured_output;
-    } else if (m.type === "assistant") {
-      const content = m.message.content;
-      if (Array.isArray(content)) {
-        for (const block of content) {
-          if (
-            typeof block === "object" &&
-            block !== null &&
-            "type" in block &&
-            (block as { type: unknown }).type === "text" &&
-            "text" in block &&
-            typeof (block as { text: unknown }).text === "string"
-          ) {
-            text += (block as { text: string }).text;
-          }
-        }
-      }
-    }
+    } else if (m.type === "assistant") {}
   }
   return { text, structured };

[Timeout] ConditionalExpression
src/judge/index.ts:129:11
       structured = m.structured_output;
     } else if (m.type === "assistant") {
       const content = m.message.content;
-      if (Array.isArray(content)) {
+      if (true) {
         for (const block of content) {
           if (

[Timeout] BlockStatement
src/judge/index.ts:129:35
       structured = m.structured_output;
     } else if (m.type === "assistant") {
       const content = m.message.content;
-      if (Array.isArray(content)) {
-        for (const block of content) {
-          if (
-            typeof block === "object" &&
-            block !== null &&
-            "type" in block &&
-            (block as { type: unknown }).type === "text" &&
-            "text" in block &&
-            typeof (block as { text: unknown }).text === "string"
-          ) {
-            text += (block as { text: string }).text;
-          }
-        }
-      }
+      if (Array.isArray(content)) {}
     }
   }

[Timeout] BlockStatement
src/judge/index.ts:130:38
     } else if (m.type === "assistant") {
       const content = m.message.content;
       if (Array.isArray(content)) {
-        for (const block of content) {
-          if (
-            typeof block === "object" &&
-            block !== null &&
-            "type" in block &&
-            (block as { type: unknown }).type === "text" &&
-            "text" in block &&
-            typeof (block as { text: unknown }).text === "string"
-          ) {
-            text += (block as { text: string }).text;
-          }
-        }
+        for (const block of content) {}
       }
     }

[Timeout] LogicalOperator
src/judge/index.ts:132:13
       if (Array.isArray(content)) {
         for (const block of content) {
           if (
-            typeof block === "object" &&
-            block !== null &&
-            "type" in block &&
-            (block as { type: unknown }).type === "text" &&
-            "text" in block &&
+            typeof block === "object" && block !== null && "type" in block && (block as {
+  type: unknown;
+}).type === "text" || "text" in block &&
             typeof (block as { text: unknown }).text === "string"
           ) {

[Timeout] LogicalOperator
src/judge/index.ts:132:13
       if (Array.isArray(content)) {
         for (const block of content) {
           if (
-            typeof block === "object" &&
-            block !== null &&
+            typeof block === "object" || block !== null &&
             "type" in block &&
             (block as { type: unknown }).type === "text" &&

[Timeout] EqualityOperator
src/judge/index.ts:133:13
         for (const block of content) {
           if (
             typeof block === "object" &&
-            block !== null &&
+            block === null &&
             "type" in block &&
             (block as { type: unknown }).type === "text" &&

[Timeout] ConditionalExpression
src/judge/index.ts:133:13
         for (const block of content) {
           if (
             typeof block === "object" &&
-            block !== null &&
+            true &&
             "type" in block &&
             (block as { type: unknown }).type === "text" &&

[Survived] ConditionalExpression
src/judge/index.ts:135:13
             typeof block === "object" &&
             block !== null &&
             "type" in block &&
-            (block as { type: unknown }).type === "text" &&
+            true &&
             "text" in block &&
             typeof (block as { text: unknown }).text === "string"

[Timeout] EqualityOperator
src/judge/index.ts:135:13
             typeof block === "object" &&
             block !== null &&
             "type" in block &&
-            (block as { type: unknown }).type === "text" &&
+            (block as {
+  type: unknown;
+}).type !== "text" &&
             "text" in block &&
             typeof (block as { text: unknown }).text === "string"

[Timeout] ConditionalExpression
src/judge/index.ts:137:13
             "type" in block &&
             (block as { type: unknown }).type === "text" &&
             "text" in block &&
-            typeof (block as { text: unknown }).text === "string"
+            true
           ) {
             text += (block as { text: string }).text;

[Timeout] EqualityOperator
src/judge/index.ts:137:13
             "type" in block &&
             (block as { type: unknown }).type === "text" &&
             "text" in block &&
-            typeof (block as { text: unknown }).text === "string"
+            typeof (block as {
+  text: unknown;
+}).text !== "string"
           ) {
             text += (block as { text: string }).text;

[Timeout] BlockStatement
src/judge/index.ts:138:13
             (block as { type: unknown }).type === "text" &&
             "text" in block &&
             typeof (block as { text: unknown }).text === "string"
-          ) {
-            text += (block as { text: string }).text;
-          }
+          ) {}
         }
       }

[Survived] BooleanLiteral
src/judge/index.ts:178:42
         maxTurns,
         abortController,
         systemPrompt: { type: "preset", preset: "claude_code", append: JUDGE_SYSTEM_PROMPT },
-        allowDangerouslySkipPermissions: true,
+        allowDangerouslySkipPermissions: false,
       },
     });

[Killed] ConditionalExpression
src/judge/index.ts:203:7
 
 function parseVerdict(parsed: ParsedAssistantResult): Effect.Effect<JudgeResult, JudgeAttemptError, never> {
   let value: unknown;
-  if (parsed.structured !== undefined && parsed.structured !== null) {
+  if (true && parsed.structured !== null) {
     value = parsed.structured;
   } else {
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/judge/index.ts:203:7
 
 function parseVerdict(parsed: ParsedAssistantResult): Effect.Effect<JudgeResult, JudgeAttemptError, never> {
   let value: unknown;
-  if (parsed.structured !== undefined && parsed.structured !== null) {
+  if (false) {
     value = parsed.structured;
   } else {
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/judge/index.ts:205:10
   let value: unknown;
   if (parsed.structured !== undefined && parsed.structured !== null) {
     value = parsed.structured;
-  } else {
-    const raw = extractJsonText(parsed.text);
-    if (raw.length === 0) {
-      return Effect.fail(new JudgeAttemptError("NoOutput", "judge model returned empty output"));
-    }
-    try {
-      value = JSON.parse(raw);
-    } catch (err) {
-      return Effect.fail(
-        new JudgeAttemptError(
-          "MalformedJson",
-          err instanceof Error ? err.message : String(err),
-        ),
-      );
-    }
-  }
+  } else {}
   return buildResult(value, 0);
 }
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/judge/index.ts:207:9
     value = parsed.structured;
   } else {
     const raw = extractJsonText(parsed.text);
-    if (raw.length === 0) {
+    if (raw.length !== 0) {
       return Effect.fail(new JudgeAttemptError("NoOutput", "judge model returned empty output"));
     }
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/judge/index.ts:207:27
     value = parsed.structured;
   } else {
     const raw = extractJsonText(parsed.text);
-    if (raw.length === 0) {
-      return Effect.fail(new JudgeAttemptError("NoOutput", "judge model returned empty output"));
-    }
+    if (raw.length === 0) {}
     try {
       value = JSON.parse(raw);
killedBy: AnthropicJudgeBackend folds empty text output into critical after retries exhausted
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:210:9
     if (raw.length === 0) {
       return Effect.fail(new JudgeAttemptError("NoOutput", "judge model returned empty output"));
     }
-    try {
-      value = JSON.parse(raw);
-    } catch (err) {
+    try {} catch (err) {
       return Effect.fail(
         new JudgeAttemptError(
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/judge/index.ts:212:19
     }
     try {
       value = JSON.parse(raw);
-    } catch (err) {
-      return Effect.fail(
-        new JudgeAttemptError(
-          "MalformedJson",
-          err instanceof Error ? err.message : String(err),
-        ),
-      );
-    }
+    } catch (err) {}
   }
   return buildResult(value, 0);
killedBy: AnthropicJudgeBackend folds malformed JSON into critical after retries exhausted
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:233:11
   }
   const raw: RawJudgeVerdict = value;
   const candidate = {
-    pass: typeof raw.pass === "boolean" ? raw.pass : false,
+    pass: typeof raw.pass !== "boolean" ? raw.pass : false,
     reason: typeof raw.reason === "string" ? raw.reason : "",
     issues: coerceIssues(raw.issues),
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:233:11
   }
   const raw: RawJudgeVerdict = value;
   const candidate = {
-    pass: typeof raw.pass === "boolean" ? raw.pass : false,
+    pass: false ? raw.pass : false,
     reason: typeof raw.reason === "string" ? raw.reason : "",
     issues: coerceIssues(raw.issues),
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:234:13
   const raw: RawJudgeVerdict = value;
   const candidate = {
     pass: typeof raw.pass === "boolean" ? raw.pass : false,
-    reason: typeof raw.reason === "string" ? raw.reason : "",
+    reason: false ? raw.reason : "",
     issues: coerceIssues(raw.issues),
     overallSeverity: coerceSeverity(raw.overallSeverity),
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:234:13
   const raw: RawJudgeVerdict = value;
   const candidate = {
     pass: typeof raw.pass === "boolean" ? raw.pass : false,
-    reason: typeof raw.reason === "string" ? raw.reason : "",
+    reason: typeof raw.reason !== "string" ? raw.reason : "",
     issues: coerceIssues(raw.issues),
     overallSeverity: coerceSeverity(raw.overallSeverity),
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[NoCoverage] BlockStatement
src/judge/index.ts:241:63
     retryCount,
   };
   const errs: string[] = [];
-  for (const e of Value.Errors(JudgeResultSchema, candidate)) {
-    errs.push(`${e.path} ${e.message}`);
-  }
+  for (const e of Value.Errors(JudgeResultSchema, candidate)) {}
   if (errs.length > 0) {
     return Effect.fail(new JudgeAttemptError("SchemaInvalid", errs.join("; ")));

[NoCoverage] StringLiteral
src/judge/index.ts:242:15
   };
   const errs: string[] = [];
   for (const e of Value.Errors(JudgeResultSchema, candidate)) {
-    errs.push(`${e.path} ${e.message}`);
+    errs.push(``);
   }
   if (errs.length > 0) {

[Timeout] EqualityOperator
src/judge/index.ts:244:7
   for (const e of Value.Errors(JudgeResultSchema, candidate)) {
     errs.push(`${e.path} ${e.message}`);
   }
-  if (errs.length > 0) {
+  if (errs.length >= 0) {
     return Effect.fail(new JudgeAttemptError("SchemaInvalid", errs.join("; ")));
   }

[Timeout] ConditionalExpression
src/judge/index.ts:244:7
   for (const e of Value.Errors(JudgeResultSchema, candidate)) {
     errs.push(`${e.path} ${e.message}`);
   }
-  if (errs.length > 0) {
+  if (true) {
     return Effect.fail(new JudgeAttemptError("SchemaInvalid", errs.join("; ")));
   }

[Killed] EqualityOperator
src/judge/index.ts:254:9
     issues: decoded.issues as ReadonlyArray<Issue>,
     overallSeverity: decoded.overallSeverity as IssueSeverity | null,
     retryCount: decoded.retryCount,
-    ...(decoded.judgeConfidence !== undefined ? { judgeConfidence: decoded.judgeConfidence } : {}),
+    ...(decoded.judgeConfidence === undefined ? { judgeConfidence: decoded.judgeConfidence } : {}),
   };
   return Effect.succeed(result);
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:254:9
     issues: decoded.issues as ReadonlyArray<Issue>,
     overallSeverity: decoded.overallSeverity as IssueSeverity | null,
     retryCount: decoded.retryCount,
-    ...(decoded.judgeConfidence !== undefined ? { judgeConfidence: decoded.judgeConfidence } : {}),
+    ...(true ? { judgeConfidence: decoded.judgeConfidence } : {}),
   };
   return Effect.succeed(result);
killedBy: AnthropicJudgeBackend buildResult validation paths valid verdict produces result with judgeConfidence spread only when present
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:262:26
 function coerceIssues(v: unknown): ReadonlyArray<Issue> {
   if (!Array.isArray(v)) return [];
   const out: Issue[] = [];
-  for (const entry of v) {
-    if (typeof entry !== "object" || entry === null) continue;
-    const e: { issue?: unknown; severity?: unknown } = entry;
-    if (typeof e.issue !== "string") continue;
-    const severity = coerceSeverity(e.severity);
-    if (severity === null) continue;
-    out.push({ issue: e.issue, severity });
-  }
+  for (const entry of v) {}
   return out;
 }
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: StrykerJS: Unknown test failure
