[Killed] EqualityOperator
src/judge/index.ts:263:9
   if (!Array.isArray(v)) return [];
   const out: Issue[] = [];
   for (const entry of v) {
-    if (typeof entry !== "object" || entry === null) continue;
+    if (typeof entry === "object" || entry === null) continue;
     const e: { issue?: unknown; severity?: unknown } = entry;
     if (typeof e.issue !== "string") continue;
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:263:38
   if (!Array.isArray(v)) return [];
   const out: Issue[] = [];
   for (const entry of v) {
-    if (typeof entry !== "object" || entry === null) continue;
+    if (typeof entry !== "object" || entry !== null) continue;
     const e: { issue?: unknown; severity?: unknown } = entry;
     if (typeof e.issue !== "string") continue;
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:274:47
 }
 
 function coerceSeverity(v: unknown): IssueSeverity | null {
-  if (v === "minor" || v === "significant" || v === "critical") return v;
+  if (v === "minor" || v === "significant" || false) return v;
   return null;
 }
killedBy: AnthropicJudgeBackend coerceIssues null-entry filtering drops issues with non-string .issue field
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/judge/index.ts:274:24
 }
 
 function coerceSeverity(v: unknown): IssueSeverity | null {
-  if (v === "minor" || v === "significant" || v === "critical") return v;
+  if (v === "minor" || false || v === "critical") return v;
   return null;
 }
killedBy: AnthropicJudgeBackend falls back to text result + JSON.parse when structured_output missing
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:280:7
 
 function coerceConfidence(v: unknown): number | undefined {
   if (typeof v !== "number" || Number.isNaN(v)) return undefined;
-  if (v < 0) return 0;
+  if (v >= 0) return 0;
   if (v > 1) return 1;
   return v;
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[Timeout] ConditionalExpression
src/judge/index.ts:280:7
 
 function coerceConfidence(v: unknown): number | undefined {
   if (typeof v !== "number" || Number.isNaN(v)) return undefined;
-  if (v < 0) return 0;
+  if (false) return 0;
   if (v > 1) return 1;
   return v;

[Killed] EqualityOperator
src/judge/index.ts:281:7
 function coerceConfidence(v: unknown): number | undefined {
   if (typeof v !== "number" || Number.isNaN(v)) return undefined;
   if (v < 0) return 0;
-  if (v > 1) return 1;
+  if (v <= 1) return 1;
   return v;
 }
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[Timeout] ConditionalExpression
src/judge/index.ts:281:7
 function coerceConfidence(v: unknown): number | undefined {
   if (typeof v !== "number" || Number.isNaN(v)) return undefined;
   if (v < 0) return 0;
-  if (v > 1) return 1;
+  if (false) return 1;
   return v;
 }

[Killed] BlockStatement
src/judge/index.ts:286:55
 }
 
 function sleepEff(ms: number): Effect.Effect<void, never, never> {
-  return Effect.async<void, never, never>((resume) => {
-    const t = setTimeout(() => resume(Effect.succeed(undefined)), ms);
-    return Effect.sync(() => {
-      clearTimeout(t);
-    });
-  });
+  return Effect.async<void, never, never>((resume) => {});
 }
 
killedBy: AnthropicJudgeBackend folds empty text output into critical after retries exhausted
statusReason: Test timed out in 10000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/judge/index.ts:287:26
 
 function sleepEff(ms: number): Effect.Effect<void, never, never> {
   return Effect.async<void, never, never>((resume) => {
-    const t = setTimeout(() => resume(Effect.succeed(undefined)), ms);
+    const t = setTimeout(() => undefined, ms);
     return Effect.sync(() => {
       clearTimeout(t);
killedBy: AnthropicJudgeBackend folds empty text output into critical after retries exhausted
statusReason: Test timed out in 10000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BlockStatement
src/judge/index.ts:288:30
 function sleepEff(ms: number): Effect.Effect<void, never, never> {
   return Effect.async<void, never, never>((resume) => {
     const t = setTimeout(() => resume(Effect.succeed(undefined)), ms);
-    return Effect.sync(() => {
-      clearTimeout(t);
-    });
+    return Effect.sync(() => {});
   });
 }

[Survived] StringLiteral
src/judge/index.ts:321:44
       Effect.flatMap(() => {
         abortController.abort();
         return Effect.fail<JudgeAttemptError>(
-          new JudgeAttemptError("Timeout", `per-attempt timeout after ${ms}ms`),
+          new JudgeAttemptError("Timeout", ``),
         );
       }),

[Survived] BlockStatement
src/judge/index.ts:337:35
   attempt: number,
 ): Effect.Effect<JudgeResult, JudgeAttemptError, never> {
   const abortController = new AbortController();
-  if (parentSignal !== undefined) {
-    if (parentSignal.aborted) abortController.abort();
-    else parentSignal.addEventListener("abort", () => abortController.abort(), { once: true });
-  }
+  if (parentSignal !== undefined) {}
   const prompt = renderPrompt(input);
   const collect = collectSdkMessages(prompt, model, maxTurns, abortController).pipe(

[Survived] ConditionalExpression
src/judge/index.ts:338:9
 ): Effect.Effect<JudgeResult, JudgeAttemptError, never> {
   const abortController = new AbortController();
   if (parentSignal !== undefined) {
-    if (parentSignal.aborted) abortController.abort();
+    if (false) abortController.abort();
     else parentSignal.addEventListener("abort", () => abortController.abort(), { once: true });
   }

[NoCoverage] BooleanLiteral
src/judge/index.ts:339:88
   const abortController = new AbortController();
   if (parentSignal !== undefined) {
     if (parentSignal.aborted) abortController.abort();
-    else parentSignal.addEventListener("abort", () => abortController.abort(), { once: true });
+    else parentSignal.addEventListener("abort", () => abortController.abort(), { once: false });
   }
   const prompt = renderPrompt(input);

[NoCoverage] ArrowFunction
src/judge/index.ts:339:49
   const abortController = new AbortController();
   if (parentSignal !== undefined) {
     if (parentSignal.aborted) abortController.abort();
-    else parentSignal.addEventListener("abort", () => abortController.abort(), { once: true });
+    else parentSignal.addEventListener("abort", () => undefined, { once: true });
   }
   const prompt = renderPrompt(input);

[Killed] BlockStatement
src/judge/index.ts:344:33
   const prompt = renderPrompt(input);
   const collect = collectSdkMessages(prompt, model, maxTurns, abortController).pipe(
     Effect.flatMap((messages) => {
-      for (const m of messages) {
-        if (m.type === "result" && m.subtype !== "success") {
-          return Effect.fail(
-            new JudgeAttemptError(
-              "ResultError",
-              m.errors.length > 0 ? m.errors.join("; ") : m.subtype,
-            ),
-          );
-        }
-      }
+      for (const m of messages) {}
       return parseVerdict(collectAssistantText(messages));
     }),
killedBy: AnthropicJudgeBackend criticalFallback issue content criticalFallback ResultError: issue contains ResultError kind
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/judge/index.ts:345:61
   const collect = collectSdkMessages(prompt, model, maxTurns, abortController).pipe(
     Effect.flatMap((messages) => {
       for (const m of messages) {
-        if (m.type === "result" && m.subtype !== "success") {
-          return Effect.fail(
-            new JudgeAttemptError(
-              "ResultError",
-              m.errors.length > 0 ? m.errors.join("; ") : m.subtype,
-            ),
-          );
-        }
+        if (m.type === "result" && m.subtype !== "success") {}
       }
       return parseVerdict(collectAssistantText(messages));
killedBy: AnthropicJudgeBackend criticalFallback issue content criticalFallback ResultError: issue contains ResultError kind
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:349:15
           return Effect.fail(
             new JudgeAttemptError(
               "ResultError",
-              m.errors.length > 0 ? m.errors.join("; ") : m.subtype,
+              m.errors.length <= 0 ? m.errors.join("; ") : m.subtype,
             ),
           );
killedBy: AnthropicJudgeBackend runAttempt ResultError branch ResultError with non-empty errors joins them with '; '
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:349:15
           return Effect.fail(
             new JudgeAttemptError(
               "ResultError",
-              m.errors.length > 0 ? m.errors.join("; ") : m.subtype,
+              m.errors.length >= 0 ? m.errors.join("; ") : m.subtype,
             ),
           );
killedBy: AnthropicJudgeBackend runAttempt ResultError branch ResultError with empty errors array uses subtype as message
statusReason: StrykerJS: Unknown test failure

[Survived] StringLiteral
src/judge/index.ts:383:74
 
     const loop = Effect.gen(function* () {
       let attempt = 0;
-      let lastErr: JudgeAttemptError = new JudgeAttemptError("NoOutput", "no attempts ran");
+      let lastErr: JudgeAttemptError = new JudgeAttemptError("NoOutput", "");
       while (attempt <= schedule.length) {
         if (attempt > 0) {

[Killed] EqualityOperator
src/judge/index.ts:384:14
     const loop = Effect.gen(function* () {
       let attempt = 0;
       let lastErr: JudgeAttemptError = new JudgeAttemptError("NoOutput", "no attempts ran");
-      while (attempt <= schedule.length) {
+      while (attempt > schedule.length) {
         if (attempt > 0) {
           const delay = schedule[attempt - 1] ?? 0;
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/judge/index.ts:384:14
     const loop = Effect.gen(function* () {
       let attempt = 0;
       let lastErr: JudgeAttemptError = new JudgeAttemptError("NoOutput", "no attempts ran");
-      while (attempt <= schedule.length) {
+      while (attempt < schedule.length) {
         if (attempt > 0) {
           const delay = schedule[attempt - 1] ?? 0;
killedBy: AnthropicJudgeBackend returns pass=true on a clean structured verdict
statusReason: StrykerJS: Unknown test failure

[Survived] EqualityOperator
src/judge/index.ts:385:13
       let attempt = 0;
       let lastErr: JudgeAttemptError = new JudgeAttemptError("NoOutput", "no attempts ran");
       while (attempt <= schedule.length) {
-        if (attempt > 0) {
+        if (attempt >= 0) {
           const delay = schedule[attempt - 1] ?? 0;
           yield* sleepEff(delay);

[Survived] ConditionalExpression
src/judge/index.ts:385:13
       let attempt = 0;
       let lastErr: JudgeAttemptError = new JudgeAttemptError("NoOutput", "no attempts ran");
       while (attempt <= schedule.length) {
-        if (attempt > 0) {
+        if (true) {
           const delay = schedule[attempt - 1] ?? 0;
           yield* sleepEff(delay);

[Survived] ArithmeticOperator
src/judge/index.ts:386:34
       let lastErr: JudgeAttemptError = new JudgeAttemptError("NoOutput", "no attempts ran");
       while (attempt <= schedule.length) {
         if (attempt > 0) {
-          const delay = schedule[attempt - 1] ?? 0;
+          const delay = schedule[attempt + 1] ?? 0;
           yield* sleepEff(delay);
         }

[Killed] AssignmentOperator
src/judge/index.ts:394:9
         );
         if (res._tag === "Right") return res.right;
         lastErr = res.left;
-        attempt += 1;
+        attempt -= 1;
       }
       return criticalFallback(lastErr, attempt - 1);
killedBy: AnthropicJudgeBackend folds empty text output into critical after retries exhausted
statusReason: Test timed out in 10000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArithmeticOperator
src/judge/index.ts:396:40
         lastErr = res.left;
         attempt += 1;
       }
-      return criticalFallback(lastErr, attempt - 1);
+      return criticalFallback(lastErr, attempt + 1);
     });
     return loop;
killedBy: AnthropicJudgeBackend folds empty text output into critical after retries exhausted
statusReason: StrykerJS: Unknown test failure
